{"id": "fdm3lu", "title": "CMV: It's time for more companies to start experimenting with the four day work week", "graph": [["Also the working class is not in 1 country, its global and the fact is that in our material reality we have the highest inequality in decades.", "Company stores were not some massive abuse of workers."], ["I recognize most of their services are software, but they also make laptops (and the various devices that relate to that) and Xbox.", "I highly doubt they really care about their factory workers if they're so willing to export their labor, and trust me, a company as big as Microsoft could 100% afford to move their factories to the US."], ["Car manufacturing was slow until the assembly line was introduced.", "Their workflow changes, and the status quo changed, but those things aren't productivity."], ["Any improvement in profitability and productivity would put a company at a competitive advantage and would catch on.", "The other problem you will face is that a business open 5 days wanting a receptionist for those hours will not increase pay for two employees."], ["Something a working class individual simply cannot afford in most circumstances.", "No, it's just this is a bourgeois myth, socialists and trade unions created the 40 hour work week and 5 day week."], ["For example, my work experience was as an RT manager and currently as a programmer.", "That's great in theory but I'm working 40 hours because it doesn't take too much of my time and I get an adequate salary."], ["Market forces are still caused by a bunch of biased ignorant humans.", "Companies are all about maximizing value and minimizing costs."], ["The entire infrastructure is in Azure (their cloud offering) so we don't have any physical/hardwarebased servers and most of the workstations are Microsoft Surfaces.", "The warehouse side of things for my current job feels like working for a different company."], ["** Your comment will be removed even if most of it is solid, another user was rude to you first, or you feel your remark was justified.", "Manufacturing has hit a wall in productivity for a while now, I have no idea why you think productivity has increased."], ["Literally everything a company ever does can be seen from the perspective of ulterior motives.", "A lot of CEOs feel strongly about their values and culture."], ["I read a post about someone who literally automated his job, emails and all, and watched movies all day.", "If you feel that is right then you need to start a company, or convince an existing company to change to this format and see if they get better performance from workers."], ["Is that a healthy and productive perspective to reduce people to their primary concern and pretend like it's also their ONLY concern?", "It's normal to feel affection for the people who sign your check but at the end of the day, anything they do, they do for profit."], ["The owners and shareholders of these corporations by driving out competitors create higher stock values and lock out the poor from being able to participate in the market.", "The concept of each predates and was implemented by capitalists before it was signed into labor laws."], ["Trying to guess where the consumer market is going, what trends will happen, etc.", "For hourly workers a 4 day work week means you get less money."], ["My current job pays *very* well, especially considering I don't have a degree, but it's just ass.", "No, it's just this is a bourgeois myth, socialists and trade unions created the 40 hour work week and 5 day week."], ["None of this even touches outsourcing which also helps drive up stock prices and allows international corporations to really drive local companies into the ground further, creating basically an aristocratic bourgeois class with little mobility but no legal restrictions against it per se.", "No, it's just this is a bourgeois myth, socialists and trade unions created the 40 hour work week and 5 day week."], ["You cant easily measure happiness, anxiety levels, and health, but those are the reasons many market regulations exist.", "They will actually likely *cut pay* due to the increased costs of a second employee (fringe benefits)."], ["The difference here is that Henry Ford experimented with his own company changing work hours and changing wages to get what he thought was better performance.", "For hourly workers a 4 day work week means you get less money."], ["Literally everything a company ever does can be seen from the perspective of ulterior motives.", "People could buy a Chinese phone with 2x the power at 1/3 the cost but they don't because of Apple's privacy policy."], ["I can't say I'm convinced this fits into the category of what this thread is on thoughunsure if that was the intention.", "Everyone is replaceable, but only if your numbers don't meet expectations."], ["Meaning, one 15 hour day would need 60 people with 8 hour shifts, but closer to 75 with 6 hour shifts and have overstaffing issues near the middle shifts due to high overlapso in total, about 105115 people as you can rotate them independently.", "I am talking about salaried roles where productivity doesnt equal hours worked and you are paid a fixed salary each year."], ["And tbh I also kind of forgot which subreddit I was in, I just started reading comments lol.", "I'm sure there are many different stories but I've always had the impression folks here care about the employees as a general rule."], ["Report other violations; do not retaliate.", "Companies, who have a virtual monopoly on a good and produce it for cheap even now can afford to pay high wages."], ["The entire infrastructure is in Azure (their cloud offering) so we don't have any physical/hardwarebased servers and most of the workstations are Microsoft Surfaces.", "Yespeople are replaceable but this doesn't mean the company doesn't care about them."], ["Counter intuitive science is really hard for many people to accept.", "For hourly workers a 4 day work week means you get less money."], ["The entire infrastructure is in Azure (their cloud offering) so we don't have any physical/hardwarebased servers and most of the workstations are Microsoft Surfaces.", "Chewy saves face by treating their customers and call center employees very well, they tend to have loyal customers for a reason."], ["Not trying to com off as hostile but do you not see the profit motive behind everything you mentioned?", "Bill and Melinda are prime examples of this (so long as you don't believe the drooling conspiracy theories)"], ["It is strange how many people say that \"companies ONLY do what's most profitable for them, they don't care about anything else and will always only act in their best interests, they're evil!\"", "If you feel that is right then you need to start a company, or convince an existing company to change to this format and see if they get better performance from workers."], ["if there was solid evidence that a 4day work week would increase productivity (and therefore profits) companies would switch to it in a heartbeat.", "If you feel that is right then you need to start a company, or convince an existing company to change to this format and see if they get better performance from workers."], ["People generally speaking do have upward mobility throughout their working careers.", "The concept of each predates and was implemented by capitalists before it was signed into labor laws."], ["Most hourly places today that don't have unions don't let people work more than 39 hours anyway.", "Few people make $15 an hour and fewer yet make $18.75."], ["Unfair generalisation, I can't think of q line of work that hadn't benefitted from electronics and software.", "When Andrew Yang did his AMA a while back, he linked to an article, productivity has gone up a lot over time, but that productivity was generated by the technology sector, not most other jobs."], ["I'm sorry you have had such poor experiences but your position is very extreme.", "It's normal to feel affection for the people who sign your check but at the end of the day, anything they do, they do for profit."], ["If I worked six hour days, I would cut out the breaks etc., and so my productivity would remain the same.", "Because less productive hours = less value to employer."], ["I recognize most of their services are software, but they also make laptops (and the various devices that relate to that) and Xbox.", "Vastly depends on your position in the company, there's a reason Microsoft products are mostly built in China (please prove me wrong if this is not the case though)."], ["So if you want to work for 5 days a week, or your employer offers to hire you for 5 days a week, they'd be put in a cage.", "There is no incentive for them to allow overtime (unless they cannot get enough employees) and no incentive for them to raise wages (otherwise they would already be at those higher rates)."], ["Can you name a good act that a company could do that cannot simply be dismissed in the same way you dismissed the other examples?", "The PTO days are something that the brass likely sees as a way to be competitive when finding employees and don't for a second doubt what good will can generate, they got you talking, didn't they?"], ["There have already been studies on the 32 hour work weeks in the EU.", "That same argument could have been made for the six day work week in Henry Fords time though?"], ["Meaning, one 15 hour day would need 60 people with 8 hour shifts, but closer to 75 with 6 hour shifts and have overstaffing issues near the middle shifts due to high overlapso in total, about 105115 people as you can rotate them independently.", "The idea behind this is productivity should remain the same, and if you're in a salaried position in the type or role this would come into play, an employer wouldn't be able to cut your salary."], ["Something a working class individual simply cannot afford in most circumstances.", "Company stores were not some massive abuse of workers."], ["Can you name a good act that a company could do that cannot simply be dismissed in the same way you dismissed the other examples?", "It's normal to feel affection for the people who sign your check but at the end of the day, anything they do, they do for profit."], ["I recognize most of their services are software, but they also make laptops (and the various devices that relate to that) and Xbox.", "The warehouse side of things for my current job feels like working for a different company."], ["I've seen folks that would've otherwise been let go be put into other positions because of org changes that weren't a natural fit to give them opportunities instead of losing a job even though they prob weren't the best choice for a position.", "I'm sure there are many different stories but I've always had the impression folks here care about the employees as a general rule."], ["Depends on the work too: tedious and trivial tasks I don't mind doing in the last few hours.", "For hourly, I'd adjust whatever the hourly rate is currently."], ["There are a lot of people like this, and they are often miserable.", "Few people make $15 an hour and fewer yet make $18.75."], ["The entire infrastructure is in Azure (their cloud offering) so we don't have any physical/hardwarebased servers and most of the workstations are Microsoft Surfaces.", "Both of those links are about the salary raise, not the 6 to 5 day work schedule."], ["No the exploited global south should throw off the exploitative relationship it has with the imperialist north in global revolution because otherwise we are too divided by western hegemony to properly defend the proletarian class interest and advance socialism", "When that happens obviously the amount of labour required by citizens of the locked country must increase just to sustain the same level of living conditions."], ["Oh I'm sure you're high as fuck, because any sane person that bothers to read history wouldn't be claiming that the market is monopoly or that communism is good economics.", "The concept of each predates and was implemented by capitalists before it was signed into labor laws."], ["Highly depends on the job and on what you would want to use your extra time off on.", "For hourly, I'd adjust whatever the hourly rate is currently."], ["Because people are stuck in their habits.", "The other problem you will face is that a business open 5 days wanting a receptionist for those hours will not increase pay for two employees."], ["Meaning, one 15 hour day would need 60 people with 8 hour shifts, but closer to 75 with 6 hour shifts and have overstaffing issues near the middle shifts due to high overlapso in total, about 105115 people as you can rotate them independently.", "If we shifted to 6 hours back when i was an RTM, we would have coverage issues because you need to cover from 8AM to 11 PM."], ["My current job pays *very* well, especially considering I don't have a degree, but it's just ass.", "Yespeople are replaceable but this doesn't mean the company doesn't care about them."], ["Trying to guess where the consumer market is going, what trends will happen, etc.", "If you feel that is right then you need to start a company, or convince an existing company to change to this format and see if they get better performance from workers."], ["I was given tedious repetitive tasks, often nothing at all, and nobody cared about my lack of editing powerpoints on friday.", "For hourly workers a 4 day work week means you get less money."], ["There have already been studies on the 32 hour work weeks in the EU.", "Few people make $15 an hour and fewer yet make $18.75."], ["And those are pretty conservative numbers.", "That's great in theory but I'm working 40 hours because it doesn't take too much of my time and I get an adequate salary."], ["So if you want to work for 5 days a week, or your employer offers to hire you for 5 days a week, they'd be put in a cage.", "For hourly, I'd adjust whatever the hourly rate is currently."], ["I can't say I'm convinced this fits into the category of what this thread is on thoughunsure if that was the intention.", "My current job pays *very* well, especially considering I don't have a degree, but it's just ass."], ["I've seen folks that would've otherwise been let go be put into other positions because of org changes that weren't a natural fit to give them opportunities instead of losing a job even though they prob weren't the best choice for a position.", "It's normal to feel affection for the people who sign your check but at the end of the day, anything they do, they do for profit."], ["I've seen folks that would've otherwise been let go be put into other positions because of org changes that weren't a natural fit to give them opportunities instead of losing a job even though they prob weren't the best choice for a position.", "There's a very common phrase here 'do the right thing' and often this means 'do what is right in a personal relationship' not 'do the right thing so we don't get sued' type of thing."], ["I recognize most of their services are software, but they also make laptops (and the various devices that relate to that) and Xbox.", "Both of those links are about the salary raise, not the 6 to 5 day work schedule."], ["The entire infrastructure is in Azure (their cloud offering) so we don't have any physical/hardwarebased servers and most of the workstations are Microsoft Surfaces.", "No, it's just this is a bourgeois myth, socialists and trade unions created the 40 hour work week and 5 day week."], ["I recognize most of their services are software, but they also make laptops (and the various devices that relate to that) and Xbox.", "I realize there's not a single warehouse out there that treats their employees with respect, but Chewy was ridiculous."], ["I've seen people's jobs (prior company) intentionally spared because they were going through cancer treatment and their position was going to be removed.", "It's normal to feel affection for the people who sign your check but at the end of the day, anything they do, they do for profit."], ["So, if this is such a good ideawhere is the 'Amazons' of the world doing this forcing the changes?", "The other problem you will face is that a business open 5 days wanting a receptionist for those hours will not increase pay for two employees."], ["Something a working class individual simply cannot afford in most circumstances.", "The evil monopolists were government cronies getting their funding from the state, not free market entrepreneurs."], ["Most hourly places today that don't have unions don't let people work more than 39 hours anyway.", "For hourly, I'd adjust whatever the hourly rate is currently."], ["We get more done with less effort than ever before, but the productivity relative to the potential productivity of our society is sorely lacking.", "Few people make $15 an hour and fewer yet make $18.75."], ["Companies (at least publicly traded) only care about profit.", "But through my job I've interacted with many c suite officials and upper management at large publicly traded companies."], ["I can't say I'm convinced this fits into the category of what this thread is on thoughunsure if that was the intention.", "They aren't legally required to provide AC because they technically don't own the warehouse, but we also won't lax the dress code so you can do physical labor a little more comfortably!"], ["If an issue arises, that's where i usually show up and deal with it, or bring in a small crew.", "Any site that has 4 10 hour days sounds like a cruisy government contract that is over paying."], ["That's the worst part of the weird stagnant economy we're in.", "There is no point in producing more merchandise or offering more services than you can sell by market limit."], ["Can you name a good act that a company could do that cannot simply be dismissed in the same way you dismissed the other examples?", "Bill and Melinda are prime examples of this (so long as you don't believe the drooling conspiracy theories)"], ["Right now, as a programmer, working for 6 hours is outright less programming.", "The idea behind this is productivity should remain the same, and if you're in a salaried position in the type or role this would come into play, an employer wouldn't be able to cut your salary."], ["Literally everything a company ever does can be seen from the perspective of ulterior motives.", "They saw a %10 jump minimum... That's millions in value and a niche \"product\" that no one else offers."], ["Speaking from experience: companies prefer overtime to hiring more people.", "Few people make $15 an hour and fewer yet make $18.75."], ["I recognize most of their services are software, but they also make laptops (and the various devices that relate to that) and Xbox.", "Not Henry fucking Ford who exploited the shit out of all his workers just like every entrepreneurial shark of the time"], ["So if you want to work for 5 days a week, or your employer offers to hire you for 5 days a week, they'd be put in a cage.", "If you feel that is right then you need to start a company, or convince an existing company to change to this format and see if they get better performance from workers."], ["Surethere are electronic devices manufactured in China but this is the state of electronics manufacturing worldwide for what is probably the majority of electronics.", "No, it's just this is a bourgeois myth, socialists and trade unions created the 40 hour work week and 5 day week."], ["Market forces are still caused by a bunch of biased ignorant humans.", "The other problem you will face is that a business open 5 days wanting a receptionist for those hours will not increase pay for two employees."], ["In his case that may be true, but it's quite common for computer programmers to really only be productive maybe 4 hours per day and to just \"look busy\" the other four hours.", "For hourly workers a 4 day work week means you get less money."], ["The entire infrastructure is in Azure (their cloud offering) so we don't have any physical/hardwarebased servers and most of the workstations are Microsoft Surfaces.", "My current job pays *very* well, especially considering I don't have a degree, but it's just ass."], ["I can't say I'm convinced this fits into the category of what this thread is on thoughunsure if that was the intention.", "People can raise complaints about sexual harassment just to be told \"we can't do anything.\" Conditions were horrible, the warehouse was filthy, and nothing was ever good enough for management."], ["But again with a 4 day work week I would have one day a week I could actually schedule appointments for.", "For hourly workers a 4 day work week means you get less money."], ["Oh I'm sure you're high as fuck, because any sane person that bothers to read history wouldn't be claiming that the market is monopoly or that communism is good economics.", "The evil monopolists were government cronies getting their funding from the state, not free market entrepreneurs."], ["Restaurants open up and close down faster than any other business I can think of, as far as I've seen.", "For hourly, I'd adjust whatever the hourly rate is currently."], ["I recognize most of their services are software, but they also make laptops (and the various devices that relate to that) and Xbox.", "Yespeople are replaceable but this doesn't mean the company doesn't care about them."], ["Trying to guess where the consumer market is going, what trends will happen, etc.", "Companies are run by people."], ["u/steamplshel – your comment has been removed for breaking Rule 2:**Don't be rude or hostile to other users.", "Manufacturing has hit a wall in productivity for a while now, I have no idea why you think productivity has increased."], ["Most hourly places today that don't have unions don't let people work more than 39 hours anyway.", "There is no incentive for them to allow overtime (unless they cannot get enough employees) and no incentive for them to raise wages (otherwise they would already be at those higher rates)."], ["Like I mentioned, these large companies can be somewhat slow to change, so they are trying it out in small pockets to work out the details before taking it to a larger population.", "The other problem you will face is that a business open 5 days wanting a receptionist for those hours will not increase pay for two employees."], ["I can't say I'm convinced this fits into the category of what this thread is on thoughunsure if that was the intention.", "Yespeople are replaceable but this doesn't mean the company doesn't care about them."], ["Many companies are in balance with the laws of supply and demandeven if there is a \"gain\" in productivity this is not necessarily and literally something positive for a company, strange as it may sound.", "For hourly, I'd adjust whatever the hourly rate is currently."], ["Well, they should start making some noise or voting for the right people or joining unions.", "They also only have a lunch break if their shift is 8 hours or more."], ["Lower earners are typically younger while richer people are generally older.", "Company stores were not some massive abuse of workers."], ["Right now, as a programmer, working for 6 hours is outright less programming.", "That's great in theory but I'm working 40 hours because it doesn't take too much of my time and I get an adequate salary."], ["The workers I am talking about do not have paid annual leave, sick leave, or maternity leave.", "For hourly workers a 4 day work week means you get less money."], ["If you bothered to see what is driving it you would know that it's because some people are getting richer, not that others are getting poorer.", "Also the working class is not in 1 country, its global and the fact is that in our material reality we have the highest inequality in decades."], ["The entire infrastructure is in Azure (their cloud offering) so we don't have any physical/hardwarebased servers and most of the workstations are Microsoft Surfaces.", "I realize there's not a single warehouse out there that treats their employees with respect, but Chewy was ridiculous."], ["Literally everything a company ever does can be seen from the perspective of ulterior motives.", "Companies (at least publicly traded) only care about profit."], ["People could buy a Chinese phone with 2x the power at 1/3 the cost but they don't because of Apple's privacy policy.", "Apple could copy android's approach to data privacy and they'd substantially increase their revenue."], ["They generate less revenue than they would if they sold user data and eased privacy protections.", "No, it's just this is a bourgeois myth, socialists and trade unions created the 40 hour work week and 5 day week."], ["Also the working class is not in 1 country, its global and the fact is that in our material reality we have the highest inequality in decades.", "The concept of each predates and was implemented by capitalists before it was signed into labor laws."], ["If you can't increase hourly productivity, you're essentially removing some of the jobs from the marketeither it can be done cheaper elsewhere or the returns don't justify the costs anymore.", "For hourly workers a 4 day work week means you get less money."], ["I think it would basically be companies realising that their employees could switch to a 4 day week (for the same salary) and get the same amount of work done in the long run due to being happier and healthier.", "For hourly workers a 4 day work week means you get less money."], ["That doesnt mean we should always stick with status quo.", "What you are proposing is forcing this idea on peoplewhich *WILL CUT SALARIES* in many jobs."], ["Literally everything a company ever does can be seen from the perspective of ulterior motives.", "Corporate values are definitely feel good buzzwords."], ["More employees = more benefits and training cost, OT is a much more inexpensive route.", "For hourly workers a 4 day work week means you get less money."], ["That same argument could have been made for the six day work week in Henry Fords time though?", "For hourly workers a 4 day work week means you get less money."], ["It is strange how many people say that \"companies ONLY do what's most profitable for them, they don't care about anything else and will always only act in their best interests, they're evil!\"", "Few people make $15 an hour and fewer yet make $18.75."], ["I've seen folks that would've otherwise been let go be put into other positions because of org changes that weren't a natural fit to give them opportunities instead of losing a job even though they prob weren't the best choice for a position.", "Bill and Melinda are prime examples of this (so long as you don't believe the drooling conspiracy theories)"], ["I've seen people's jobs (prior company) intentionally spared because they were going through cancer treatment and their position was going to be removed.", "Bill and Melinda are prime examples of this (so long as you don't believe the drooling conspiracy theories)"], ["Can you name a good act that a company could do that cannot simply be dismissed in the same way you dismissed the other examples?", "Apple could copy android's approach to data privacy and they'd substantially increase their revenue."], ["None of this even touches outsourcing which also helps drive up stock prices and allows international corporations to really drive local companies into the ground further, creating basically an aristocratic bourgeois class with little mobility but no legal restrictions against it per se.", "The evil monopolists were government cronies getting their funding from the state, not free market entrepreneurs."], ["I've seen folks that would've otherwise been let go be put into other positions because of org changes that weren't a natural fit to give them opportunities instead of losing a job even though they prob weren't the best choice for a position.", "Yespeople are replaceable but this doesn't mean the company doesn't care about them."], ["Because people are stuck in their habits", "The other problem you will face is that a business open 5 days wanting a receptionist for those hours will not increase pay for two employees."], ["Seattle, in specific, functions mostly as a union in the employee protection laws and policies it has in place.", "For hourly workers a 4 day work week means you get less money."], ["There are entire sectors of economy where this is just not possibleyou can't just cut a 30 minute doctor visit into a 25 minute visit if all the necessary tests take the same amount of time as before.", "For hourly workers a 4 day work week means you get less money."], ["Report other violations; do not retaliate.", "Manufacturing has hit a wall in productivity for a while now, I have no idea why you think productivity has increased."], ["I know YOU didn't necessarily say the first sentence, but lots of people do, and they want to have it both ways.", "If you feel that is right then you need to start a company, or convince an existing company to change to this format and see if they get better performance from workers."], ["The entire infrastructure is in Azure (their cloud offering) so we don't have any physical/hardwarebased servers and most of the workstations are Microsoft Surfaces.", "They aren't legally required to provide AC because they technically don't own the warehouse, but we also won't lax the dress code so you can do physical labor a little more comfortably!"], ["A company, for example, may not need a secretary to attend \"more\" people (she may even already have some idle time), but it does need her to attend people during the period in which the company will be operating.", "For hourly, I'd adjust whatever the hourly rate is currently."], ["There have already been studies on the 32 hour work weeks in the EU.", "For hourly, I'd adjust whatever the hourly rate is currently."], ["Something a working class individual simply cannot afford in most circumstances.", "Something a working class individual simply cannot afford in most circumstances."], ["I can't say I'm convinced this fits into the category of what this thread is on thoughunsure if that was the intention.", "No, it's just this is a bourgeois myth, socialists and trade unions created the 40 hour work week and 5 day week."], ["If the actual tasks and work is completed on time then why would this be an issue?", "For hourly, I'd adjust whatever the hourly rate is currently."], ["There are entire sectors of economy where this is just not possibleyou can't just cut a 30 minute doctor visit into a 25 minute visit if all the necessary tests take the same amount of time as before.", "For hourly, I'd adjust whatever the hourly rate is currently."], ["I've seen folks that would've otherwise been let go be put into other positions because of org changes that weren't a natural fit to give them opportunities instead of losing a job even though they prob weren't the best choice for a position.", "I work for Microsoft (for over seven years)."], ["I recognize most of their services are software, but they also make laptops (and the various devices that relate to that) and Xbox.", "But god forbid you even try talking about better pay or environment and you get fired for unionization threats."], ["If the argument is that it's good for the people themselves it's a different argument altogether, not the one OP presented.", "They will actually likely *cut pay* due to the increased costs of a second employee (fringe benefits)."], ["Surethere are electronic devices manufactured in China but this is the state of electronics manufacturing worldwide for what is probably the majority of electronics.", "Both of those links are about the salary raise, not the 6 to 5 day work schedule."], ["You cant easily measure happiness, anxiety levels, and health, but those are the reasons many market regulations exist.", "The other problem you will face is that a business open 5 days wanting a receptionist for those hours will not increase pay for two employees."], ["Restaurant margin is super, super thin, and competition is crazy.", "For hourly, I'd adjust whatever the hourly rate is currently."], ["Also the natural tendency for the rate of profit from labour is to fall, as we see with the rapidly falling stocks recently, profit rates haven't recovered since the 50's and we had a monopoly on industrialization.", "If a new steel working plant tries to get set up in this day and age, they will probably not make enough to be profitable and will be bought up/driven out of the market by established companies."], ["The entire infrastructure is in Azure (their cloud offering) so we don't have any physical/hardwarebased servers and most of the workstations are Microsoft Surfaces.", "Vastly depends on your position in the company, there's a reason Microsoft products are mostly built in China (please prove me wrong if this is not the case though)."], ["Literally everything a company ever does can be seen from the perspective of ulterior motives.", "The PTO days are something that the brass likely sees as a way to be competitive when finding employees and don't for a second doubt what good will can generate, they got you talking, didn't they?"], ["It is strange how many people say that \"companies ONLY do what's most profitable for them, they don't care about anything else and will always only act in their best interests, they're evil!\"", "Companies are run by people."], ["And tbh I also kind of forgot which subreddit I was in, I just started reading comments lol.", "People can raise complaints about sexual harassment just to be told \"we can't do anything.\" Conditions were horrible, the warehouse was filthy, and nothing was ever good enough for management."], ["The difference here is that Henry Ford experimented with his own company changing work hours and changing wages to get what he thought was better performance.", "For hourly, I'd adjust whatever the hourly rate is currently."], ["That doesnt mean we should always stick with status quo.", "They will actually likely *cut pay* due to the increased costs of a second employee (fringe benefits)."], ["Market forces are still caused by a bunch of biased ignorant humans.", "As I pointed out above, there is actually good reasons to think money would *decrease* with increased number of employees to cover hours and hourly wages would go down making people less moneyboth total and per hour."], ["Like it's impossible to be charitable and nice and kind when survival is your primary concern.", "Yespeople are replaceable but this doesn't mean the company doesn't care about them."], ["I recognize most of their services are software, but they also make laptops (and the various devices that relate to that) and Xbox.", "I'm sure there are many different stories but I've always had the impression folks here care about the employees as a general rule."], ["They would be happier, healthier and more refreshed from a 3 day weekend, and would take less sick days off too so the same amount of work would get done anyway.", "For hourly, I'd adjust whatever the hourly rate is currently."], ["Also the natural tendency for the rate of profit from labour is to fall, as we see with the rapidly falling stocks recently, profit rates haven't recovered since the 50's and we had a monopoly on industrialization.", "The concept of each predates and was implemented by capitalists before it was signed into labor laws."], ["The minimum wage in my city is $15/hour, McDonald's is currently paying $16.25/hour down the street from me... now granted that's in my immediate area and most of the US that isn't the case but — it's definitely a thing and becoming more widespread and common  in other states as well.", "For hourly workers a 4 day work week means you get less money."], ["I can't say I'm convinced this fits into the category of what this thread is on thoughunsure if that was the intention.", "Both of those links are about the salary raise, not the 6 to 5 day work schedule."], ["Something a working class individual simply cannot afford in most circumstances.", "This is something that also allows them to run at a higher loss than newer companies."], ["And tbh I also kind of forgot which subreddit I was in, I just started reading comments lol.", "I work for Microsoft (for over seven years)."], ["In his case that may be true, but it's quite common for computer programmers to really only be productive maybe 4 hours per day and to just \"look busy\" the other four hours.", "Unless everybody is doing 4x10, I would prefer to work 5x8 hours, be more productive, get more things done, and ask for a raise earlier."], ["If the actual tasks and work is completed on time then why would this be an issue?", "I don't know many people willing to have an extra day off a week for that pay cut."], ["I can't say I'm convinced this fits into the category of what this thread is on thoughunsure if that was the intention.", "I'm sure there are many different stories but I've always had the impression folks here care about the employees as a general rule."], ["So if you want to work for 5 days a week, or your employer offers to hire you for 5 days a week, they'd be put in a cage.", "If we go to a 4 day work week, it's possible we would start to fall behind and lose market share if our competitors are all working a 5 day work week."], ["So if you want to work for 5 days a week, or your employer offers to hire you for 5 days a week, they'd be put in a cage.", "If the working week was lowered to 32 and you therefor got overtime for anything more than that most businesses would simply hire more people rather than raise wages or pay overtime."], ["Comments that are only links, jokes or \"written upvotes\" will be removed.", "No, it's just this is a bourgeois myth, socialists and trade unions created the 40 hour work week and 5 day week."], ["The truth is there are thousands of business psychologists, and other related positions whose sole job it is is to find out how to make employees (and companies) more productive, and that if there was solid evidence that a 4day work week would increase productivity (and therefore profits) companies would switch to it in a heartbeat.", "If you feel that is right then you need to start a company, or convince an existing company to change to this format and see if they get better performance from workers."], ["The entire infrastructure is in Azure (their cloud offering) so we don't have any physical/hardwarebased servers and most of the workstations are Microsoft Surfaces.", "There's a very common phrase here 'do the right thing' and often this means 'do what is right in a personal relationship' not 'do the right thing so we don't get sued' type of thing."], ["Something a working class individual simply cannot afford in most circumstances.", "None of this even touches outsourcing which also helps drive up stock prices and allows international corporations to really drive local companies into the ground further, creating basically an aristocratic bourgeois class with little mobility but no legal restrictions against it per se."], ["There's a plenty of legislation that cuts into company profit because it benefits employees and society at large, such as work environment laws, regulations on working conditions, rights that cannot be signed away in a contract, etc.", "The other problem you will face is that a business open 5 days wanting a receptionist for those hours will not increase pay for two employees."], ["College is great for some people.", "The other problem you will face is that a business open 5 days wanting a receptionist for those hours will not increase pay for two employees."], ["Right now, as a programmer, working for 6 hours is outright less programming.", "Because less productive hours = less value to employer."], ["If the person goes to work fewer hours, you will have to hire more employees, which will not reflect in more \"sales\", will only imply more expenses and a smaller margin.", "For hourly, I'd adjust whatever the hourly rate is currently."], ["Something a working class individual simply cannot afford in most circumstances.", "Both of those links are about the salary raise, not the 6 to 5 day work schedule."], ["For that matter even Bill and Melinda, the exceptions you named, can easily be twisted into only doing good for their own sake (such as maintaining their celebrity status and staying in the news as charitable figures).", "But through my job I've interacted with many c suite officials and upper management at large publicly traded companies."], ["Humor and affirmations of agreement can be contained within more substantial comments.", "No, it's just this is a bourgeois myth, socialists and trade unions created the 40 hour work week and 5 day week."], ["Not trying to com off as hostile but do you not see the profit motive behind everything you mentioned?", "Apple could copy android's approach to data privacy and they'd substantially increase their revenue."], ["They would be happier, healthier and more refreshed from a 3 day weekend, and would take less sick days off too so the same amount of work would get done anyway.", "I don't know many people willing to have an extra day off a week for that pay cut."], ["Highly depends on the job and on what you would want to use your extra time off on.", "For hourly workers a 4 day work week means you get less money."], ["People generally speaking do have upward mobility throughout their working careers.", "None of this even touches outsourcing which also helps drive up stock prices and allows international corporations to really drive local companies into the ground further, creating basically an aristocratic bourgeois class with little mobility but no legal restrictions against it per se."], ["If you bothered to see what is driving it you would know that it's because some people are getting richer, not that others are getting poorer.", "If a new steel working plant tries to get set up in this day and age, they will probably not make enough to be profitable and will be bought up/driven out of the market by established companies."], ["Trying to guess where the consumer market is going, what trends will happen, etc.", "For hourly, I'd adjust whatever the hourly rate is currently."], ["** Your comment will be removed even if most of it is solid, another user was rude to you first, or you feel your remark was justified.", "No, it's just this is a bourgeois myth, socialists and trade unions created the 40 hour work week and 5 day week."], ["Otherwise, **All of my overworking would have been unnecessary, and my entire identity as a hard working world killer would be threatened.", "If you feel that is right then you need to start a company, or convince an existing company to change to this format and see if they get better performance from workers."], ["Save for one, every single salaried man in my department had divorced their first wife (turns out, wives like having husbands...who knew).", "Yespeople are replaceable but this doesn't mean the company doesn't care about them."], ["It's damn fewer than it should be, but it's not \"few people\".", "Few people make $15 an hour and fewer yet make $18.75."], ["Literally everything a company ever does can be seen from the perspective of ulterior motives.", "No, it's just this is a bourgeois myth, socialists and trade unions created the 40 hour work week and 5 day week."], ["Ultimately for the working class, especially those being paid minimum wage they dont have the money to invest into stocks and create enough of a profit for upward mobility, plus those who end up losing money and are bought out by larger holders who arent affected in a material way by losing percentages of their wealth.", "The concept of each predates and was implemented by capitalists before it was signed into labor laws."], ["Not trying to com off as hostile but do you not see the profit motive behind everything you mentioned?", "I work for Microsoft (for over seven years)."], ["If the actual tasks and work is completed on time then why would this be an issue?", "For hourly workers a 4 day work week means you get less money."], ["None of this even touches outsourcing which also helps drive up stock prices and allows international corporations to really drive local companies into the ground further, creating basically an aristocratic bourgeois class with little mobility but no legal restrictions against it per se.", "Company stores were not some massive abuse of workers."], ["That same argument could have been made for the six day work week in Henry Fords time though?", "If the working week was lowered to 32 and you therefor got overtime for anything more than that most businesses would simply hire more people rather than raise wages or pay overtime."], ["Not trying to com off as hostile but do you not see the profit motive behind everything you mentioned?", "But through my job I've interacted with many c suite officials and upper management at large publicly traded companies."], ["Something a working class individual simply cannot afford in most circumstances.", "If a new steel working plant tries to get set up in this day and age, they will probably not make enough to be profitable and will be bought up/driven out of the market by established companies."], ["Market forces are still caused by a bunch of biased ignorant humans.", "There is no reason to believe changing hours for workers is going to earn more money for the company."], ["So if you want to work for 5 days a week, or your employer offers to hire you for 5 days a week, they'd be put in a cage.", "For hourly workers a 4 day work week means you get less money."], ["I recognize most of their services are software, but they also make laptops (and the various devices that relate to that) and Xbox.", "People can raise complaints about sexual harassment just to be told \"we can't do anything.\" Conditions were horrible, the warehouse was filthy, and nothing was ever good enough for management."], ["A McDonald's worker cleaning up the bathrooms could be more proactive than NASA.", "The assembly line is a tool, that greatly increased the outcome."], ["And tbh I also kind of forgot which subreddit I was in, I just started reading comments lol.", "Surethere are electronic devices manufactured in China but this is the state of electronics manufacturing worldwide for what is probably the majority of electronics."], ["I was given tedious repetitive tasks, often nothing at all, and nobody cared about my lack of editing powerpoints on friday.", "For hourly, I'd adjust whatever the hourly rate is currently."], ["I've seen folks that would've otherwise been let go be put into other positions because of org changes that weren't a natural fit to give them opportunities instead of losing a job even though they prob weren't the best choice for a position.", "No, it's just this is a bourgeois myth, socialists and trade unions created the 40 hour work week and 5 day week."], ["Nobody is arguing that a doctor should be able to go through 100 patients a day with today's tools.", "Their workflow changes, and the status quo changed, but those things aren't productivity."], ["Apologies if slightly off topic, but I \"kinda\" work a 4 day week, or at least get 4 days off every 4 working days lol, so wanted to add my opinion :)", "For hourly, I'd adjust whatever the hourly rate is currently."], ["Oh I'm sure you're high as fuck, because any sane person that bothers to read history wouldn't be claiming that the market is monopoly or that communism is good economics.", "None of this even touches outsourcing which also helps drive up stock prices and allows international corporations to really drive local companies into the ground further, creating basically an aristocratic bourgeois class with little mobility but no legal restrictions against it per se."], ["If I worked six hour days, I would cut out the breaks etc., and so my productivity would remain the same.", "That's great in theory but I'm working 40 hours because it doesn't take too much of my time and I get an adequate salary."], ["in Scandinavia the employer has to pay for sick leave, mandatory 5 week vacation (with extra vacation sales to boot), huge amounts of parental leave, and so on.", "They will actually likely *cut pay* due to the increased costs of a second employee (fringe benefits)."], ["Otherwise, **All of my overworking would have been unnecessary, and my entire identity as a hard working world killer would be threatened.", "For hourly workers a 4 day work week means you get less money."], ["The laws have to make it financially damaging to make those decisions.", "Both of those links are about the salary raise, not the 6 to 5 day work schedule."], ["So if you want to work for 5 days a week, or your employer offers to hire you for 5 days a week, they'd be put in a cage.", "I personally know several peoples who's job it is to sit in a room and watch movies all day, and once a week they get called in for a 15 minute fix."], ["Literally everything a company ever does can be seen from the perspective of ulterior motives.", "Apple could copy android's approach to data privacy and they'd substantially increase their revenue."], ["I can't say I'm convinced this fits into the category of what this thread is on thoughunsure if that was the intention.", "), obviously they have AC because of customers, but working in a 115+ building all summer absolutely sucks, especially when part of the dress code is jeans/jean shorts only."], ["Surethere are electronic devices manufactured in China but this is the state of electronics manufacturing worldwide for what is probably the majority of electronics.", "Everyone is replaceable, but only if your numbers don't meet expectations."], ["Depends on the work too: tedious and trivial tasks I don't mind doing in the last few hours.", "For hourly workers a 4 day work week means you get less money."], ["The market is not a full monopoly and it is also regulated tightly by the government.", "Company stores were not some massive abuse of workers."], ["The entire infrastructure is in Azure (their cloud offering) so we don't have any physical/hardwarebased servers and most of the workstations are Microsoft Surfaces.", "In my experience, even outside of warehousing, companies only care about bottom line."], ["Right now, as a programmer, working for 6 hours is outright less programming.", "You seem to be taking about hourly rate jobs and manual labour jobs where more hours means more produce."], ["We should try to get a fourhour work week out there for already salaried workers, while fighting for wage labour and their working and living conditions to the best of our abilities.", "For hourly workers a 4 day work week means you get less money."], ["There are whole schools of mainstream economic thought (the Keynesians, the Austrian School, etc.)", "If that doesn't work you can read your own links again and try to understand them, cause you sure got them wrong."], ["Better quality of life for more people, studies show that accumulating more than a 75,000 salary doesn't increase happiness, and also not being a miserly, greedy fuck?", "In the case of retail/restaurants that are open seven days a week, this argument translates to 32 hour work week"], ["The market is not a full monopoly and it is also regulated tightly by the government.", "The concept of each predates and was implemented by capitalists before it was signed into labor laws."], ["None of this even touches outsourcing which also helps drive up stock prices and allows international corporations to really drive local companies into the ground further, creating basically an aristocratic bourgeois class with little mobility but no legal restrictions against it per se.", "Then why did the market create monopoly, company stores, exploit the shit out of workers and use slavery when not restricted by the US government in the 1800's, the \"Golden Age\" of the free market so to speak."], ["Meaning, one 15 hour day would need 60 people with 8 hour shifts, but closer to 75 with 6 hour shifts and have overstaffing issues near the middle shifts due to high overlapso in total, about 105115 people as you can rotate them independently.", "Because less productive hours = less value to employer."], ["We are in the office for longer, but we spend lots of time on borderline idiotic, totally unneccesary meetings, or we spend hours on working in a mentally fatigued state, where things that might take 10 minutes to figure out the next day take hours instead, because things simply don't click.", "For hourly, I'd adjust whatever the hourly rate is currently."], ["Trying to guess where the consumer market is going, what trends will happen, etc.", "Few people make $15 an hour and fewer yet make $18.75."], ["There are whole schools of mainstream economic thought (the Keynesians, the Austrian School, etc.)", "Of course we are more productive with modern technology than before."], ["— lots of health issues means a lot of missed work, even when I stack 34 appointments.", "For hourly workers a 4 day work week means you get less money."], ["I've seen people's jobs (prior company) intentionally spared because they were going through cancer treatment and their position was going to be removed.", "Yespeople are replaceable but this doesn't mean the company doesn't care about them."], ["And tbh I also kind of forgot which subreddit I was in, I just started reading comments lol.", "Everyone is replaceable, but only if your numbers don't meet expectations."], ["Something a working class individual simply cannot afford in most circumstances.", "These well established companies have already purchased the means of production required to do steel working."], ["I recognize most of their services are software, but they also make laptops (and the various devices that relate to that) and Xbox.", "), obviously they have AC because of customers, but working in a 115+ building all summer absolutely sucks, especially when part of the dress code is jeans/jean shorts only."], ["They generate less revenue than they would if they sold user data and eased privacy protections.", "It's normal to feel affection for the people who sign your check but at the end of the day, anything they do, they do for profit."], ["Otherwise, **All of my overworking would have been unnecessary, and my entire identity as a hard working world killer would be threatened.", "There is no incentive for them to allow overtime (unless they cannot get enough employees) and no incentive for them to raise wages (otherwise they would already be at those higher rates)."], ["The laws have to make it financially damaging to make those decisions.", "No, it's just this is a bourgeois myth, socialists and trade unions created the 40 hour work week and 5 day week."], ["I recognize most of their services are software, but they also make laptops (and the various devices that relate to that) and Xbox.", "Sorry for going on this ridiculous tangent, this is just something that makes my blood boil."], ["People are often shortsighted, and mistrustful of evidence and change, and have a Really hard time trusting things that aren't straightforward and obvious.", "For hourly workers a 4 day work week means you get less money."], ["I've seen people's jobs (prior company) intentionally spared because they were going through cancer treatment and their position was going to be removed.", "I work for Microsoft (for over seven years)."], ["Otherwise, **All of my overworking would have been unnecessary, and my entire identity as a hard working world killer would be threatened.", "Counter intuitive science is really hard for many people to accept."], ["Also the natural tendency for the rate of profit from labour is to fall, as we see with the rapidly falling stocks recently, profit rates haven't recovered since the 50's and we had a monopoly on industrialization.", "Company stores were not some massive abuse of workers."], ["I recognize most of their services are software, but they also make laptops (and the various devices that relate to that) and Xbox.", "In my experience, even outside of warehousing, companies only care about bottom line."], ["I've seen folks that would've otherwise been let go be put into other positions because of org changes that weren't a natural fit to give them opportunities instead of losing a job even though they prob weren't the best choice for a position.", "I don't know a religious family that doesn't make that place their #1 stop for chicken sandwiches."], ["I think it would basically be companies realising that their employees could switch to a 4 day week (for the same salary) and get the same amount of work done in the long run due to being happier and healthier.", "For hourly, I'd adjust whatever the hourly rate is currently."], ["Companies are run by people.", "If you feel that is right then you need to start a company, or convince an existing company to change to this format and see if they get better performance from workers."], ["I can't say I'm convinced this fits into the category of what this thread is on thoughunsure if that was the intention.", "I realize there's not a single warehouse out there that treats their employees with respect, but Chewy was ridiculous."], ["The entire infrastructure is in Azure (their cloud offering) so we don't have any physical/hardwarebased servers and most of the workstations are Microsoft Surfaces.", "I talk to people who work store side for us and they have better time off policies, scheduling, dress code (we aren't allowed to wear shirts with designs on them... It's a warehouse!"], ["Literally everything a company ever does can be seen from the perspective of ulterior motives.", "Apple being pro security and anti data collection sells yearly upgrades to their incredibly overpriced and underperforming products."], ["I recognize most of their services are software, but they also make laptops (and the various devices that relate to that) and Xbox.", "No, it's just this is a bourgeois myth, socialists and trade unions created the 40 hour work week and 5 day week."], ["Surethere are electronic devices manufactured in China but this is the state of electronics manufacturing worldwide for what is probably the majority of electronics.", "I work for Microsoft (for over seven years)."], ["Better quality of life for more people, studies show that accumulating more than a 75,000 salary doesn't increase happiness, and also not being a miserly, greedy fuck?", "For hourly, I'd adjust whatever the hourly rate is currently."], ["I'm sorry you have had such poor experiences but your position is very extreme.", "A business will always be primarily concerned with profitability but that doesn't mean they are ONLY concerned with profit or even that they are concerned with maximizing profit without regard for anything else."], ["Most hourly places today that don't have unions don't let people work more than 39 hours anyway.", "For hourly workers a 4 day work week means you get less money."], ["Poverty is decreasing, and poverty is the real problem.", "The concept of each predates and was implemented by capitalists before it was signed into labor laws."], ["Literally everything a company ever does can be seen from the perspective of ulterior motives.", "I'm not saying it's good or bad just that governments role in the modern era is to moderate these giants."], ["So if you want to work for 5 days a week, or your employer offers to hire you for 5 days a week, they'd be put in a cage.", "Few people make $15 an hour and fewer yet make $18.75."], ["Literally everything a company ever does can be seen from the perspective of ulterior motives.", "Bill and Melinda are prime examples of this (so long as you don't believe the drooling conspiracy theories)"], ["The entire infrastructure is in Azure (their cloud offering) so we don't have any physical/hardwarebased servers and most of the workstations are Microsoft Surfaces.", "But god forbid you even try talking about better pay or environment and you get fired for unionization threats."], ["You cant easily measure happiness, anxiety levels, and health, but those are the reasons many market regulations exist.", "What you are proposing is forcing this idea on peoplewhich *WILL CUT SALARIES* in many jobs."], ["Meaning, one 15 hour day would need 60 people with 8 hour shifts, but closer to 75 with 6 hour shifts and have overstaffing issues near the middle shifts due to high overlapso in total, about 105115 people as you can rotate them independently.", "That's great in theory but I'm working 40 hours because it doesn't take too much of my time and I get an adequate salary."], ["Oh, and then there was the [class action sexual and racial harassment/discrimination lawsuit](https://www.nytimes.com/interactive/2017/12/19/us/fordchicagosexualharassment.html).", "There's a very common phrase here 'do the right thing' and often this means 'do what is right in a personal relationship' not 'do the right thing so we don't get sued' type of thing."], ["Poverty is decreasing, and poverty is the real problem.", "Company stores were not some massive abuse of workers."], ["I recognize most of their services are software, but they also make laptops (and the various devices that relate to that) and Xbox.", "I talk to people who work store side for us and they have better time off policies, scheduling, dress code (we aren't allowed to wear shirts with designs on them... It's a warehouse!"], ["** Your comment will be removed even if most of it is solid, another user was rude to you first, or you feel your remark was justified.", "Companies, who have a virtual monopoly on a good and produce it for cheap even now can afford to pay high wages."], ["Oh I'm sure you're high as fuck, because any sane person that bothers to read history wouldn't be claiming that the market is monopoly or that communism is good economics.", "Company stores were not some massive abuse of workers."], ["They generate less revenue than they would if they sold user data and eased privacy protections.", "Yespeople are replaceable but this doesn't mean the company doesn't care about them."], ["Not trying to com off as hostile but do you not see the profit motive behind everything you mentioned?", "It's normal to feel affection for the people who sign your check but at the end of the day, anything they do, they do for profit."], ["We are in the office for longer, but we spend lots of time on borderline idiotic, totally unneccesary meetings, or we spend hours on working in a mentally fatigued state, where things that might take 10 minutes to figure out the next day take hours instead, because things simply don't click.", "For hourly workers a 4 day work week means you get less money."], ["The workers I am talking about do not have paid annual leave, sick leave, or maternity leave.", "You're saying everything that was said about paid annual leave, sick leave, maternity leave, lunch breaks and any other benefits people have gained in employment."], ["Something a working class individual simply cannot afford in most circumstances.", "Because there are plenty of sources I will link to socialists being the driving force behind this change but nothing backs up that other than Henry Ford and a few fringe cases."], ["They would be happier, healthier and more refreshed from a 3 day weekend, and would take less sick days off too so the same amount of work would get done anyway.", "For hourly workers a 4 day work week means you get less money."], ["Save for one, every single salaried man in my department had divorced their first wife (turns out, wives like having husbands...who knew).", "I work for Microsoft (for over seven years)."], ["That same argument could have been made for the six day work week in Henry Fords time though?", "For hourly, I'd adjust whatever the hourly rate is currently."], ["Any improvement in profitability and productivity would put a company at a competitive advantage and would catch on.", "They will actually likely *cut pay* due to the increased costs of a second employee (fringe benefits)."], ["If the person goes to work fewer hours, you will have to hire more employees, which will not reflect in more \"sales\", will only imply more expenses and a smaller margin.", "In the case of retail/restaurants that are open seven days a week, this argument translates to 32 hour work week"], ["None of this even touches outsourcing which also helps drive up stock prices and allows international corporations to really drive local companies into the ground further, creating basically an aristocratic bourgeois class with little mobility but no legal restrictions against it per se.", "Examples include companies like Standard Oil which never gained 100% market share and always had competition."], ["For example, my work experience was as an RT manager and currently as a programmer.", "The idea behind this is productivity should remain the same, and if you're in a salaried position in the type or role this would come into play, an employer wouldn't be able to cut your salary."], ["A healthy restaurant should bottom line 10%, am dm for multiple restaurants.", "For hourly, I'd adjust whatever the hourly rate is currently."], ["Otherwise, **All of my overworking would have been unnecessary, and my entire identity as a hard working world killer would be threatened.", "Few people make $15 an hour and fewer yet make $18.75."], ["Oh, and then there was the [class action sexual and racial harassment/discrimination lawsuit](https://www.nytimes.com/interactive/2017/12/19/us/fordchicagosexualharassment.html).", "Yespeople are replaceable but this doesn't mean the company doesn't care about them."], ["There are whole schools of mainstream economic thought (the Keynesians, the Austrian School, etc.)", "I can't even begin to imagine how much longer accounting work for example before computers and spreadsheets."], ["Most hourly places today that don't have unions don't let people work more than 39 hours anyway.", "If the working week was lowered to 32 and you therefor got overtime for anything more than that most businesses would simply hire more people rather than raise wages or pay overtime."], ["And tbh I also kind of forgot which subreddit I was in, I just started reading comments lol.", "No, it's just this is a bourgeois myth, socialists and trade unions created the 40 hour work week and 5 day week."], ["So if you want to work for 5 days a week, or your employer offers to hire you for 5 days a week, they'd be put in a cage.", "If people were more productive, they could easily work half the time and still get everything they get done now done still."], ["That doesnt mean we should always stick with status quo.", "The other problem you will face is that a business open 5 days wanting a receptionist for those hours will not increase pay for two employees."], ["And tbh I also kind of forgot which subreddit I was in, I just started reading comments lol.", "The warehouse side of things for my current job feels like working for a different company."], ["The entire infrastructure is in Azure (their cloud offering) so we don't have any physical/hardwarebased servers and most of the workstations are Microsoft Surfaces.", "Everyone is replaceable, but only if your numbers don't meet expectations."], ["I recognize most of their services are software, but they also make laptops (and the various devices that relate to that) and Xbox.", "There's a very common phrase here 'do the right thing' and often this means 'do what is right in a personal relationship' not 'do the right thing so we don't get sued' type of thing."], ["Should I get paid less to do the same amount of work I do now because I'm not sitting at the office twiddling my thumbs for 6 hours like I was before?", "For hourly, I'd adjust whatever the hourly rate is currently."], ["Market forces are still caused by a bunch of biased ignorant humans.", "Why do you think companies are not doing a 32hr work week now?"], ["The difference here is that Henry Ford experimented with his own company changing work hours and changing wages to get what he thought was better performance.", "If the working week was lowered to 32 and you therefor got overtime for anything more than that most businesses would simply hire more people rather than raise wages or pay overtime."], ["If the argument is that it's good for the people themselves it's a different argument altogether, not the one OP presented.", "Not saying specifically that a 4 day work week at unchanged salary would work, but the argument that it wouldn't because the companies want to make profit is poor, because they can be forced to adhere by legislation."], ["The entire infrastructure is in Azure (their cloud offering) so we don't have any physical/hardwarebased servers and most of the workstations are Microsoft Surfaces.", "I'm sure there are many different stories but I've always had the impression folks here care about the employees as a general rule."], ["The entire infrastructure is in Azure (their cloud offering) so we don't have any physical/hardwarebased servers and most of the workstations are Microsoft Surfaces.", "I work for Microsoft (for over seven years)."], ["Like it's impossible to be charitable and nice and kind when survival is your primary concern.", "Bill and Melinda are prime examples of this (so long as you don't believe the drooling conspiracy theories)"], ["I've seen folks that would've otherwise been let go be put into other positions because of org changes that weren't a natural fit to give them opportunities instead of losing a job even though they prob weren't the best choice for a position.", "But NO publicly traded company will ever do anything for it's employees that it doesn't feel it will recoup in profit."], ["Literally everything a company ever does can be seen from the perspective of ulterior motives.", "Yespeople are replaceable but this doesn't mean the company doesn't care about them."], ["So if you want to work for 5 days a week, or your employer offers to hire you for 5 days a week, they'd be put in a cage.", "More time put in definitely increases the probability of success and gain."], ["Literally everything a company ever does can be seen from the perspective of ulterior motives.", "It's normal to feel affection for the people who sign your check but at the end of the day, anything they do, they do for profit."], ["I recognize most of their services are software, but they also make laptops (and the various devices that relate to that) and Xbox.", "Everyone is replaceable, but only if your numbers don't meet expectations."], ["Market forces are still caused by a bunch of biased ignorant humans.", "They will actually likely *cut pay* due to the increased costs of a second employee (fringe benefits)."], ["Ultimately for the working class, especially those being paid minimum wage they dont have the money to invest into stocks and create enough of a profit for upward mobility, plus those who end up losing money and are bought out by larger holders who arent affected in a material way by losing percentages of their wealth.", "Company stores were not some massive abuse of workers."], ["If you can't increase hourly productivity, you're essentially removing some of the jobs from the marketeither it can be done cheaper elsewhere or the returns don't justify the costs anymore.", "For hourly, I'd adjust whatever the hourly rate is currently."], ["Literally everything a company ever does can be seen from the perspective of ulterior motives.", "But NO publicly traded company will ever do anything for it's employees that it doesn't feel it will recoup in profit."], ["Otherwise, **All of my overworking would have been unnecessary, and my entire identity as a hard working world killer would be threatened.", "For hourly, I'd adjust whatever the hourly rate is currently."], ["The entire infrastructure is in Azure (their cloud offering) so we don't have any physical/hardwarebased servers and most of the workstations are Microsoft Surfaces.", "), obviously they have AC because of customers, but working in a 115+ building all summer absolutely sucks, especially when part of the dress code is jeans/jean shorts only."], ["To turn a profit the companies will pay as many workers as they can as low of a wage as possible and pocket the rest, meaning that only shareholders and people who have jobs which cannot be automated yet are really able to participate in the market in a meaningful manner.", "Company stores were not some massive abuse of workers."], ["There have already been studies on the 32 hour work weeks in the EU.", "You are claiming that a 32 hour work week will benefit companies with nothing to support your claim."], ["I recognize most of their services are software, but they also make laptops (and the various devices that relate to that) and Xbox.", "Chewy saves face by treating their customers and call center employees very well, they tend to have loyal customers for a reason."], ["Like it's impossible to be charitable and nice and kind when survival is your primary concern.", "I work for Microsoft (for over seven years)."], ["And tbh I also kind of forgot which subreddit I was in, I just started reading comments lol.", "), obviously they have AC because of customers, but working in a 115+ building all summer absolutely sucks, especially when part of the dress code is jeans/jean shorts only."], ["The assembly line is a tool, that greatly increased the outcome.", "Their workflow changes, and the status quo changed, but those things aren't productivity."], ["People generally speaking do have upward mobility throughout their working careers.", "Company stores were not some massive abuse of workers."], ["Otherwise, **All of my overworking would have been unnecessary, and my entire identity as a hard working world killer would be threatened.", "I'm saying it took legislation after years of public and sometimes violent protests to get to a 40 hour week."], ["And those are pretty conservative numbers.", "The idea behind this is productivity should remain the same, and if you're in a salaried position in the type or role this would come into play, an employer wouldn't be able to cut your salary."], ["Something a working class individual simply cannot afford in most circumstances.", "The concept of each predates and was implemented by capitalists before it was signed into labor laws."], ["There have already been studies on the 32 hour work weeks in the EU.", "There is no incentive for them to allow overtime (unless they cannot get enough employees) and no incentive for them to raise wages (otherwise they would already be at those higher rates)."], ["So if you want to work for 5 days a week, or your employer offers to hire you for 5 days a week, they'd be put in a cage.", "That same argument could have been made for the six day work week in Henry Fords time though?"], ["The entire infrastructure is in Azure (their cloud offering) so we don't have any physical/hardwarebased servers and most of the workstations are Microsoft Surfaces.", "I highly doubt they really care about their factory workers if they're so willing to export their labor, and trust me, a company as big as Microsoft could 100% afford to move their factories to the US."], ["Otherwise, **All of my overworking would have been unnecessary, and my entire identity as a hard working world killer would be threatened.", "That same argument could have been made for the six day work week in Henry Fords time though?"], ["Often GDP per hour worked by all employees in a defined area or industry is used as a simple formula.", "Their workflow changes, and the status quo changed, but those things aren't productivity."], ["I'm not anti business but the idea that they care about people or even view people as people is absurd.", "A business will always be primarily concerned with profitability but that doesn't mean they are ONLY concerned with profit or even that they are concerned with maximizing profit without regard for anything else."], ["The entire infrastructure is in Azure (their cloud offering) so we don't have any physical/hardwarebased servers and most of the workstations are Microsoft Surfaces.", "People can raise complaints about sexual harassment just to be told \"we can't do anything.\" Conditions were horrible, the warehouse was filthy, and nothing was ever good enough for management."], ["If you bothered to see what is driving it you would know that it's because some people are getting richer, not that others are getting poorer.", "The concept of each predates and was implemented by capitalists before it was signed into labor laws."], ["I can't say I'm convinced this fits into the category of what this thread is on thoughunsure if that was the intention.", "Delivery/truck drivers and package handlers are the backbone of modern society, yet we're all treated like garbage by both our employers and the general public."], ["[Utah tried it with their state employees in 2008 and decided it didn't work, cancelling it in 2011](https://theconversation.com/whyafourdayworkweekisnotgoodforyourhealth64516).", "For hourly, I'd adjust whatever the hourly rate is currently."], ["Literally everything a company ever does can be seen from the perspective of ulterior motives.", "But through my job I've interacted with many c suite officials and upper management at large publicly traded companies."], ["Can you name a good act that a company could do that cannot simply be dismissed in the same way you dismissed the other examples?", "A lot of CEOs feel strongly about their values and culture."], ["I've had jobs in the past that allowed 4 10 hour days, that was what I did when I had the option.", "For hourly workers a 4 day work week means you get less money."], ["Literally everything a company ever does can be seen from the perspective of ulterior motives.", "You took a stand for them to a stranger on the internet and provided them with free advertising..."], ["Like always there are both well built and shitty houses being built today.", "Their workflow changes, and the status quo changed, but those things aren't productivity."], ["If you bothered to see what is driving it you would know that it's because some people are getting richer, not that others are getting poorer.", "Company stores were not some massive abuse of workers."], ["If people were more productive, they could easily work half the time and still get everything they get done now done still.", "If you feel that is right then you need to start a company, or convince an existing company to change to this format and see if they get better performance from workers."], ["Like it's impossible to be charitable and nice and kind when survival is your primary concern.", "It's normal to feel affection for the people who sign your check but at the end of the day, anything they do, they do for profit."], ["in Scandinavia the employer has to pay for sick leave, mandatory 5 week vacation (with extra vacation sales to boot), huge amounts of parental leave, and so on.", "The other problem you will face is that a business open 5 days wanting a receptionist for those hours will not increase pay for two employees."], ["I can't say I'm convinced this fits into the category of what this thread is on thoughunsure if that was the intention.", "The warehouse side of things for my current job feels like working for a different company."], ["In his case that may be true, but it's quite common for computer programmers to really only be productive maybe 4 hours per day and to just \"look busy\" the other four hours.", "For hourly, I'd adjust whatever the hourly rate is currently."], ["My current job pays *very* well, especially considering I don't have a degree, but it's just ass.", "I work for Microsoft (for over seven years)."], ["Should I get paid less to do the same amount of work I do now because I'm not sitting at the office twiddling my thumbs for 6 hours like I was before?", "Working less hours means doing less work, which means creating less value for the employer."], ["Literally everything a company ever does can be seen from the perspective of ulterior motives.", "They generate less revenue than they would if they sold user data and eased privacy protections."], ["If the argument is that it's good for the people themselves it's a different argument altogether, not the one OP presented.", "The other problem you will face is that a business open 5 days wanting a receptionist for those hours will not increase pay for two employees."], ["Not saying specifically that a 4 day work week at unchanged salary would work, but the argument that it wouldn't because the companies want to make profit is poor, because they can be forced to adhere by legislation.", "The other problem you will face is that a business open 5 days wanting a receptionist for those hours will not increase pay for two employees."], ["So if you want to work for 5 days a week, or your employer offers to hire you for 5 days a week, they'd be put in a cage.", "I'm saying it took legislation after years of public and sometimes violent protests to get to a 40 hour week."], ["I can't say I'm convinced this fits into the category of what this thread is on thoughunsure if that was the intention.", "I work for Microsoft (for over seven years)."], ["Surethere are electronic devices manufactured in China but this is the state of electronics manufacturing worldwide for what is probably the majority of electronics.", "My current job pays *very* well, especially considering I don't have a degree, but it's just ass."], ["Surethere are electronic devices manufactured in China but this is the state of electronics manufacturing worldwide for what is probably the majority of electronics.", "Yespeople are replaceable but this doesn't mean the company doesn't care about them."], ["Literally everything a company ever does can be seen from the perspective of ulterior motives.", "Not trying to com off as hostile but do you not see the profit motive behind everything you mentioned?"], ["There have already been studies on the 32 hour work weeks in the EU.", "If the working week was lowered to 32 and you therefor got overtime for anything more than that most businesses would simply hire more people rather than raise wages or pay overtime."], ["Ultimately for the working class, especially those being paid minimum wage they dont have the money to invest into stocks and create enough of a profit for upward mobility, plus those who end up losing money and are bought out by larger holders who arent affected in a material way by losing percentages of their wealth.", "If a new steel working plant tries to get set up in this day and age, they will probably not make enough to be profitable and will be bought up/driven out of the market by established companies."], ["I recognize most of their services are software, but they also make laptops (and the various devices that relate to that) and Xbox.", "Delivery/truck drivers and package handlers are the backbone of modern society, yet we're all treated like garbage by both our employers and the general public."], ["There are a lot of people like this, and they are often miserable.", "If you feel that is right then you need to start a company, or convince an existing company to change to this format and see if they get better performance from workers."], ["Also the natural tendency for the rate of profit from labour is to fall, as we see with the rapidly falling stocks recently, profit rates haven't recovered since the 50's and we had a monopoly on industrialization.", "This is something that also allows them to run at a higher loss than newer companies."], ["Surethere are electronic devices manufactured in China but this is the state of electronics manufacturing worldwide for what is probably the majority of electronics.", "People can raise complaints about sexual harassment just to be told \"we can't do anything.\" Conditions were horrible, the warehouse was filthy, and nothing was ever good enough for management."], ["u/steamplshel – your comment has been removed for breaking Rule 2:**Don't be rude or hostile to other users.", "Companies, who have a virtual monopoly on a good and produce it for cheap even now can afford to pay high wages."], ["Is that a healthy and productive perspective to reduce people to their primary concern and pretend like it's also their ONLY concern?", "Bill and Melinda are prime examples of this (so long as you don't believe the drooling conspiracy theories)"], ["Otherwise, **All of my overworking would have been unnecessary, and my entire identity as a hard working world killer would be threatened.", "You are claiming that a 32 hour work week will benefit companies with nothing to support your claim."], ["And tbh I also kind of forgot which subreddit I was in, I just started reading comments lol.", "My current job pays *very* well, especially considering I don't have a degree, but it's just ass."], ["Trade schools are great for some people.", "The other problem you will face is that a business open 5 days wanting a receptionist for those hours will not increase pay for two employees."], ["I recognize most of their services are software, but they also make laptops (and the various devices that relate to that) and Xbox.", "I work for Microsoft (for over seven years)."], ["More employees = more benefits and training cost, OT is a much more inexpensive route.", "For hourly, I'd adjust whatever the hourly rate is currently."], ["Literally everything a company ever does can be seen from the perspective of ulterior motives.", "I work for Microsoft (for over seven years)."], ["For example, my work experience was as an RT manager and currently as a programmer.", "Because less productive hours = less value to employer."], ["Right now, as a programmer, working for 6 hours is outright less programming.", "I am talking about salaried roles where productivity doesnt equal hours worked and you are paid a fixed salary each year."], ["And those are pretty conservative numbers.", "Because less productive hours = less value to employer."], ["I've seen folks that would've otherwise been let go be put into other positions because of org changes that weren't a natural fit to give them opportunities instead of losing a job even though they prob weren't the best choice for a position.", "Both of those links are about the salary raise, not the 6 to 5 day work schedule."], ["There have already been studies on the 32 hour work weeks in the EU.", "If you feel that is right then you need to start a company, or convince an existing company to change to this format and see if they get better performance from workers."], ["So if you want to work for 5 days a week, or your employer offers to hire you for 5 days a week, they'd be put in a cage.", "You are claiming that a 32 hour work week will benefit companies with nothing to support your claim."], ["It also doesn't touch upon how many new companies are formed and how giants have fallen over time (ie Sears as just one among many over the course of time).", "Company stores were not some massive abuse of workers."], ["I recognize most of their services are software, but they also make laptops (and the various devices that relate to that) and Xbox.", "My current job pays *very* well, especially considering I don't have a degree, but it's just ass."], ["The entire infrastructure is in Azure (their cloud offering) so we don't have any physical/hardwarebased servers and most of the workstations are Microsoft Surfaces.", "Delivery/truck drivers and package handlers are the backbone of modern society, yet we're all treated like garbage by both our employers and the general public."], ["Otherwise, **All of my overworking would have been unnecessary, and my entire identity as a hard working world killer would be threatened.", "If the working week was lowered to 32 and you therefor got overtime for anything more than that most businesses would simply hire more people rather than raise wages or pay overtime."], ["There have already been studies on the 32 hour work weeks in the EU.", "For hourly workers a 4 day work week means you get less money."], ["And tbh I also kind of forgot which subreddit I was in, I just started reading comments lol.", "I can't say I'm convinced this fits into the category of what this thread is on thoughunsure if that was the intention."], ["A McDonald's worker cleaning up the bathrooms could be more proactive than NASA.", "Their workflow changes, and the status quo changed, but those things aren't productivity."], ["The industries where people are paid by the hour have very thin margins.", "For hourly, I'd adjust whatever the hourly rate is currently."], ["The market effectively closes itself over time via the practice of corporation.", "The concept of each predates and was implemented by capitalists before it was signed into labor laws."], ["Apologies if slightly off topic, but I \"kinda\" work a 4 day week, or at least get 4 days off every 4 working days lol, so wanted to add my opinion :)", "For hourly workers a 4 day work week means you get less money."], ["I'm not anti business but the idea that they care about people or even view people as people is absurd.", "It's normal to feel affection for the people who sign your check but at the end of the day, anything they do, they do for profit."], ["None of this even touches outsourcing which also helps drive up stock prices and allows international corporations to really drive local companies into the ground further, creating basically an aristocratic bourgeois class with little mobility but no legal restrictions against it per se.", "Slavery dates back thousands of years so trying to blame the market for it is just nonsense."], ["People could buy a Chinese phone with 2x the power at 1/3 the cost but they don't because of Apple's privacy policy.", "It's normal to feel affection for the people who sign your check but at the end of the day, anything they do, they do for profit."], ["To turn a profit the companies will pay as many workers as they can as low of a wage as possible and pocket the rest, meaning that only shareholders and people who have jobs which cannot be automated yet are really able to participate in the market in a meaningful manner.", "The concept of each predates and was implemented by capitalists before it was signed into labor laws."], ["None of this even touches outsourcing which also helps drive up stock prices and allows international corporations to really drive local companies into the ground further, creating basically an aristocratic bourgeois class with little mobility but no legal restrictions against it per se.", "The concept of each predates and was implemented by capitalists before it was signed into labor laws."]]}