[{"text": "CMV: It is incredibly stupid and shortsighted for white people to be racist now considering their impending minority status across the West (and decreasing share of the global population)"}, {"text": "White birth rates are BELOW replacement level."}, {"text": "This is true in the US, Germany, France, all across Eastern Europe, etc."}, {"text": "So, the population of white people in the world is shrinking."}, {"text": "On the other hand, every other region in the world, that is a predominantly occupied by a nonwhite race/ethnicity, has positive growth rates."}, {"text": "Africa's population for instance is skyrocketing."}, {"text": "The Middle East's birth rates are generally high (look at how much Iraq's population increased in just the last 20 years for example)."}, {"text": "China and India will continue adding millions more to their populations for years."}, {"text": "Etc."}, {"text": "So the ratio of whites to nonwhites in the world is falling rapidly."}, {"text": "Not only that but because the birth rates of minorities IN the West are above replacement level and because of steady migration from black/brown/yellow countries to the West whites will not only be more outnumbered than ever on a global scale but also in \"their\" own countries like never before."}, {"text": "Is it really wise for whites to be antagonizing racial minorities when they, their children and every generation after them could have to deal with the consequences considering these things"}, {"text": "I don't think that being racist is the result of a logical process."}, {"text": "Even if there was a logical component, it would be a very long time before white people were such an oppressed minority that any racist individual would need to worry about a retaliation for something that happened today."}, {"text": "It's not about what white people decide to do, it's going to be about what non-white people decide to do."}, {"text": "It's incredibly stupid and shortsighted for anyone to be racist."}, {"text": "Majority or minority."}, {"text": "I understand what you're saying but yet, as a minority, white people will still control a disproportionate amount of wealth."}, {"text": "That goes hand in hand with population growth as well, the more advanced & economically affluent a nation or peoples is, the lower their birth rate."}, {"text": "So... Change your view that racism is bad?"}, {"text": "Can't do that."}, {"text": "But white people wont be effected as much as you believe."}, {"text": "Devil's advocate time."}, {"text": "Please don't hate me."}, {"text": "Your argument is that declining birth rates are an incentive against white racism, considering future consequences."}, {"text": "HOWEVER."}, {"text": "Those demographics *within* the Caucasian populations that are most racist - in America, religious and or poor or rural, in Europe the more radicalized or poor Eastern European countries - are also the ones with the highest birth rates."}, {"text": "So, with the caveat that correlation is not causation, it *could* be argued that racism is a necessary survival trait for a population to maintain growth."}, {"text": "Since they are breeding like no one else is."}, {"text": "It *could* also be argued that since 'white' people tend to have recessive traits, and children of mixed couples tend to (though not always) express more of their non white parentage, for 'white' people to have a future at all as an identifiable people they would need to protect and preserve their own, even at the expense of others."}, {"text": "I. E., racism."}, {"text": "And as a double-devil bonus to this argument, it could be argued that since children of mixed couples don't look white, it does not impact them if retaliation occurs."}, {"text": "So the non racists can just marry out and escape the future consequences for their kids."}, {"text": "OK, enough bullshit."}, {"text": "Here is a real reason why your argument is flawed, a reason that does not apologize for racism."}, {"text": "Are you ready?"}, {"text": "White people have *always* been outnumbered, and sometimes ridiculously so."}, {"text": "And racism did not have the results you predict."}, {"text": "South America."}, {"text": "India."}, {"text": "South Africa."}, {"text": "Hong Kong."}, {"text": "All pillars of white supremecy, all where whites were hilariously outnumbered, all places where the (non racist) white descendents are doing fine, though occasionally a bit rocky but overall landing on their feet and usually better than average."}, {"text": "Your logic is invalid."}, {"text": "and the most important reason of all:"}, {"text": ""}, {"text": "FEAR OF CONSEQUENCES IS THE WRONG REASON TO NOT BE RACIST."}, {"text": "RESPECT FOR YOUR SHARED HUMANITY IS THE RIGHT AND OVERWHELMINGLY MOST URGENT REASON TO NOT BE RACIST."}, {"text": "ANY - *ANY* OTHER REASON IS MISSING THE GODDAMNED POINT AND IS RACIST IN AND OF ITSELF."}, {"text": "Satisfied?"}, {"text": "I refute your claims, good sir."}, {"text": "Give me delta now."}, {"text": "Ignoring all of the moral parts of this and etc, numbers don't necessarily mean power."}, {"text": "If you're in control of the money, government, military, and most major businesses, numbers are fairly irrelevant."}, {"text": "I'm not here to argue that racists aren't stupid (spoiler they are) but if you were to believe that whites are superior, then fighting to keep some place white dominant would be a logic defense behaviour."}, {"text": "Their goal is not to fight against the demography but simply to keep bastion of 'white civilisation' and fight against the perceived 'invasion'"}, {"text": ""}, {"text": "(like I said and to be sure of not being misunderstood, it's their initial ideology that is stupid but if we were to forget this, as I think it's your point in this cmv, then I don't really see why it is shortsighted)"}, {"text": "It's not really shortsighted at all (or any 'sighted' even, but that's another point altogether)"}, {"text": ""}, {"text": "Racists even in a world which is non-racist are unlikely to suffer drastically for their actions (it would have to turn into south Africa, which would be pretty hard to accomplish in a western country not just due to population) That and do keep in mind racists act mostly as individuals, not as a group or hub (you'll find like-minded individuals together, but they tend to not brag about their united racism, or make a movement out of it.)"}, {"text": "and in terms of the individual, your actions alone mean nothing compared to the grand scale of things, so why not be yourself?"}, {"text": "Since it doesn't make a difference"}, {"text": ""}, {"text": "Edit: also wanted to add disagreeing opinions only affect you if they're in your social circle."}, {"text": "Generally, if you're a racist, you don't closely interact with races other than your preferred ones because of this."}, {"text": "Racism isnt about the majority vs the minority."}, {"text": "Racism is about thinking your ethnic group is better than another ethnic group."}, {"text": "Being a minority actually helps that in a sense."}, {"text": "Like, if you dont want your kids to marry black people, thats racist."}, {"text": "But if jews try to marry other jews, thats like tradition, because jews are a minority..."}, {"text": "It is incredibly stupid ~~and shortsighted for white people~~ to be racist now considering we've known better for a long, long time"}, {"text": ""}, {"text": "FTFY"}, {"text": "The minority has successfully controlled the majority all through out history."}, {"text": "Arguably the rich do this right now."}, {"text": "Having less children gives more power and money to that child which arguably gives them more power to be racist."}, {"text": "This is not the scientific method we are talking about here."}, {"text": "Racism is an irrational hatred towards other based on race."}, {"text": "Any reasoning behind it typically comes after the fact."}, {"text": "If anything feelings of a significant decrease in the global white population will fuel that hatred further."}, {"text": "Racist people aren't tying to find the most agreeable circumstances in which their hatred makes the most sense."}, {"text": "There are all sorts of examples throughout history of a small minority dominating much of the world."}, {"text": "In the US a small number of people hold the lions share of the wealth."}, {"text": "The 1600s the UK colonized pretty much the whole world dominating."}, {"text": "White people currently have a huge head start over other races."}, {"text": "Efforts to maintain that advantage will not be in vain."}, {"text": "It is an advantaged that has existed since the Renascence."}, {"text": "Actually it seems achieving equality will be harder then maintaining the advantage."}, {"text": "So let's say the balance of power so to speak shifts to the Chinese and Indians (two examples you used)."}, {"text": "This would not be a good thing for any group considered marginalized."}, {"text": "They aren't exactly beacons of acceptance and tolerance."}, {"text": "History has proven people of color have been just as bad to other people of color as whites have."}, {"text": "I would change your view by saying stop looking at statistics to base your opinion and start seeing racism outside the western world view of white and everything else."}, {"text": "Racism knows no bounds, is not inherent to any one race and is stupid and shortsighted no matter who it is coming from."}, {"text": "Racism is a byproduct of tribalism."}, {"text": "Every tribe has their byproducts."}, {"text": "Once every human is all the same skin color, this tribalism and racism that spawns from it will cease to exist."}, {"text": "Is this like how it was shortsighted for WASPS to be racist against Italians and Irish in the US?"}, {"text": "What happened was that demographic shift eventually forced them to integrate with the Italians and Irish and call them fully white."}, {"text": "There was no \"reckoning\"."}, {"text": "Same will happen with white people who are currently not considered fully white such as Middle Easterners and Hispanic people."}, {"text": "They will become fully white."}, {"text": "They will be integrated with the rest of society."}, {"text": "This is already happening with grandchildren and later of Hispanic and Middle Eastern immigrants - most simply identify as \"white\"."}, {"text": "Trying to be a good person because of how it benefits you is completely missing the point."}, {"text": "White people are not the only racist people in the world."}, {"text": "Umm this is a little bit of a uhhh interesting take I guess..it's just that the theory you use to back up your claims is really similar to the whole \"great white replacement theory\" used a lot by nazis to back up racist policy as a means of self-defence.."}, {"text": ""}, {"text": "First of all, I just want state while I don't know you personally, just be wary about how you use that supposed evidence because a lot of the time it's used by the alt-right as a sort of dogwhistle..But that being said this idea of a great white replacement has being debunked many times as a misread of demographic data to fan up right wing fascist talking points."}, {"text": "The first major critique of this theory is that, it's not a replacement."}, {"text": "White people aren't disappearing and nor is their population shrinking just because first-gen immigrants have a higher birth rates than supposed \"local white people\"."}, {"text": "Secondly, it carries a lot of racist undertones to classify non-white people as this monolith who just breed more than white people."}, {"text": "A lot of studies have shown, that by the second and third gen, most immigrants assimilate very well into the local community and often adopt much of the local customs and values, and there's very little evidence to show that there's something inherent about their race/creed that passes down a desire to reproduce any more than white people."}, {"text": "Thirdly, statistics show non-white people still make up quite a small minority of the West's population and it will take many generations of continued birth rates for them to make white people into a minority."}, {"text": ">Is it really wise for whites to be antagonizing racial minorities when they, their children and every generation after them could have to deal with the consequences considering these things"}, {"text": ""}, {"text": "What are you suggesting here?"}, {"text": "That white people will become an oppressed minority?"}, {"text": "That humanity is so bound up in racism and tribalism that we will whip someone for harbouring a particular skin colour, as retribution for the sins of their ancestors?"}, {"text": "I could probably google retaliation against racist white right now and find articles videos that fit the bill."}, {"text": "What makes you think this won't increase considering everything I mentioned"}, {"text": "Just so you know in the future, you'd probably want to use 'affected' in that sentence at the end"}, {"text": "What makes you think minorities won't continue excelling in those areas"}, {"text": "If you say so"}, {"text": "Okay but if you read closely I didn't say \"white people are the only racist people in the world\" I said it's especially dumb for white people to be racist rn considering everything I laid out in this post."}, {"text": "Thanks man haha, I was debating on which one to use."}, {"text": "For some reason that still trips me up!"}, {"text": "I'm sure they will, but it's an up hill battle."}, {"text": "Why would this not happen?"}, {"text": "Race isn't stable."}, {"text": "Why would people who can fit into the higher social classes not do so?"}, {"text": "What makes it more stupid for whites to be racist, as opposed to minority groups being racist?"}, {"text": "I read your post but that distinction isn't clear."}, {"text": "Have you seen many middle eastern people?"}, {"text": "Many are not white."}, {"text": "Same for Hispanics."}, {"text": "Also if white as a social class becomes less powerful and relevant then it won't be a higher social class and people won't want to be seen as one"}, {"text": "Demographic shift"}, {"text": "thats what accelerationists are hoping for, as anti white violence and rhetoric increases they will have a better chance in the long run as more people turn to their side."}, {"text": "So racism isn't inherently dumb, and being a minority racist isn't dumb, but becoming a minority racist is dumb?"}, {"text": "I'm sorry but your line of thought is still lost."}, {"text": "In my opinion holding racist views that you aren't ignorant to puts you in the lowest common denominator of people, other than violent criminals."}, {"text": "and I don't see how there's a very strong distinction between being a minority and becoming a minority."}, {"text": "Sorry?"}, {"text": ">So racism isn't inherently dumb, and being a minority racist isn't dumb"}, {"text": ""}, {"text": "I didn't say it wasn't "}, {"text": ""}, {"text": ">but becoming a minority racist is dumb"}, {"text": ""}, {"text": "I said it's especially dumb all things considered "}, {"text": ""}, {"text": ">In my opinion holding racist views that you aren't ignorant to puts you in the lowest common denominator of people"}, {"text": ""}, {"text": "Good."}, {"text": ">I don't see how there's a very strong distinction between being a minority and becoming a minority."}, {"text": "What's confusing you?"}, {"text": "Basically accelerationism is the hope that things get much worse in order to bring about quicker change."}, {"text": "More anti white violence and rhetoric will be turn more white people to their cause."}, {"text": "From their you just take over, cleanse or create a separate state."}, {"text": "Whites will theoretically have a better chance of continuing to exist if that happens."}, {"text": "CMV: wealth redistribution policy should focus on a flat rate of taxation for a flat amount given for every body"}, {"text": "Having a rule like \"pay 10% of all your revenues to a common fund, this fund will split the pie into as many equal shares as there are people\" would simplify welfare tremendously."}, {"text": "Discussion would solely be focused on the rate itself (should it be 10 or 20%) instead of focalising on who is going to pay (answer before the vote: rich people and corporations, result after the vote: yeah, not those)"}, {"text": ""}, {"text": "Having such simple rule would also remove the the need for state worker which have both a monetary cost and a social cost (it's degrading to have a social worker give you a stipend if you behave)"}, {"text": ""}, {"text": "I feel like welfare systems around the world are you not designed to help poorer people get better, but to keep them in place."}, {"text": "CMV"}, {"text": "This sounds a flat tax UBI, with massive tax cuts for the wealthy and massive tax rises and welfare cuts for the poor."}, {"text": "I don't know how you think that will do anything than to literally keep poor people in their place."}, {"text": "Flat taxes are inherently unfair to the poor."}, {"text": "Rich people can afford to pay substantially more taxes as income rises than the poor."}, {"text": "And since our system is progressive, rich pay the same amount of tax, in theory, as the poor on the lower end of their income."}, {"text": "And as income rises, the cost of living does not, at least not at the same pace."}, {"text": "Therefore the rich can afford to pay substantially more or their income on taxes, even higher than now."}, {"text": "And regardless of what the tax rate is for higher income, it will never be so high as to discourage someone from making more money."}, {"text": "Even a rate of 90% is reasonable on the obscenely high end of the income bracket."}, {"text": "But it wouldnt redistribute wealth."}, {"text": "If you take and give the same amount, it wont change anything, it's just beauracracy."}, {"text": "How about the following:"}, {"text": ""}, {"text": "On the first 1000 euros you earn you don't have to pay any taxes."}, {"text": "On the next 1000 euros you earn (so in the 1000 to 2000 euros range) you have to pay 5% in taxes"}, {"text": ""}, {"text": "On the next 10 000 euros (so 2000 to 12 000 euros range) you pay 10% taxes "}, {"text": ""}, {"text": "And so on (these numbers aren't real, they're just for demonstrative purposes)"}, {"text": ""}, {"text": "&#x200B;"}, {"text": ""}, {"text": "This is fair for everyone, as even the super rich don't pay any taxes on the first 1000 euros that they earn."}, {"text": "Now how you divide up the ranges and how many % in taxes you have to pay per range is up for discussion."}, {"text": "The \"Fair Tax\" is a flat sales tax that gives money to every person every month."}, {"text": "The money is in the amount so that anyone at poverty level or below pays no taxes at all."}, {"text": "You still get the money even if you're not working."}, {"text": "But buy an $18,000 car there's a 23% sales tax."}, {"text": "The rich guy buys his $100,000 car, he pays more tax than your car costs."}, {"text": "In the US we have standard deductions."}, {"text": "A certain amount of income is automatically not taxed so that poor people in the end don't pay much, an effectively lower tax rate."}, {"text": "Everyone gets this, including the rich, but relatively it doesn't save them much."}, {"text": "CMV: \"Traditional families\" is religious propaganda"}, {"text": "The male female nuclear family structure was always the majority BUT not until Christianity and Islam came into power were they considered the only right family structure."}, {"text": "We look to ancient Greece for many of our values but when it comes to sexuality and open expression of emotions we just stop."}, {"text": "How hard it is to search a bit and see the facts that gay, monogamous and other families are not only natural but also not that much inferior, if not at all."}, {"text": "We see it in the whole kingdom of animalia."}, {"text": "And especially in mammals, there are documented cases of adoption, homosexuality and other so called \"sins\" or \"issues\""}, {"text": "\"Traditional Families\" in the form of husband, wife, children etc."}, {"text": "has existed in mainstream Chinese culture for as long as there's *been* Chinese culture."}, {"text": "Notable exceptions exist - imperial harems come to mind - but those are exceptions, not the rule."}, {"text": "China has never had any of the Abrahamic religions flourish, and is currently rabidly athiest; but is more defensive about traditional families than the most rabid right wing evangelism could ever hope to be, including homophobia and gender roles."}, {"text": "There are other examples, but I would say the most populous country on earth breaking your hypothesis should be sufficient."}, {"text": "> The male female nuclear family structure was always the majority BUT not until Christianity and Islam came into power were they considered the only right family structure."}, {"text": "Your question says that traditional families are religious propaganda, but this comments states that traditional families existed before Christianity and Islam?"}, {"text": "How can traditional families be religious propaganda if they predate religion?"}, {"text": "Also, I wouldn't look to the ancient Greeks for sexual advice."}, {"text": "The ancient Greeks worshiped Zeus, who rapped, or tricked into sex, just about every women he could."}, {"text": "Some ancient beliefs should remain in the past."}, {"text": "\"Natural\" seems loose here while homosexuality and the likes may be present in the species and should obviously be accepted does not take away from the fact that you are here to carry out a biological duty to move the genetics forward as all creatures plants and animals, so while it shouldn't be used as an excuse for bigotry the \"traditional family\" makes complete sense from an instinctual point and has existed long before the human invention of religion."}, {"text": "There weren't gay families in ancient Greece, there was gay sex."}, {"text": "Actually, the modern Western family comes from the Greeks and Romans (indoeuropeans)."}, {"text": "Early christians were semites so polygamous."}, {"text": "They took over monogamy from Romans."}, {"text": "St Augustine lived early enough to allow polygamy."}, {"text": "Religions reflect the ideals, traditions, and morals of the people."}, {"text": "If religions have \"traditional\" family structures, it is only because they have propagated the \"traditional\" family structure as the correct."}, {"text": "People are drawn to things they agree with or have a connection to."}, {"text": "If all homophobic people are religious, then perhaps it was because they were drawn to religion because religion shared their own personal views."}, {"text": "China, Incas, Mayas, Japan and India also had similar family structures for centuries if not millenias."}, {"text": "There was no common \"gay\" families in ancient Greece/Rome either."}, {"text": "Gay relations were far more accepted but it doesn't mean gay families as a common structure existed."}, {"text": "&#x200B;"}, {"text": ""}, {"text": "Until the very recent times of abundance, a heterosexual monogamous family structure was indeed the best for survival."}, {"text": "I know many sociologists argue that the polygamy prevalent in some islamic societies leads to the unrest and turmoil that many are experiencing today : if the richer components of society get more wives the poorer end of the spectrum is then left alone : sexual misery drives unrest."}, {"text": "Also not that surprising to see that ISIS' biggest appeal for wannabe jihadis outside of Syria & Irak was the fact that it marketed itself as a huge brothel."}, {"text": "&#x200B;"}, {"text": ""}, {"text": "As for heterosexuality : who's gonna help you work on those rice fields if you can't produce children ?"}, {"text": "&#x200B;"}, {"text": ""}, {"text": "It wasn't about propaganda (aside from the 'natural' argument which is indeed bs) but common sense."}, {"text": "It depends how you are considering the word 'Tradition'."}, {"text": "Tradition is \"the transmission of customs or beliefs from generation to generation\"."}, {"text": "It is hard to argue that a married mother/father relationship with a number of children within one house is not 'traditional'."}, {"text": "If you are arguing that 'Traditional' in this sense means 'correct' then you have a reasonable point, although that's not quite how you phrase it."}, {"text": "If we are simply talking about the literal structure (Man, Woman,  2-3 kids) then it seems irrelevant and can be ignored."}, {"text": "I'm also not sure I would go to the animal kingdom for tips on how life should be lived."}, {"text": "There's lots of things animals do that would be awful for society."}, {"text": "I'm not sure we should look at Duck families and consider that rape (ducks rape other ducks all the time) is a sensible plan."}, {"text": "At a certain point we have to consider what things are 'judged' on."}, {"text": "The happiness of the family members, the raising of the children into healthy, balanced adults and that family unit being a benefit to society as a whole are probably worthy metrics (although not necessarily the only ones, nor most important)."}, {"text": "There is no 'right' and 'wrong' structure, but there are structures that are healthier and less healthy."}, {"text": "Clearly having monogamous, straight parents who happen to shoot up heroin all day is probably a bad thing for the children."}, {"text": "Having gay parents who value and encourage them is good."}, {"text": "Parents who are siblings?"}, {"text": "Probably very bad for the children."}, {"text": "Parents who adopt?"}, {"text": "Giving orphans and other children a family home, which is good."}, {"text": "your view is that they gays in ancient greece were married?"}, {"text": "and/or that they weren't monogamous?"}, {"text": "> gay, monogamous and other families are not only natural but also not that much inferior, if not at all"}, {"text": ""}, {"text": "Wait, inferior in what way?"}, {"text": "Religious stories are developed on evolutionary principals, cultures with better stories do better, sharing their stories more."}, {"text": "So it is not religious propaganda just evolutionary adaptation."}, {"text": "Polygamy wasn't a thing in ancient China?"}, {"text": "Yes i think i constrained this argument to a small area but it's the same with any systematic and institutionalised dogma"}, {"text": "They existed but not in the way that religion presents them, as right to dominate all the other family types"}, {"text": "> does not take away from the fact that you are here to carry out a biological duty to move the genetics forward"}, {"text": ""}, {"text": "Genetics just happens."}, {"text": "Calling it a duty is not justified, as nature is an unthinking process without any purpose or specific goals."}, {"text": "That's a form of anthropomorphism."}, {"text": "Moderm humans don't have the duty to make offsprings."}, {"text": "Natural selection is gone."}, {"text": "Only as a collective do we have the duty to pass some kind of genes to the future, and not as individuals"}, {"text": "Augustine allowed polygamy, are you sure about that?"}, {"text": "Polygamy in the Old Testament was a reason why he oined the Manicheans and avoided converting to Christianity until his 30s."}, {"text": "He forgave the ancient Hebrews for polygamy because it was a custom used for survival."}, {"text": "However, during his day, polygamy was only a tool for lust, which he despised."}, {"text": "There's this thing called adoption."}, {"text": "And i don't even care if some norwegian family adopts a somalian kid."}, {"text": "As long as they raise them based on their values then it's as good as a biological child."}, {"text": "Maybe even better if he has superior genes."}, {"text": "About little kids and rape..i read something on Sparta about that but idk how accurate it is."}, {"text": "I think if we're gonna offer sexual freedom we gotta come up with really good answers for the decision in each and every case."}, {"text": "But at this point there's no real arguments against gay marriage."}, {"text": "Not able to reproduce and also socially oppressed"}, {"text": "It was a thing, in multiple (but not concurrent) forms."}, {"text": "But each form was as rigid in its own way as the nuclear family, and China invented a form of monogamy called 'Maternal Marriage' that predates Jesus by a fair clip."}, {"text": ">it's the same with any systematic and institutionalised dogma"}, {"text": ""}, {"text": "That's moving the goal posts."}, {"text": "And even if this were a fair rebuttal, if Traditional Families predate and indeed are influences of and not influenced by religion, if marriage predates the social 'dogma' that builds up around it, or if that dogma radically changes but the family unit remains, your argument is invalid."}, {"text": "All of these points can be seen in Chinese history."}, {"text": "Edit: by the way, if homophobia is your concern, there's strong evidence that it developed as a reaction to the practice of 'shame stroking' in Northern Europe - where raiding parties would rape, then flog, then sometimes castrate their male victims."}, {"text": "It was, unfortunately, a rather common practice, at least as recorded in the sagas and eddas of the time."}, {"text": "As the theory goes, because of the shame and cruelty involved, homosexuality became associated with shame and disgust."}, {"text": "Christianity may have adopted this attitude from the locals, instead of being its originator."}, {"text": "In other words, don't necessarily blame Jesus, it might have been the Vikings."}, {"text": "Though one of the apostles, without naming names that could get me flamed, was reputed to be very homophobic, so it may just have been an unfortunate confluence."}, {"text": "The Bible went through a few revisions in the Dark Ages that muddy the waters here."}, {"text": "What other family types were there in ancient greece?"}, {"text": "So the duty as a collective doesnt apply as the duty to an individual?"}, {"text": "Ok...."}, {"text": "The Bible has many interpretations ."}, {"text": "I recommend this article https://en.m.wikipedia.org/wiki/Polygamy_in_Christianity."}, {"text": "You can search for Augustine here to see that he only preferred monogamy, there are other early christians thinkers there too"}, {"text": "This is *very* recent on the scale of human societies though."}, {"text": "No one talked about adoption as a social phenomenon until maybe 70 years ago, even today it's much more the exception than the norm."}, {"text": "There are no good arguments against gay marriage no."}, {"text": "I'm not sure you addressed my point about how you are considering 'traditional'."}, {"text": "Inferior is too loaded a word for that - it makes it sound like you're putting a value on people as if they were objects."}, {"text": "I'd even say that this kind of thinking is heavily ingrained in certain religious propaganda - in many cases they specifically refuse to recognize same-sex families as genuine, legitimate families."}, {"text": "Yes because as an individual you can't really judge well."}, {"text": "We bring into this world ugly, unhealthy people or any other characteristics that give you less opportunities."}, {"text": "But as a collective at least we'll bring into this world people that we're not gonna bully later."}, {"text": "it should be because there's more than one child per family in the world"}, {"text": "Subconsciously it is used with the meaning of humans at their natural state."}, {"text": "But as you said, traditional is something relative."}, {"text": "I.e., individuals should not  be allowed to make decisions about their breeding, only collective (state?)"}, {"text": "institutions can be competent and consistent enough to make such decisions."}, {"text": "And the institution of \"traditional family\" is an obstacle in the way of progress, kinda like private property."}, {"text": "It's not the point here."}, {"text": "Our culture is not built on what is 'natural'."}, {"text": "People do not live in a 'natural' state."}, {"text": "We've not done so since the rise of tools and language."}, {"text": "Or to think of it another way, everything we do is natural for us."}, {"text": "In neither are 'traditional' families defined as anything specific."}, {"text": "The arguments we see most are from people talking about raising children and having children."}, {"text": "These of course presuppose that a mother and father are required to raise a child, or that procreation is the ultimate purpose of any relationship."}, {"text": "It's a bit like saying you can only travel in trains."}, {"text": "You can of course travel a great many different ways."}, {"text": "It's the journey and the destination that matters."}, {"text": "How did you jump from that to private property?"}, {"text": "And no I'm not suggesting government intervention."}, {"text": "That would be a slippery slope of eugenics and government domination"}, {"text": "Why not, if the individual can not judge well, why zhe should be allowed to have any power?"}, {"text": "About what the collective decisions do you talk than, if you don't want the state regulations?"}, {"text": "Who should be actors there?"}, {"text": "Communes?"}, {"text": "Do you realize that there would be lots of crazy nazi and extremist communes who would want to make and tutor their own extremist children, without vaccines and so on?"}, {"text": "Communes are no better than individuals without the state's regulation."}, {"text": "Because you can't take away his rights like that."}, {"text": "You need to show them how they are wrong."}, {"text": "It would take a huge government program to sort this thing out and it's gonna be very controversial."}, {"text": "But imagine how better our society would be like if you can just go into a lab and create your perfect child."}, {"text": "Everyone will be beautiful and athletic and we'll have to compete intellectually."}, {"text": "Until then i think healthcare providers should advise the public."}, {"text": "And give better insurance rates if you follow their suggestions."}, {"text": ">And give better insurance rates if you follow their suggestions."}, {"text": "Surely, the economical stimulation is the most effective, people easily give out their rights away with such a stimulation."}, {"text": "So we need an AI-designed social credit rating in the end."}, {"text": "It would make much more sense to rely there on AI rather than on the individuals."}, {"text": "[https://en.wikipedia.org/wiki/Social\\_Credit\\_System](https://en.wikipedia.org/wiki/Social_Credit_System)"}, {"text": ""}, {"text": "And we need an embedded reality with AI advisers to help people think and act better and more beautiful."}, {"text": "But why would we need non-traditional families and relationships at all in the coming future, I do not understand?"}, {"text": "First, people are not ideal partners for each other, straight or not, robots would do the partnership much better in the end."}, {"text": "Second, why do we need humans with their stupid flesh problems at all in the coming future?"}, {"text": "You know almost every country has some form of rating system."}, {"text": "I don't know every detail of how credit works in the US but it's not too far from the nightmare in China."}, {"text": "CMV: I think people saying revenge isn't justice and that jail is justice are no more correct than those that agree"}, {"text": "First, I am not saying that we implement it in court I am simply saying this as a moral view."}, {"text": "I think when we speak of justice, it is subjective much like morality."}, {"text": "So when some people say things like 'rapists should have their balls crushed'."}, {"text": "Hypothetically, assuming we have 100% certainty thanks to something magical or whatever, I don't see it as not justice."}, {"text": "One can claim that isn't justice and another can claim it is."}, {"text": "Neither are right nor wrong."}, {"text": "Justice to one can mean helping the victim, and quite frankly, I know some victims do take satisfaction in pain by their assaulter."}, {"text": "Or, if a robber is forced to pay back in double to the person they stole from."}, {"text": "Or justice can mean simply punishment, disregarding the victim."}, {"text": "We can say that in seeking revenge we are no better than the perpetrator, but I don't see it that way."}, {"text": "just like self defence I think revenge rids you of your demons."}, {"text": "It doesn't work for everyone, but I guess I am speaking from personal experience."}, {"text": "I feel much better when I punched my bully."}, {"text": "Not only did it stop them from bullying me, it made me more at peace."}, {"text": "I fought it out and I moved on."}, {"text": "I feel like victims that don't vent it out can't move on.."}, {"text": "However victim or no victim."}, {"text": "I think justice is subjective and saying 'that isn't justice' is no different than saying 'that is justices'."}, {"text": "/u/donotholdyourbreath (OP) has awarded 1 delta(s) in this post."}, {"text": "All comments that earned deltas (from OP or other users) are listed [here](/r/DeltaLog/comments/e4v0f9/deltas_awarded_in_cmv_i_think_people_saying/), in /r/DeltaLog."}, {"text": "Please note that a change of view doesn't necessarily mean a reversal, or that the conversation has ended."}, {"text": "^[Delta System Explained](https://www.reddit.com/r/changemyview/wiki/deltasystem) ^| ^[Deltaboards](https://www.reddit.com/r/changemyview/wiki/deltaboards)"}, {"text": "> I think justice is subjective "}, {"text": ""}, {"text": "Al-Qaeda thinks that 911 is justice."}, {"text": "Nazi think that Holocaust is justice."}, {"text": "Is there anything that you think is morally wrong?"}, {"text": "I don't think you're wrong as such, but I think the confusion is probably that revenge is normally something only felt by the immediate victims of a crime, whereas justice is the satisfying punishment of said crime felt by everyone in a society, regardless of if they were actually affected by some crime."}, {"text": "Moral subjectivism is a cowardly out."}, {"text": "Like, sure, you can take the position that \"some people can see x as justice and others can see it as an injustice,\" but it's a position of inherent cowardice."}, {"text": "What are you *saying* with that?"}, {"text": "That you refuse to engage?"}, {"text": "I don't understand what your saying.elaborate please?"}, {"text": "I think they are wrong, based on empathy."}, {"text": "But that's my opinion."}, {"text": "do Nazis disgust me."}, {"text": "Yes."}, {"text": "But is there any convincing reason they are wrong?"}, {"text": "Can you tell me any convincing reason why I should care about removing revenge from the legal justice system?"}, {"text": "I am not sure what you mean by cowardly."}, {"text": "You hardly bring anything of substance in my opinion."}, {"text": "Can you elaborate."}, {"text": "again not sure what you mean."}, {"text": "Refuse to engage in what?"}, {"text": "That justice is subjective?"}, {"text": "Moral subjectivity is less cowardly than asserting an axiomatic point with aggression"}, {"text": "When we talk about right or wrong, we usually accept that some kind of axiomatic set of value system."}, {"text": "e.g."}, {"text": "Christianity, UN declaration of human rights, etc."}, {"text": "Most people find it to be convincing enough."}, {"text": "However, if you refuse to accept that some kind of objective and universal axiomatic morality exist, then there is absolutely no reason we should be having conversation about morality."}, {"text": "Sorry."}, {"text": "Let me try to explain a bit more."}, {"text": "A moral subjectivist opinion is one that doesn't grant us anything."}, {"text": "On some higher, hypothetical level, it *might be true*."}, {"text": "There really may be no right answer, and no way to delineate truth or an objective conclusion."}, {"text": "But we don't really live our lives that way."}, {"text": "I would suspect that there is not a single individual who goes about their daily life without believing in *at least* a few principles, and that belief is an assertion of truth."}, {"text": "To say that both sides are equally valid, or all interpretations, might be fine on some hypothetical level, but rejects a reality of how we behave and live."}, {"text": "I would imagine *you* have some perspective on which approach is actually more just, and that that perspective rests in some ethical framework (even if the framework is implicit)."}, {"text": "If you say so."}, {"text": "Key word most though."}, {"text": "It works fine for me for things ,but that doesn't mean it isnt based on majority rule."}, {"text": "The majority are convinced that revenge is bad, but can you convince me why I should care about whether we have revenge in the system or not?"}, {"text": "Yes I would think one is more just."}, {"text": "But that's my opinion."}, {"text": "How do you prove one is better than a other if we value different things?"}, {"text": "I am not trying to talk about morality is subjective, but I believe there is no easy way with justice since people value different things."}, {"text": "> but can you convince me why I should care about whether we have revenge in the system or not?"}, {"text": "I cannot convince you of anything, because I don't even know what you even care about?"}, {"text": "It seems that you don't care about what the majority says."}, {"text": "And it seems that you care about empathy, and feeling, and disgust."}, {"text": "And it seems that you don't care about any existing value system."}, {"text": "So maybe, let's start with: What do you care about?"}, {"text": "What are your values?"}, {"text": "Justice is a branch of ethics and morality."}, {"text": "You can use a mix of empirical data and ethical frameworks, like we do for any sort of political or ideological belief."}, {"text": "How do we assert any view as better?"}, {"text": "Do you truly believe that your moral opinions are *just as true as* others?"}, {"text": "Being honest I don't think I can articulate what I value, but I guess maybe I value making a victim feel better?"}, {"text": "I felt better punching my bully."}, {"text": "I think maybe a victim getting money back from a robber would be a good revenge?"}, {"text": "I think it depends on goals."}, {"text": "if we have the same goal then one is better than the other."}, {"text": "But if we have different goals then neither is better."}, {"text": "if my goal is to please some sadistic d and I lack utter empathy then my morality is true."}, {"text": "Sort of a part of my cmv, do you think you have a convincing reason why we should not have revenge in our legal system?"}, {"text": "Or punishment?"}, {"text": "The current justice system is a compromise that doesn't make everyone feel better / happy enough, but it leave nearly everyone satisfied enough to not bring justice to their own hand."}, {"text": "The trouble with subjective justice, is exactly that, subjective."}, {"text": "Let's say person A rapes person B."}, {"text": "For person B, justice is to have person's A genitals mutilated."}, {"text": "For person A, prison is good enough."}, {"text": "So person B would take justice to its own hand and multilate person A's genitals."}, {"text": "Person B thinks that justice is served, case closed."}, {"text": "However, person A feels that they have been wronged, treated unjustly, harmed beyond what is reasonable."}, {"text": "So person A will bring justice to their own hand, which is according to person A's definition to kill person B."}, {"text": "But then person B will think that this is not just."}, {"text": "And so the cycle of retributive violence continues."}, {"text": "I have a much more practical view of justice."}, {"text": "Justice is whatever that will work to reduce future violence and increase future corporation."}, {"text": "Back to the example, for me justice is to punish person A:"}, {"text": ""}, {"text": "1."}, {"text": "Harsh enough such that Person B (and the kin) is sufficiently satiated (not fully satisfied), that Person B would choose not to take justice to their own hand."}, {"text": "2."}, {"text": "Lenient enough such that Person A (and the kin) don't feel wronged and think a retribution is necessary."}, {"text": "That doesn't make a lot of sense to me."}, {"text": "Let's say that an individual's goal is to maximize harm done to others, and your goal is to minimize harm done to others."}, {"text": "You think that their moral views are just as equal as yours in this case?"}, {"text": "As a sort of simple approach:"}, {"text": ""}, {"text": "No one is made 'better off' by a principle of revenge."}, {"text": "Inflicting harm upon the perpetrator does **nothing** to rectify the damage caused, and only perpetuates a cycle of violence."}, {"text": "Killing a person who committed murder does not bring back the murdered."}, {"text": "Torturing a person who committed rape does not undo the trauma or pain a rape victim undergoes."}, {"text": "Retribution plays little to no part in the restorative process for **either** party."}, {"text": "The victims are not made better off, except for perhaps hedonistic level that we ought not to satisfy anyway."}, {"text": "To pivot to a more empirical perspective, the United States already has a prison system heavily based around retribution and harsh punishments; of the \"developed\" world, their prisons are often the roughest, the most dehumanizing, and the most violent."}, {"text": "Yet the United States has the highest prison population and one of the highest recidivism rates."}, {"text": "If our current retributive system does not:"}, {"text": ""}, {"text": "(1) undo the inflicted harm, (2) promote some sort of restorative process, (3) prevent criminal actions, or (4) prevent recidivism, then what good are they?"}, {"text": "And when we see systems that are built on restorative justice, rather than retributive justice, which have (1) much lower crime rates and (2) much lower recidivism rates, what are we to think?"}, {"text": "If retributive justice is the way to go, why and how are countries finding success in systems built around the opposite (or at least a distinct) notion?"}, {"text": "!delta your points seem well met, however I dont know if the USA has ever had a prison system in which the victim was paid back."}, {"text": "For example, revenge can mean suing which does happen, and I think pay back does victims good"}, {"text": "Confirmed: 1 delta awarded to /u/_samah_ ([2∆](/r/changemyview/wiki/user/_samah_))."}, {"text": "^[Delta System Explained](https://www.reddit.com/r/changemyview/wiki/deltasystem) ^| ^[Deltaboards](https://www.reddit.com/r/changemyview/wiki/deltaboards)"}, {"text": "CMV - The issue of transgender women harms the plight of biologically female women who are unattractive, while transferring even more privilege to attractive biological females."}, {"text": "If I have any doubt that a woman is born female, with female genitals, and kept those female genitals throughout her life, I have to cross her off the list of my potential mates."}, {"text": "Because trannies put so much effort into \"passing\", I can only consider exceptionally attractive and feminine females to be potential partners."}, {"text": "This means that if a girl is \"kind of fugly\", I have to assume that she could be a transgender trying to pass, and I will promptly pass on her."}, {"text": "Any lack of femininity has become a huge red flag."}, {"text": "I used to be willing to compromise to an extent if the girl was kind of funny looking but had a good personality, but with all the trannies running around, the line between fugly females and fugly feminine males is becoming too blurred, and I have to raise my standards for what I consider to be feminine."}, {"text": "This gives fugly females a disadvantage to the pretty ones, who already have more privilege than their fugly counterparts."}, {"text": "Edit: Well, its been fun, but its late at night and I really have to get to sleep."}, {"text": "Also, some of you should have awarded me deltas, but wouldn't."}, {"text": "That's alright."}, {"text": "I didn't think anyone would listen to reason on a website where the lunatics have taken over the insane asylum."}, {"text": "Good night, everyone."}, {"text": "There is also the possibility that these women now have the advantage of not having to deal with someone who uses words like \"fugly\"."}, {"text": "That is an advantage they now have over the prettier ones."}, {"text": ">If I have any doubt that a woman is born female, with female genitals, and kept those female genitals throughout her life, I have to cross her off the list of my potential mates."}, {"text": "Why?"}, {"text": ">Because trannies put so much effort into \"passing\", I can only consider exceptionally attractive and feminine females to be potential partners."}, {"text": "Tranny is a slur, and in any event a transwoman could pass and be exceptionally attractive and feminine - by your own admission, passing transwomen put a lot of effort into looking attractive and feminine and therefore they're more likely than a ciswoman to look particularly feminine."}, {"text": "So your logic doesn't make sense."}, {"text": ">This means that if a girl is \"kind of fugly\", I have to assume that she could be a transgender trying to pass,"}, {"text": ""}, {"text": "Why?"}, {"text": ">Any lack of femininity has become a huge red flag."}, {"text": "Per above, passing transwomen are more likely to have more exaggerated femininity, so despite being a transphobe your logic for detecting then doesn't work."}, {"text": ">This gives fugly females a disadvantage to the pretty ones, who already have more privilege than their fugly counterparts."}, {"text": "Again, your logic leads to the opposite conclusion - in this instance, the ugly women have the privilege - they're less likely to be hit on by a bigoted creep like you."}, {"text": "You have framed this as though it is a privilege to be considered by you as worth dating."}, {"text": "Based on what you have written here, the opposite is true."}, {"text": "It is a privilege to have you remove yourself from one's dating pool, and it would be a privilege to never meet you."}, {"text": "It hasn't harmed the unattractive ones."}, {"text": "It sounds like transgender women have actually helped unattractive women and women in general."}, {"text": "It decreases the odds they end up accidentally dating an asshole who has decided they are funny enough so they'll compromise on the looks even though they think they the woman is \" fugly\"."}, {"text": "The attractive women aren't going to be affected because they already regularly have to deal with assholes and they aren't lacking for options."}, {"text": "The asshole is just going to be single more of the time because they are being more picky while at the same time not suddenly becoming a more appealing option."}, {"text": "The trans women aren't doing anything."}, {"text": "It's the hyper paranoid person who apparently thinks the risk of dating a trans woman who is trying to trick them is so high that they have to make excuses to justify their behavior."}, {"text": "Ironically all of its likely to backfire and actually up the minuscule odds that they'd end up with a trans woman who lied to them."}, {"text": "Hey just treat it the way good white dudes do."}, {"text": "Pass on any swarthy white woman, because she could be a nigger."}, {"text": "/s"}, {"text": ""}, {"text": "Also, maybe not use slurs on a forum where you are supposed to be open minded."}, {"text": "Mmmk?"}, {"text": "As I'm sure you are aware trannie is an offensive pejorative term."}, {"text": "However, I also don't think your reaction makes sense."}, {"text": "First, as a matter of probability it doesn't seem remotely likely to me that you will accidentally date a transgender woman."}, {"text": "Most transgender women will be open about the fact that they are transgender."}, {"text": "Most of the rest will not have had the money and resources to transition."}, {"text": "Most of those who have the resources to transition will be relatively old."}, {"text": "Additionally, we are talking about a tiny percentage of the population to begin with."}, {"text": "The odds of you accidentally dating a deceptive, rich, and young transgender woman are remote even if you date many women."}, {"text": "Second, it is not clear to me why you would go through much effort to avoid this low probability event."}, {"text": "Let's say you accidentally dated a transgender woman for a little while before finding out the truth."}, {"text": "Is it so repulsive to have temporarily found an attempt to mimic the natural female body convincing?"}, {"text": "Is the concern you might kiss a transgender woman or have sex with them?"}, {"text": "Why are any of those things so horrible?"}, {"text": "Are you afraid it will mark you as gay or something?"}, {"text": "I can think of legitimate reasons not to want to date a transgender woman(the inability to have biological children)."}, {"text": "But other than that, the main reason I wouldn't want to date a transgender woman is that I doubt I would physically find her attractive because she might still have male traits I am not attracted to."}, {"text": "If I'm wrong about that and there is a transgender woman I find attractive, I don't see the problem with doing anything with her as long as I continue to find her attractive."}, {"text": "Third, am I really supposed to assume that these unattractive biologically female women would be better off if they got to be with someone who thought they were ugly, but gave them a chance because he was confident they were female."}, {"text": "Poor them and this awful plight of not getting to know you."}, {"text": "Fourth, why do you think unattractive women are more likely to be transgender."}, {"text": "If it has not already, eventually I would expect transgender women who have transitioned to be more physically attractive than biologically female women because they will have spent enough money on surgery to make them look attractive."}, {"text": "If you wanted a reliable sorting method to avoid dating transgender women, you would be better off preferentially dating short women."}, {"text": "Since men are likely to be taller than womem and transition surgery does not usually make a big height difference, shorter than average women are very unlikely to have underwent transition surgery."}, {"text": "This is only true if everyone thinks the same as you."}, {"text": "Correct?"}, {"text": "The most attractive women are not the only ones getting into relationships and getting married."}, {"text": "How do you account for this?"}, {"text": "So, your argument is that less attractive women are worse off because they don't have a chance for a relationship with you specifically, whereas more attractive women are better off because you, specifically, will consider them as a potential partner?"}, {"text": "One man less isn't really statistically significant for them though, is it?"}, {"text": "Are they really that worse off because they don't get to date you?"}, {"text": "Have you considered that you might be the one worse off, because you have lost out on the possibility of a relationship with *many* women who you deem to be unattractive enough to be potentially trans?"}, {"text": "Your entire argument is just about you."}, {"text": "A lot of people do not think that way and would generally prefer that you didn't either."}, {"text": "The way you speak about women is impressively objectifying, and you should perhaps investigate that before trying to police how other people are allowed to look."}, {"text": "I really hope this is satire."}, {"text": "But if it's not:"}, {"text": ""}, {"text": "There are many, many trans women who are conventionally attractive, and you would not know that they are trans."}, {"text": "If you only ruled out people you didn't find attractive, all you'd be doing is ruling out.. people you don't find attractive, which does not include all, or even most, of the trans women who exist."}, {"text": "Because you cannot always tell by looking."}, {"text": "You actual fucking dumbass."}, {"text": "the entire premise of this argument is that sex with you is in general desirable to \"women\", or at least that the lack of a chance of sex with you is a harm."}, {"text": "you arent particularly special, so missing out on fucking you isnt missing out"}, {"text": "1."}, {"text": "\"Tranny\" is a slur."}, {"text": "Please refer to people as 'transgender people' or 'trans people'."}, {"text": "2."}, {"text": "Not everyone who is attracted to women is unwilling to sleep with trans women."}, {"text": "While you may not want to sleep with trans women, that's your personal preference, not the rule."}, {"text": "3."}, {"text": "Your view that trans women are \"feminine males\" is transphobic."}, {"text": "Your description of unattractive women as \"fugly\" is demeaning and sexist."}, {"text": "I can only conclude that the women you're no longer deigning to sleep with are dodging a bullet."}, {"text": "You have no idea the power of plastic surgery these days."}, {"text": "A man with money will definitely be able to become exceptionally attractive and feminine females."}, {"text": "So much so, that if you meet exceptionally attractive and feminine females, you should be wary."}, {"text": "And if someone has money, why would they ever choose be an ugly female."}, {"text": "I feel sorry for any woman who falls into your 'can date' pile"}, {"text": "**Note:** Your thread has **not** been removed."}, {"text": "Your post's topic seems to be fairly common on this subreddit."}, {"text": "Similar posts can be found through our [DeltaLog search](https://www.reddit.com/r/DeltaLog/search?q=transgender+%7C+gender+%7C+transphobia+%7C+trans&restrict_sr=on&sort=relevance&t=all) or via the [CMV search function](http://www.reddit.com/r/changemyview/search?q=trans&amp;amp;restrict_sr=on&amp;amp;sort=relevance&amp;amp;t=all)."}, {"text": "Regards, the mods of /r/changemyview."}, {"text": "*I am a bot, and this action was performed automatically."}, {"text": "Please [contact the moderators of this subreddit](/message/compose/?to=/r/changemyview) if you have any questions or concerns."}, {"text": "*"}, {"text": "They can keep it."}, {"text": "Imagine trying to rule out trans women by ruling out people you find unattractive, only to be left with a pool of women with a higher concentration of trans women than the general population has."}, {"text": "> If I have any doubt that a woman is born female, with female genitals, and kept those female genitals throughout her life, I have to cross her off the list of my potential mates."}, {"text": "> Why?"}, {"text": "Why are you trying to force me to have sexual relations with a person that does not have my consent?"}, {"text": "> This means that if a girl is \"kind of fugly\", I have to assume that she could be a transgender trying to pass,"}, {"text": ""}, {"text": "> Why?"}, {"text": "Because even \"passing\" trannies have too much in common with fugly females."}, {"text": "Consent to engage in sexual relations with me is mine alone to give, and I only give it to biological females."}, {"text": "As far as I'm concerned, if a person tries to decieve me about their genitalia and tries to initiate sexual relations, it is sexual assault."}, {"text": "> Again, your logic leads to the opposite conclusion - in this instance, the ugly women have the privilege - they're less likely to be hit on by a bigoted creep like you."}, {"text": "Trannies try to deceive people into having sex with them, and yet you would try to claim that I am a creep."}, {"text": "I honestly don't care if you have a problem with my worldview."}, {"text": "I'm not the only male that prefers to avoid sex with penis people."}, {"text": "There have been too many cases of trannies going to bars and clubs, where it is dimly lit and their victims are under the influence of alcohol, and then initiating sexual relations with people who would have never consented if they had known the truth."}, {"text": "People laugh it off all the time, but it is sexual assault."}, {"text": "I don't have to let liberals define what is and isn't a slur."}, {"text": "Tranny tranny tranny"}, {"text": "1."}, {"text": "Liberals think they can just invent new slurs."}, {"text": "tranny tranny tranny"}, {"text": ""}, {"text": "2."}, {"text": "Everyone has heard horror stories of dancing with someone at a club or even taking a girl home, only to find out she was lying about her identity and has a penis."}, {"text": "That is sexual assault."}, {"text": "3."}, {"text": "If you think a large number of trannies could even come close to an attractive female, you haven't been to reality yet."}, {"text": "They might sell a lot of Chevys, but everyone would rather be driving a Porsche at the end of the day."}, {"text": "So, what you are saying is that I would be better off if I had sex with ugly women?"}, {"text": "Like it or not, whether or not I consent to sexual relations with a person IS about me."}, {"text": "No, there isn't."}, {"text": "They seem to enjoy it."}, {"text": "1."}, {"text": "You aren't my real dad."}, {"text": "2."}, {"text": "I don't care about what weirdos will stick their penis into."}, {"text": "3. https://en.wikipedia.org/wiki/Uncanny_valley"}, {"text": "lol, no."}, {"text": "I've met trannies in real life."}, {"text": "Thank goddess I now have a way to ward off awful men."}, {"text": "I can just try to look as masculine as possible."}, {"text": "If you do agree they now have an advantage, that is a partial view change and you should award a delta."}, {"text": "Right?"}, {"text": "I guarantee if the OP was presented with a list of 100 women containing 10 passing transwomen he'd never get it right."}, {"text": "No one wants you to have sex with trans women."}, {"text": "They're not asking you why you won't have sex with trans women."}, {"text": "They're asking you why you think it is true that someone you don't find attractive might be trans."}, {"text": "Trans women aren't trying to trick you."}, {"text": "Trans people passing isn't about tricking anyone."}, {"text": "It's about that individual's own needs regarding their own body."}, {"text": "People don't transition for you; they do it for themselves."}, {"text": "Seriously."}, {"text": "No trans person wants to fuck you, so you can go ahead and calm down about that."}, {"text": "Noone's forcing you to have to have sex with someone you don't want to, this is weak level concern trolling."}, {"text": "I am asking why you are trying to categorically rule a class of women out rather than making a consent decision on a case by case basis."}, {"text": "As you have just indicated, the reason is because you're a bigot (Accordingly, I have already reported this post for soapboxing, since you're clearly just here to spew bile against trans people and not seeking your view to be changed)."}, {"text": "Transwomen are also not deceiving you, they may present themselves to you as a sexual candidate and you are free to consent or not to the individual person."}, {"text": "There is no deception - you either decide you would like to have sex or not at the time."}, {"text": "Couldn't you just ask, rather than assume, if this is a deal breaker for you?"}, {"text": "Most people have at least a little conversation before hopping into bed, and if this is important to you it seems reasonable to discuss it up front."}, {"text": "If the answer isn't to your liking, you can decline to take the relationship any further."}, {"text": "Most people reject some potential partners early on, for any number of reasons."}, {"text": "Why is this different for you than other reasons you might use to decline going further with someone?"}, {"text": "The point is that by removing yourself from the dating pool of so many women, you are doing them a huge favour."}, {"text": "Well someone who is paranoid about that would be far smarter to just quit sleeping with random women."}, {"text": "If they were smart they'd also know it's the attractive and feminine ones they should be more worried about being 1 of those."}, {"text": "It doesn't even make sense to worry about that when the number of trans people is far lower then the number of people with an std."}, {"text": "The difference is so large that any reasonable person wouldn't even consider the risk of a trans person lying to them to be worth considering in comparison to the risk of a woman lying about std, being on the pill, tampering with protection or any number of things."}, {"text": "Trans women aren't inherently more likely to trick someone just to have sex then the rest of the population and they are a tiny percentage of the population."}, {"text": "The more I think about the more I realize the benefits passing trans women have for society overall."}, {"text": "Their mere existence is apparently capable of reducing the odds of people who lack critical thinking skills from reproducing (on purpose or by accident)."}, {"text": "Uh."}, {"text": "\"Liberals\" don't determine what is and isn't a slur."}, {"text": "You wouldn't be using it if you didn't think it was a slur."}, {"text": "You're using a slur intentionally to serve a function."}, {"text": "You seem to think it's fine to use slurs, and that's an argument that can be made, but that's a different kind of argument than \"a slur isn't a slur just bc people say it's a slur\""}, {"text": "1) Clearly you are not arguing in good faith."}, {"text": "Tranny didn't just become a slur."}, {"text": "2) Maybe story telling is not an accurate method of gauging the likelihood of events."}, {"text": "Do you think there is a chance that such encounters are more likely to be repeated or even fabricated than other stories?"}, {"text": "3) I think I can usually tell when a transgender person has transitioned."}, {"text": "However, of those who I can't tell have transitioned, I have no reason to think they are more likely to be ugly than attractive."}, {"text": "The surgeons are trying to mimic the appearance of an attractive woman."}, {"text": "It makes sense that when the surgeries get good enough that I can't tell the person is not naturally a woman, they will also succeed in making said woman look attractive."}, {"text": "I can't help but notice you didn't respond to my point that it does not necessarily harm the plight of some biological women not to have deal with men who think they are ugly, but would have tried to have sex with them because they were confident they were female."}, {"text": "You also didn't respond to my point that you could still interact with all the short ugly women you wanted without any significant fear of them being transgender."}, {"text": "I think it would be best if you ceased from literally analogizing women into objects."}, {"text": "That has nothing to do with what I said."}, {"text": "Your view is made as a general state of affairs, and yet you only focused on your own experience."}, {"text": "idk if you're trolling or if you're actually this dense."}, {"text": "Why are you posting in CMV if you don't even know how to make an argument."}, {"text": "Just repeatedly making the same unsupported claim isn't an argument."}, {"text": "There isn't what?"}, {"text": "There aren't trans people who are conventionally attractive?"}, {"text": "... that is demonstrably false, given that there are many trans women who pass as conventionally attractive cis women."}, {"text": "And you keep saying you're worried about being deceived..."}, {"text": "If you're feeling deceived because you keep finding women you want to fuck and then realizing they're trans..."}, {"text": "It sounds like you're attracted to trans women."}, {"text": "No they dont?"}, {"text": "If you mean specific women who want to have sex with you, you would be correct, but the CMV is about cisgender women, not about the subset of cisgender women who want to fuck you."}, {"text": "You made a claim about a set, but that claim only applies to a subset of that set."}, {"text": "Unless you have some reason to believe that every women wants to fuck you?"}, {"text": "That will do it."}, {"text": "That is absolutely false."}, {"text": "I've seen their forums."}, {"text": "They fetishize sex with heterosexual males."}, {"text": "They go through great lengths to decieve, or as they call it, \"to pass\"."}, {"text": "I guess I could ask them if they actually have a penis, but I find that my penis is more likely to come to her attention if avoid those sort of questions."}, {"text": "> so many women"}, {"text": ""}, {"text": "How many women do you consider fugly?"}, {"text": "Tranny isn't a slur."}, {"text": "It is a contraction."}, {"text": "I wholeheartedly encourage you to google up photos of genitals after having \"reassignment\" surgery and report back to me about how attractive you found them."}, {"text": "And I don't have time to read rambling tranny manifestos."}, {"text": "Condense your arguments into concise bullet points, otherwise I have too many other people to respond to"}, {"text": "1."}, {"text": "Tranny is a contraction, not a slur."}, {"text": "2."}, {"text": "From what I have observed of homosexual behavior, abberation is the norm."}, {"text": "3."}, {"text": "There are some 4,000 biological differences between a man and a woman."}, {"text": "Doctors could never change one to the other, no matter how good of a surgeon they are."}, {"text": "Do you imagine that I'm the only male that prefers to avoid sex with penis people?"}, {"text": "I've discussed this with other males."}, {"text": "Real, genuine and authentic vaginas are *extremely* popular."}, {"text": "1."}, {"text": "Have you ever seen a tranny in real life?"}, {"text": "It isn't like on the internet."}, {"text": "2."}, {"text": "Trannies intentionally prey upon alcohol-impaired males in dimly lit clubs and bars."}, {"text": "You got me."}, {"text": "I'm actually THE John McAffee."}, {"text": "Proof:"}, {"text": ""}, {"text": "https://twitter.com/officialmcafee/status/1191748259527696386"}, {"text": "[removed]"}, {"text": "So when a ciswomen makes herself look more attractive or feminine, they're also deceiving you because they're making themselves more attractive than they really are?"}, {"text": "Oh, so it's okay for YOU to deceive women (by hiding the fact that you're a disgusting bigot) to make sex more likely, but it's not okay for them to do it?"}, {"text": "So, you feel that if you ask, it would not only weed out potential partners who are trans, but would also result in some  of your non-trans potential partners deciding that you asking this question is a deal breaker for them?"}, {"text": "Here's the thing - you feel that it is reasonable to not want to date trans women, right?"}, {"text": "Why, then, would you want to date someone who feels so strongly that your preference is wrong?"}, {"text": "Aren't you then guilty of hiding something that may be a deal breaker for your partner?"}, {"text": "Isn't that deceptive, in much the same way you are worried trans women might decide to deceive you, by hiding their trans status from you?"}, {"text": "Why is it ok for you to deceive a potential partner but not vice versa?"}, {"text": "Completely missing the point..."}, {"text": "I don't think you know what a contraction is."}, {"text": "[deleted]"}, {"text": ">I wholeheartedly encourage you to google up photos of genitals after having \"reassignment\" surgery and report back to me about how attractive you found them."}, {"text": "Are these the same people you are afraid that you can't tell transitioned or different people?"}, {"text": "Your bigoted transphobic mind seems to be contradicting itself again."}, {"text": ">And I don't have time to read rambling tranny manifestos."}, {"text": "Yeah, you clearly don't have any time on your hands."}, {"text": "In fact you are so busy that you normally spend your time trying to have sex with women you think are ugly and now are spending it insulting transgender people."}, {"text": ">1."}, {"text": "Tranny is a contraction, not a slur."}, {"text": "Of course, it is obviously impossible for a contraction to be a slur."}, {"text": ">2."}, {"text": "From what I have observed of homosexual behavior, aberration is the norm."}, {"text": "Sounds like some more bigotry."}, {"text": "We weren't talking about homo-sexual behavior."}, {"text": ">3."}, {"text": "There are some 4,000 biological differences between a man and a woman."}, {"text": "Doctors could never change one to the other, no matter how good of a surgeon they are."}, {"text": "I didn't say they could."}, {"text": "You still refuse to answer..."}, {"text": ""}, {"text": "1."}, {"text": "Why do you think that losing the chance to interact with a vile bigot who thinks they are ugly is bad for the women who you avoid?"}, {"text": "2."}, {"text": "Why can't you use the more reliable system of only pursuing short girls if you are so concerned you might find yourself getting intimate with a transgender woman?"}, {"text": "Why are you unnecessarily robbing short ugly women of the glory of your presence?"}, {"text": "That was not my issue with your initial statement."}, {"text": "I was referring to the way you \"assess\" women, the way you refer to trans women by a slur, and how you think that hurts \"fugly women\" when I have never once heard any woman state this as an issue they face."}, {"text": "Never have I ever rolled my eyes so far back into my head as I just did now."}, {"text": "Is that an attempt to argue that every woman wants to fuck you?"}, {"text": "If so, that is actually evidence of the opposite, as women who haven't heard of you clearly don't want to fuck you, and there is at least one women of that category according to the tweet."}, {"text": "It doesn't really seem like a genuine defense, if you could focus on what I actually pointed out, that would be appreciated."}, {"text": "I mean, meth posting would make a lot of sense, and fit with McCaffee and his narcotics history."}, {"text": "Sorry, u/bbclitdick – your comment has been automatically removed as a clear violation of Rule 5: "}, {"text": ""}, {"text": "> **Comments must contribute meaningfully to the conversation**."}, {"text": "Comments that are only jokes or \"written upvotes\" will be removed."}, {"text": "Humor and affirmations of agreement can be contained within more substantial comments."}, {"text": "[See the wiki page for more information](http://www.reddit.com/r/changemyview/wiki/rules#wiki_rule_5)."}, {"text": "*I am a bot, and this action was performed automatically."}, {"text": "Please [contact the moderators of this subreddit](/message/compose/?to=/r/changemyview) if you have any questions or concerns."}, {"text": "*"}, {"text": "When a WOMAN makes herself look more attractive or feminine, they are enhancing something that already exists, not attempting to artificially synthesize it."}, {"text": "Being a normal person that only considers having sex with other normal people doesn't make you a bigot."}, {"text": "It makes you normal."}, {"text": "Actually, I don't date liberal women."}, {"text": "They aren't marriage material."}, {"text": "Slurs and contractions aren't mutually exclusive anyway."}, {"text": "Contractions don't have to contract two words."}, {"text": "The absolute state of public education"}, {"text": "Come on."}, {"text": "Put your money where your mouth is and google what they *actually* look like."}, {"text": "1."}, {"text": "Every potential mate *should* be assessed."}, {"text": "Sexual relations should not be indiscriminate."}, {"text": "2."}, {"text": "They are not women."}, {"text": "3."}, {"text": "Fugly women probably haven't realized how the presence of feminine males affects their relative desirability, because they aren't as tuned in to feminine signals as males are."}, {"text": "There are times that I can identify a female just from a distant shadow, or by seeing a portion of an elbow or jawline, or the sound of how they walk or cough, really subtle female signals."}, {"text": "Then mal-adapted males try to imitate them and it gets all uncanny valley and I have to cut down the signal-to-noise ratio."}, {"text": "In the end, the stronger, clearer signals are going to win out."}, {"text": "I'm not the only male that prefers to avoid sex with penis people."}, {"text": "The number of transgender individuals in the population is 0.6% and split roughly along equal genders."}, {"text": "Of that 0.6%, only 1/3 have surgically transitioned, a number that appears to be lower for transwomen than trans men."}, {"text": "So 0.2% of the population, if we are being generous."}, {"text": "Of those, We'll be generous to your no doubt keen eyes and gaydar, and assume that you spot a bare majority of those attempting to pass."}, {"text": "So what you're worried about is the 1/1000 chance that a woman you hit on turns out to be a transgender individual."}, {"text": "And then what?"}, {"text": "I know plenty of trans individuals who sure as hell don't want to deceive anyone, and thus who would be fairly open when dealing with a potential sexual partner, particularly to avoid the sort of response they might get with someone like you."}, {"text": "And on top of all of that, transgender communities and individuals tend to be somewhat insular."}, {"text": "Considering your behavior and reactions in this topic, I'm guessing you aren't the sort of person who ends up hanging around transwomen."}, {"text": "If you're so scared of a transgender individual that you pass up on living your daily life due to what, the 1/1000 chance you might accidentally hit on a trans woman by mistake... that is pretty much the definition of a phobia."}, {"text": "Fun fact for you, since I am certain you are ignorant on the subject."}, {"text": "If you actually got down and dirty with a fully transitioned transwoman, you'd be more likely to notice her breasts are fake than you would be to notice something wrong down there."}, {"text": "Transition surgery is actually really good."}, {"text": "That's not the bit you're hiding though, bigot."}, {"text": "Then asking whether the potential partner is trans before taking the relationship too far would help you by weeding out *both* trans women *and* liberal women, right?"}, {"text": "Seems to me it would be the best approach for you."}, {"text": "Do you agree?"}, {"text": "If not, why not?"}, {"text": "What am I missing?"}, {"text": "Man that pool is shrinking by the minute."}, {"text": "What about women of color?"}, {"text": "Or feminists?"}, {"text": "I have a bit of a hunch on this one."}, {"text": "I mean, sure."}, {"text": "But I don't think this slur is a contraction."}, {"text": "An abbreviation, maybe, but not a contraction."}, {"text": "This from a guy who writes \"decieve\"."}, {"text": "Looking at pictures of transgender people's genitals online really is some sort of weird obsession for you isn't it?"}, {"text": "I wonder if you are so obsessed because the pictures turn you on or because you are fantasizing about a transformation of your own."}, {"text": "That's all I got, man."}, {"text": "I really don't have the emotional energy to keep engaging I'd you're going to keep using these sorts of slurs and insults."}, {"text": "Is there any chance you'd be willing to tone that down?"}, {"text": "Are you changing the view posted above?"}, {"text": "You presented the only loss to women as \"I have to raise my standards for what I consider to be feminine.\"."}, {"text": "Are you now changing your claim to something different?"}, {"text": "> Transition surgery is actually really good."}, {"text": "I've seen photos."}, {"text": "It was absolutely horrifying."}, {"text": "Of all the disgusting things that I've ever seen (and I've seen some pretty messed up, macabre stuff in my 20+ years on the internet) photos of \"transitioned\" genitalia were by far the most disgusting, revolting and horrifying images that I've ever seen."}, {"text": "Not a bigot."}, {"text": "Normal."}, {"text": "It would also weed out fugly conservative women with amazing personalities."}, {"text": "I try to give ugly chicks the benefit of a doubt."}, {"text": "Asians are hot."}, {"text": "Third-wave feminists are not, as a rule."}, {"text": "I went to public school as well."}, {"text": "[removed]"}, {"text": "After all the times that liberals have called me everything from a Nazi to an incel, I don't really see any reason to."}, {"text": "Most of the people that complain about \"slurs\" are just a bunch of hypocrites."}, {"text": "I'm sorry, but its late at night and I really doubt that I can help you improve your reading comprehension in one session."}, {"text": "I'm not sure which part of this is more amusing:"}, {"text": ""}, {"text": "A) An obvious transphobe decided to google images of transitioned women... no doubt for research purposes."}, {"text": "or"}, {"text": ""}, {"text": "B) You are squigged out by a vagina."}, {"text": "Because seriously dude, yes, I'm sure it looks gross if you look at surgical photos, because surgical photos look gross."}, {"text": "But the actual results of MTF SRS are damn near indistinguishable."}, {"text": "I'm sorry you are horrified by other people getting to be themselves."}, {"text": "Bigot (Noun) **:** a person who is obstinately or intolerantly devoted to his or her own opinions and prejudices"}, {"text": ""}, {"text": "*especially* **:** one who regards or treats the members of a group (such as a racial or ethnic group) with hatred and intolerance "}, {"text": ""}, {"text": "We get it, you hate transwomen."}, {"text": "I have no intention of looking up pictures of anyone's genitals."}, {"text": "If you enjoy looking at them(whatever your true motivation) feel free."}, {"text": "I haven't called you either of those things."}, {"text": "What if we both agree not to use terms like those?"}, {"text": "you made a specific claim."}, {"text": "You claimed that unattractive cis women were harmed by trans women because **you** have to raise your standards."}, {"text": "If you believe I am misrepresenting your argument, then please point out where."}, {"text": "No where in your post was the claim that **you** are a standin for \"the class of men who do not want to have sex with \"penis people\", as you now imply."}, {"text": "I want to verify that that is what your belief actually is, before I point out it suffers from the same flaw in its logic."}, {"text": "(i.e."}, {"text": "there is no reason to believe that the class of cis women who want to have sex with a member of the class of men who do not want to have sex with trans women is identical to the class of cis women)."}, {"text": "If you did not intend to present yourself as a standin for the class of men who do not want to have sex with trans women, I would appreciate some clarity, instead of snide comments."}, {"text": "A) Transphobia doesn't exist."}, {"text": "The uncanny valley does"}, {"text": ""}, {"text": "B) Google up what they actually look like and come back here and tell me that was a vagina."}, {"text": "But they hate me too, so it all cancels out."}, {"text": "Then give me deltas."}, {"text": "I don't believe the real issue is about whether or not a specific term is offensive."}, {"text": "The real issue is that liberals try to hijack the dialogue and hypocritically apply their supposed ideals only when it fits their agenda."}, {"text": "I refuse to play along."}, {"text": "CMV: Social media has ruined romance."}, {"text": "Romance is defined as a feeling of excitement and mystery associated with love."}, {"text": "However, with social media playing an increasingly greater role in our lives, it has changed the course of relationships and romance forever."}, {"text": "Social media depersonalizes relationships and sets unrealistic standards for romance."}, {"text": "There is no doubt in my mind that social media has changed the way humans communicate, not just in regards to relationships, but in general."}, {"text": "However, people are using media more and more coming to an average of 2 hours and 35 minutes per day."}, {"text": "Yes, social media has increased communication by making connections instantaneous, however, this instantaneity comes at a cost: poorer communication skills."}, {"text": "Nothing beats in-person communication: feeling the presence of your significant other near you, looking them in their eyes, and seeing their real-time reactions."}, {"text": "Social media has a great capacity for miscommunication and misunderstanding."}, {"text": "A text or status update can easily \"get lost in translation\" of the Internet."}, {"text": "When you put a message on a screen, you lose the contextual clues of facial expressions, voice inflection, and body language."}, {"text": "Social media also raises the bar for what we consider to be romantic."}, {"text": "On Instagram alone, you'll find over 14 million posts tagged with #CoupleGoals ranging from magical dates, to adventures in foreign countries (#baecations), or video edits of someone's significant other."}, {"text": "This media shoves this perfect image of couples in your face, and it innately plants a seed of insecurity within you."}, {"text": "Your relationship needs to be just as extravagant as another's, you need to be your bae's #WCW every day, and you have to share every moment of your perfect relationship online."}, {"text": "Instead of working on the realities of a relationship, people work on how their relationship looks to the outside world."}, {"text": "But at the end of the day, you can't appreciate what you have when you're constantly chasing what appears to be."}, {"text": "The Internet and social media have brought so much to our world, and it's changed the dynamic of social interactions forever, but at what cost?"}, {"text": "Relationships are harder now because conversations became texting, arguments became phone calls, and feelings became status updates."}, {"text": "It's all aimed at selling you something, nothing new."}, {"text": "Before social media saturation - and still, many take their idea of romance from TV/Film which is just as stupid and unrealistic."}, {"text": "At least online versions are real people albeit exaggerations that are not nearly as happy as they appear."}, {"text": "1) Your definition is whack."}, {"text": "\"Romance is defined as a feeling of excitement and mystery associated with love.\""}, {"text": "i see that it's the base google search dictionary definition, but you can see it is just a terrible definition."}, {"text": "Romance is a process, not a feeling."}, {"text": "it's a process of non-creepy seduction that is centered around mutual respect and desire."}, {"text": "for example, you can be excited/mysterious regarding something associated with love that is not romantic."}, {"text": "also, one event is not romance, it's part of a process of seduction."}, {"text": "2) Social media helps romance, by making it much much easier to meet people."}, {"text": "so if you're measuring romance by the total amount of romance out there, there's far more romance now than ever."}, {"text": "and it's hard to say that it's been ruined by some instaposts about fancy dinners."}, {"text": "3) I think you're mostly saying that you feel inadequate because of all the boss romantic social media posts."}, {"text": "and if that's the case, you're ruining romance for yourself, because you dont need to fly to Bali to be romantic."}, {"text": "you just need to be you and show someone you care by listening and doing things they like."}, {"text": "I'm interested to hear how you will feel about I present my own past experience."}, {"text": "When my ex and I were dating it never once got in the way and since we actually live a decent way apart it gave us both a way to communicate (I couldn't always pay my phone bill at the time) and things to discuss when we were bored."}, {"text": "Overall it didn't dilute or warp any of our perceptions of the relationship because we maintained honest and open communication when we could with each other."}, {"text": "I think the status of relationships are more based on the individuals who in said relationship."}, {"text": "The whole miscommunication thing is simply solved by being in a relationship that allows for an open dialogue and where you aren't put down for asking for clarification."}, {"text": "Given that definition yeah."}, {"text": "Change your perspective change your reality."}, {"text": "Romance can have a different definition then your whole post is bunk."}, {"text": "I don't think that social media is the main culprit for this."}, {"text": "It is just a tool."}, {"text": "I agree with the notion that social media provides false standards, but so does TV, movies, music, advertisements."}, {"text": "Movies often end with couples living happily ever after or the ending is considered sad if you don't find a soul mate."}, {"text": "Romance is put almost everywhere."}, {"text": "I rarely listen to mainstream music, but from what I hear in malls and shops is that songs about love are happy if all is good, but sad if you are having issues."}, {"text": "I don't know any couple that hasn't had any rough patches, that is a normal part about being in a relationship, but I think that all the influences (again social media/movies/TV/music/ads) are often saying that everything should be perfect... false standards."}, {"text": "Also, actors in mainstream movies are often portrayed as very good looking and smart, in ads everyone usually is beautiful with perfect bodies, so people want to compete with that, and social media is an easy tool with which you can adhere to these false standards."}, {"text": "Might even be more accurate to say that smart phones are the reason for ruining romance, because they allow people to consume media for longer periods."}, {"text": ">Yes, social media has increased communication by making connections instantaneous, however, this instantaneity comes at a cost: poorer communication skills."}, {"text": "Does it though?"}, {"text": "For what reason is informal writing inherently worse than informal speech?"}, {"text": "Why does the whole corpus of romantic letter writing not matter just because messaging can happen faster now?"}, {"text": "Social media has mostly allowed for an increase in informal writing and not some huge break with what went before."}, {"text": "Social interactions have been happening on the internet for decades now and they have forged strong relationships and friendships."}, {"text": "The idea that social interaction is imposible or harmed by informal writing is not supported by the history of the internet and the development of social interactions."}, {"text": "Most social media is a too used to communicate between people who already know each other in meatspace and some have forged relationships purely through the internet (especially in its earlier days) "}, {"text": ""}, {"text": ">you lose the contextual clues of facial expressions, voice inflection, and body language."}, {"text": "but you gain a whole bunch of textual clues instead"}, {"text": ""}, {"text": "such as punctuation (e.g ?"}, {"text": "means rising tone and ."}, {"text": "means falling tone) and capitalisation (THIS IS SHOUTING and all lowercase also conveys a specific tone especially due to autocorrect enforcing capitals now)"}, {"text": " "}, {"text": ""}, {"text": ""}, {"text": " "}, {"text": ""}, {"text": "as well as now the use of 😊emoji😊 and ố̷͚͘͝t̴̹́͌͗͛̐̏̓̐̍͑̚̚͘͝ͅh̴̛͓͉̹̬̱̟͙̖͗̅̌͒̓̀̆͆͑̾̚͠͝ę̷̰̰̖̳͚̥̖͉̗̞̫͒̍̈͊͑̃͂̓̃̌͛̇̆̎͘r̸̛̺̲̭̫͉̤̿̽̇͂̏͌̒̌͂͋̌̾̈̕͜ ̶̢̣͚̜͔̜̋̃́ū̵̟͕̞͚́̾́͘̚ͅn̸̢̨̨̟̙̝͎̭͈͔̤̦͚̑͛̀̆̀̅͘í̶̡̢̲̺̫̯͇͙̣ć̸̨̛͓͉̫̭̀̉̈́̅͝ô̷̧̰̋̋̑́͊̎̿͋̔͘͝d̷͙̙̻̬͕͓̀̿̍͌̕e̴͔͈̼̫̖͈͍͇̠͙͓̭̮̲̎͋̌̌͌͒̒̀ ̸͈̰̱̟̺̱̠̯͈̝͔̥͉̅̾̆͗͑̀̋̾̂̚͝ć̷̛̤̝̩̟̣͘ȟ̷̡̗̤̰̠͒͑́́͆̀̾̓̅̂͊̄̓͜͝a̴̜̟̲̻̫͉͌̔ͅr̴̛̤̝̤͙̯̠̪̖̲͔͍̲̳̘̋̾́̈̀̄̆͊͒̚͘ą̵̡͎͇͓̖̹̯̤̼̓͊ͅc̴̱̤̝̯̟̙̹̮͖̲͔̈́͑̊̄̏̅t̴̼̥͔̼͎̗̟̯̜̥͓͓̠̘̏̓̆̄̑̾͐ȩ̵̩̠̼̙͓̮̗͍̮̝̫̩̒͒̋̈͑̚ŕ̷̲̱̳̠̩͓̒̍̈́͆̒̾̎́̉̿̅ͅs̶̨̱̝͖͓͍̰̜̲̍́̔̌̈́̑͂̈́̌͠͝͠ to convey other meanings"}, {"text": ""}, {"text": "there are all sorts of bits of slang that only work in text based mediums and can convey tone lol"}, {"text": ""}, {"text": "the internet also allows people to play around with names and identities more as it allows people to select usernames or profile pictures etc."}, {"text": "which also communicate information"}, {"text": ""}, {"text": "also memes or gifs are tools of communication which can help replace functions of body language or tone."}, {"text": "also why if communication that people use everyday is more difficult to convey meaning does that mean worse communication skills?"}, {"text": "surely they would need better communication skills to make up for the gap in meaning that can be conveyed (if that even exists)"}, {"text": ">On Instagram alone, you'll find over 14 million posts tagged with #CoupleGoals ranging from magical dates, to adventures in foreign countries (#baecations), or video edits of someone's significant other."}, {"text": "Isn't this itself evidence that social media hasn't ruined romance?"}, {"text": "14 million different romantic events seems to suggest that romance is doing fine."}, {"text": "If you base your life on what your see on Facebook and Instagram then you deserve everything you get."}, {"text": "I agree that these unrealistic expectations have always been around, but I'm proposing that social media magnifies them."}, {"text": "Our lives are so entrenched in social media that perfect relationships are shoved in our faces constantly."}, {"text": "1."}, {"text": "The claim I am making is through the definition of the word, romance."}, {"text": "I believe in a big definition of love, which is what I think you allude to."}, {"text": "The distinction I want to make is romance as defined as the process of wooing and being wooed."}, {"text": "Social media has not killed love; it's ruined romance in regards to how we communicate and our expectations."}, {"text": "2."}, {"text": "I think measuring romance by a quantity is dangerous."}, {"text": "Romance, since it is tied to the emotion of love, should be examined in a deeper light beyond a number of people."}, {"text": "I 100% agree with you that social media allows for more connections to be made, but what is the value of those connections?"}, {"text": "More is not necessarily better, and I worry about the quality of these \"many connections\" we can make."}, {"text": "3."}, {"text": "Lastly, I speak to a more general examination of romance."}, {"text": "Perhaps it is because I am of a younger age where people are more immersed in media and easily swayed by it, I speak, not from experience, but from the relationships I see around me."}, {"text": "I appreciate your response and can see spots where my argument is flawed, ie."}, {"text": "people having different love languages, younger generations being more affected than others, etc."}, {"text": "how would you define romance?"}, {"text": "I can't speak for somebody that's grown up completely within the social media bubble, but this trend is still relatively new, and I like to think that we are starting to see through the bullshit perfect lives you reference."}, {"text": "1) so I'm not sure whether you changed your view here because it seems like your agree that the definition in your original post was bad, and moved to a wooing definition."}, {"text": "either way, im saying that the original definition was flawed and your current definition of romance as a process of being wooed is better, but not as good as my definition."}, {"text": "2) even if you disagree with measuring romance by total quantity of romance, id argue that the examples set by social media improve the quality of romance out there."}, {"text": "by using these instaposts to set the expectations high, it's better for everyone."}, {"text": "a high standard of romance is good."}, {"text": "we should all strive to achieve a high standard."}, {"text": "yes, not everyone is going to do nuts stuff like fly to bali, but that doesnt mean that doing less than the most insane romantic things is bad."}, {"text": "those less insane romantic things are degraded just because some instadude takes a romantic pic in some crazy location."}, {"text": "3) idk man, i highly doubt that any romance is ruined by social media."}, {"text": "the only way you'd actually ruin romance because of social media is if you're taking pics when youre trying to be romantic."}, {"text": "that ruins it a bit because it makes it about the event and not the romance."}, {"text": "but having a cute dinner is always romantic, even if it's not as nuts as having a dinner on top of a mountain or something."}, {"text": "I wouldn't."}, {"text": "If I had to, it would be my partner's vision of romance."}, {"text": "Currently, I think it has to do with grand gestures and drama."}, {"text": "It's probably personal."}, {"text": "1."}, {"text": "I was clarifying the definition of romance."}, {"text": "Wooing is involved in the mystery of love, as mentioned above in my main argument's Google definition."}, {"text": "2."}, {"text": "I agree that having high expectations is important, but to what extent extent does it become detrimental to a relationship?"}, {"text": "Let me take the situation out of context."}, {"text": "In the case of teenage girls viewing models on social media, it is creating a toxic environment in which these teenage girls are looking to change themselves to be more like the models."}, {"text": "This is an unhealthy mindset to have because looking at other people's standards fail to ignore the unique circumstances of your own situation."}, {"text": "It is actually very toxic to be immersed in such high expectations all the time."}, {"text": "3."}, {"text": "I believe we are so immersed in media, that even subconsciously, these expectations can invade our thoughts."}, {"text": "Yes, a romantic dinner is fantastic, but as mentioned in point 2, it can be easy to fall victim to constantly comparing oneself."}, {"text": "In addition, social media allows for miscommunication, which can ruin romance as well."}, {"text": "1) ok, i hear you, i dont feel like arguing the definition anymore, so i'll move to the others."}, {"text": "2) just be clear that, there is evidence that looking at social media can make your view of yourself worse."}, {"text": "but there is also evidence that looking at positive comparisons can make your view of yourself better."}, {"text": "and im sure the same holds for romance: https://journals.sagepub.com/doi/abs/10.1177/1461444819826530?journalCode=nmsa"}, {"text": ""}, {"text": "3) see the study in point two."}, {"text": "and do you think that the same wouldnt apply with romance?"}, {"text": "CMV: We should stop lying to kids about Santa Clause"}, {"text": "Each year at Christmas, most of us as part of a western tradition, tell our kids that Santa Clause is coming and will deliver presents under the tree for them."}, {"text": "Many of us might go as far as to get kids to wish for presents they might get, or tell them they might get on Santa's Naughty list and not get a present at all."}, {"text": "While I don't have a problem with Christmas, the gift giving, and even talking about Santa as a Christmas character, I'm not convinced of the value of lying to our children that Santa is *real*."}, {"text": "In fact, I think it's actually worse for the child and society to perpetuate a tradition like this based on a lie."}, {"text": "Unlike other fantasy characters such as Batman, SuperMan, Wonder Woman, SpiderMan etc."}, {"text": "we treat Santa with special reverence."}, {"text": "We lie to our children when asked directly if Santa is real, and we go to extra lengths with practical activities like getting kids to leave milk and cookies out for Santa, then eating them to provide evidence of his \"realness\"."}, {"text": "Think about this part."}, {"text": "We aren't just doing this for fun, but would fabricate facts if caught by our child eating the cookie to maintain the lie (e.g Santa just left and I'm cleaning up, I'm moving the plate to a spot Santa will find it better etc.)"}, {"text": "Years later in primary school kids are either "}, {"text": ""}, {"text": "1. embarrassed as they find out that Santa isn't real when told by another child (often publicly), "}, {"text": "or "}, {"text": ""}, {"text": "2. kids find out through second hand information (e.g overhearing their parent) and either cry about being tricked, or start telling other kids who don't already know and pretending like they knew all along."}, {"text": "The child they tell ironically likely ends up in scenario one above."}, {"text": "To summarise, this isn't about Christmas, this is about Santa Clause."}, {"text": "I do not see any big issue with treating Santa Clause as we treat other superheros, with fun and as a make-believe activity."}, {"text": "But we should stop lying to our children and convincing them that Santa is real entity that exists in the world in a different way to Batman/Wonder Woman."}, {"text": "It teaches our kids that parents will lie about trivial matters, and while limited it ends up causing the child more harm than good."}, {"text": "/u/scoogsy (OP) has awarded 1 delta(s) in this post."}, {"text": "All comments that earned deltas (from OP or other users) are listed [here](/r/DeltaLog/comments/e4w40v/deltas_awarded_in_cmv_we_should_stop_lying_to/), in /r/DeltaLog."}, {"text": "Please note that a change of view doesn't necessarily mean a reversal, or that the conversation has ended."}, {"text": "^[Delta System Explained](https://www.reddit.com/r/changemyview/wiki/deltasystem) ^| ^[Deltaboards](https://www.reddit.com/r/changemyview/wiki/deltaboards)"}, {"text": " copy/pasta from last time this came up here-"}, {"text": ""}, {"text": "So my parents told me Santa was real."}, {"text": "I was also a super nerdy bookish kid."}, {"text": "There  came this day when I must have been something like six or seven or  whatever age kids start really doubting."}, {"text": "I did the homework."}, {"text": "I figured  out that Santa would have to be going super fast."}, {"text": "I realized how many  people don't have chimneys."}, {"text": "all that stuff."}, {"text": "On the other hand you have  NORAD tracking him and the story is so widely told that it must mean  somethings."}, {"text": "All that stuff."}, {"text": "And I  brought that to my father."}, {"text": "I laid out both cases and asked point blank  if Santa was real."}, {"text": "His answer is why I don't agree with you."}, {"text": "My  father told me that he believed in the idea of Santa."}, {"text": "he believed in  the idea that every once in a while good people can be rewarded while  bad people might not be."}, {"text": "He believed in the spirit of giving for it's  own sake and in kindness."}, {"text": "He believed in the idea of peace and a little  bit of magic."}, {"text": "He believed in the power of the message."}, {"text": "Now,  I was of course unable to process that, and said \"is there a fat guy  that comes down the chimney\" and he said \"no, there isn't\""}, {"text": ""}, {"text": "I never stopped getting gifts from Santa."}, {"text": "Years  later and I'm reading the comic book \"Kingdom Come\" and in the forward  there's a whole discussion about believing in Superman for similar  reasons."}, {"text": "I've started studying folklore and storytelling."}, {"text": "I'm reading  Plato and I'm reading Diskworld and I'm finally understanding what my  father was saying."}, {"text": "It was a slow burn lesson, but I think he was right."}, {"text": "I believe in Santa, and that's why, if I had a child, I would tell them Santa is real."}, {"text": "Because I think he is."}, {"text": "I don't see the big deal."}, {"text": "No one becomes traumatized because of Santa."}, {"text": "It's just a fun tradition."}, {"text": "For me, the big presents always came from my parents and \"Santa\" gave me stocking stuff and little side gifts."}, {"text": "I don't see a problem if parents don't like the idea tho."}, {"text": "I don't think that's a problem at all."}, {"text": "It's something the kids look forward to."}, {"text": "Something that gets them excited."}, {"text": "Something to cheer them up."}, {"text": "And they eventually grow out of it."}, {"text": "No hard feelings at all."}, {"text": "Here's my response to this CMV from [17 days ago](https://www.reddit.com/r/changemyview/comments/dwidfg/cmv_you_shouldnt_lie_to_your_kids_and_say_that/):"}, {"text": ""}, {"text": "> My daughter \"believed\" in Santa Claus a few years after she found out he wasn't real."}, {"text": "She just liked the idea of it, and the imagination of it."}, {"text": "Today she's 31 and her life motto is \"Radiate Positivity!\""}, {"text": "> So I guess if you're a somber, cynical little 2 y/o, your parents shouldn't try to force it on you, but if you're always super happy and filled with wonder, your parents should play along."}, {"text": "I have two children and haven't used the \"presents from Santa\" on their Christmas gifts."}, {"text": "We do read stories/ watch shows about him."}, {"text": "And we've read the history of Saint Nicholas, talked about how he is personified through time and in different cultures and countries."}, {"text": "When my oldest was hearing chatter from her peers we had a talk about how once she knows that it is the adults that are Santa's hands she has a responsibility to help keep the magic going for little kids, big kids, and grownups that still believe."}, {"text": "Keeping the spirit of kindness, thoughtfulness, giving, sacrifice, contributing to the good off your community, and gratitude are important for me to help build in them."}, {"text": "When they are grown they will be making their own choices about how to celebrate (or not) but for now I want them to remember that I actively didn't mislead them and we still celebrated all the joyful parts."}, {"text": "as a former child I wouldn't trade the wonder of Santa Clause and a world full of magic for the truth."}, {"text": "\"We give you presents because this calendar displays a certain number\" doesn't really do it."}, {"text": "This is the perspective of the child."}, {"text": "Form an adult standpoint I think it is a valuable lesson to learn that adults can and do lie."}, {"text": "It helps children to learn to think for them self and don't trust adults beyond objective reality."}, {"text": "When I was little I believed in magic."}, {"text": "Santa, tooth fairy, dragons, all kinds of magic."}, {"text": "Things my parents lied to me about and things I read about and loved"}, {"text": ""}, {"text": "When I found out it all wasn't real (probably a bit older than most) it really hurt."}, {"text": "I cried a lot but eventually I felt better."}, {"text": "Fantasy is still my favorite genre to read."}, {"text": "Looking back on it today I am so happy for a few years I lived in a world with magic, things with magical creatures and mystical beings bearing presents and things that were impossible."}, {"text": "Is it that crazy to let children believe in a world with magic for a few years?"}, {"text": "Is it that wrong to show them that anything can happen?"}, {"text": "I am an avid reader and I attribute a lot of that to my love of the fantastical in my childhood."}, {"text": "I'm sure many artists and writers have found inspiration from those feelings as well."}, {"text": "I grew up in a semi-atheist household, with my divorced mom switching religions based on who she was dating at that point (which went to further put my doubt in anything with no science behind it) and my Dad telling me that the god my grandparents prayed to was kind of a dumb idea, so really anything that had no science wasn't real to me."}, {"text": "Came a time when I realized that if science couldn't prove immortal people or animals, then it couldn't prove the same with Santa Clause and his reindeer."}, {"text": "It taught me one thing: people lie."}, {"text": "I didn't lose trust in my dad because I knew it was just for fun, but I gained some skepticism to outside things."}, {"text": "While I'm here I'll just tell a quick story, has nothing to do with this post other than the concept of Santa and parenting"}, {"text": ""}, {"text": ""}, {"text": "When my grandma has her first child, she upheld that Santa was real until he found out then he was very mad at her."}, {"text": "When she had her second, she told him Santa was just for fun and wasn't real, and he got mad because he wanted to believe Santa was real."}, {"text": "Well by doing the whole \"if you misbehave than Santa will put you on his naughty list \" is smart as it means that kids will behave."}, {"text": "Ironic since this bad behaviour is fixed by exploiting the child's greed.still works though"}, {"text": "> Each year at Christmas, most of us as part of a western tradition, tell our kids that Santa Clause is coming and will deliver presents under the tree for them."}, {"text": "> In fact, I think it's actually worse for the child and society to perpetuate a tradition like this based on a lie."}, {"text": "But it's not ultimately about getting away with lying."}, {"text": "After all, revealing the truth (or even better: letting them *figure out* the truth through logical reasoning), is just as much part of this tradition."}, {"text": "The Santa myth essentially promotes critical thinking: at some point, those kids will start using their reasoning capacity and suspect that there must be something else going on."}, {"text": "The older they get, the more questions they generally have: how can Santa do all of this within 24 hours, how can he fit all those presents on his sleigh, how does he fly, enter houses etc."}, {"text": "It teaches them to question authority and not to believe everything they hear *uncritically*."}, {"text": "> Years later in primary school kids are either"}, {"text": "> "}, {"text": "> 1.   embarrassed as they find out that Santa isn't real when told by another child (often publicly), or"}, {"text": "> 1.    kids find out through second hand information (e.g overhearing their parent) and either cry about being tricked, or start telling other kids who don't already know and pretending like they knew all along."}, {"text": "The child they tell ironically likely ends up in scenario one above."}, {"text": "Actually, kids get to feel proud when they figure it all out."}, {"text": "And if they have a younger sibling, they can also feel proud about being in on the secret with their parents."}, {"text": "Also, there was a study done with hundreds of kids, [which showed that](https://www.parentingscience.com/Easter-Bunny-and-Santa-Claus.html):"}, {"text": ""}, {"text": ">> ...none of them reported feeling angry at their parents when they found out the truth about Easter and Christmas (Condry 1987)"}, {"text": "That's a lovely personal story."}, {"text": "I have heard reasons like this before, that \"I believe in Santa because if the message he brings\"."}, {"text": "However I'm not convinced we *need* Santa to bring this message."}, {"text": "We have so many wonderful real people in the world, our friends and family doing real gestures and making real sacrifices for us."}, {"text": "The fact that the gift a child is given, was considered by someone, sought out from a store (or perhaps hand made if the gift giver is so inspired), bought for with real money, etc."}, {"text": "seems cheapened by then saying that it was Santa that did this."}, {"text": "Why not be thankful to the person?"}, {"text": "There are so many other cultures that don't have Santa,  and Santa has only been around in western culture for a relatively short time."}, {"text": "We can look to the real world, and the goodness in those around us for inspiration."}, {"text": "We don't *need* a fabrication to show us what we can be, and the meaning of gratitude, real gratitude."}, {"text": "While I'm not swayed by this, thank you for your thoughtful response."}, {"text": "Just don't lie about it."}, {"text": "If it's so trivial, make him like every other super hero, drop the song and dance, and drop the lying."}, {"text": "I'd recommend you read back over my post."}, {"text": "No hard feelings at all probably isn't exactly accurate."}, {"text": "It's unlikely to lead to long term psychological damage, but kids can get cut up over this."}, {"text": "We are also lying to them."}, {"text": "I'm still feel like we just treat Santa like every other super hero."}, {"text": "Why does Santa shit on jewish kids then?"}, {"text": "Why lie?"}, {"text": "Why not treat Santa like every other fictional character?"}, {"text": "I can get behind this idea."}, {"text": "I see this very much in line with the idea of fictional characters."}, {"text": "We take the best parts of those and tell them how they can be like Super Man and do good."}, {"text": "While I don't hunk you've changed my view, what you're saying certainly resonates with me :-)"}, {"text": "Thanks for the response."}, {"text": "A couple of comments I might make in return."}, {"text": "Children typically get bowled over with excitement know people are visiting, food is being served, yummy cake and chocolate is on offer, and presents are there to unwrap."}, {"text": "The fact that it falls on this day or that is largely irrelevant for everyone, including children."}, {"text": "In fact, often families hold Christmas days or even a week or more before the end, because of the various family functions and places everyone needs to be at."}, {"text": "Remember, I'm not claiming we completely remove Santa, I'm saying we simply stop lying about it."}, {"text": "As for examples to provide to children."}, {"text": "We have ample opportunity to show children time and again that people lie."}, {"text": "Perhaps a more powerful lesson is demonstrating, as a parent that lying isn't needed, and that you show that by not lying (even about Santa)."}, {"text": ":-)"}, {"text": "!delta "}, {"text": ""}, {"text": "Thanks for the response."}, {"text": "While there is lots of talk about magic and mystery in the world from various respondents, you do make a good point about the difference between someone who has truely believed in magic (in this case Santa) and someone who hasn't."}, {"text": "With the lie of Santa, some significant portion of kids would think he is a magical being for some period of their life."}, {"text": "In one way this experience, and the loss of it could be considered in some ways one of growth."}, {"text": "Many if not most would hold it as a fond memory (the believing part)."}, {"text": "While I'm not swayed away from my overall position, I'll award this delta based on the argument that there likely is something to gain from having a belief in Santa, and then growing and learning the truth."}, {"text": "This differentiates those who never believed in Santa in the first place and may find it harder to empathise with those who have gone through the transition."}, {"text": "I liked the story at the end."}, {"text": "Can't win hey!"}, {"text": "Let me give you the counterexample from someone who expresses it better than I can"}, {"text": ""}, {"text": "https://youtu.be/DBnENlXt-H4"}, {"text": "parents are humans (I was told) and humans lie."}, {"text": "Conscious and unconscious."}, {"text": "But they all lie."}, {"text": "Confirmed: 1 delta awarded to /u/blastzone24 ([1∆](/r/changemyview/wiki/user/blastzone24))."}, {"text": "^[Delta System Explained](https://www.reddit.com/r/changemyview/wiki/deltasystem) ^| ^[Deltaboards](https://www.reddit.com/r/changemyview/wiki/deltaboards)"}, {"text": "Perhaps I could make a book recommendation then."}, {"text": "Lying by Sam Harris."}, {"text": "It's short and makes quite the case as to why Lying, in almost all but the most extreme cases, isn't necessary or worth it."}, {"text": ":-)"}, {"text": "if you cannot condense it into a comment, it sounds like a coup out."}, {"text": "CMV: Real Christmas trees are better for the environment than plastic one"}, {"text": "So, plastic Christmas trees are often sold as more eco-friendly than real trees."}, {"text": "I don't think this is true, based on my estimations of the life of a plastic tree vs. a real tree, as seen below."}, {"text": "Plastic Christmas Trees:"}, {"text": " "}, {"text": "- produced in a factory —> air pollution  "}, {"text": ""}, {"text": "- used for many years until worn out "}, {"text": " "}, {"text": "- thrown away —> landfill that will sit for thousands of years and leach chemicals into the earth"}, {"text": ""}, {"text": "Pros: the factory likely uses less land than a tree farm"}, {"text": ""}, {"text": "vs."}, {"text": ""}, {"text": "Real Christmas Trees:"}, {"text": ""}, {"text": " - grown on a tree farm —> take in carbon dioxide and produce oxygen"}, {"text": ""}, {"text": " - used once"}, {"text": ""}, {"text": " - left in the woods —> decomposed quickly and enriches the soil, or taken away and dumped —> decomposes quickly, no chemicals left in the earth"}, {"text": ""}, {"text": "Cons: the tree farm takes up a lot of land"}, {"text": ""}, {"text": "CMV!"}, {"text": "If used for more than 5 years, it looks like plastic trees are the better option."}, {"text": "https://www.christmastreeassociation.org/new-study-measures-impact-of-christmas-trees-on-mother-nature/"}, {"text": ""}, {"text": "If you ever have similar questions like this in the future, you can Google \"_____ life cycle analysis\"."}, {"text": "LCAs are an objective method of comparing environmental impacts (i.t.o."}, {"text": "ghg's, toxins, ozone's, particulate matter, etc) of products from cradle to grave."}, {"text": ">left in the woods —> decomposed quickly and enriches the soil, or taken away and dumped —> decomposes quickly, no chemicals left in the earth"}, {"text": ""}, {"text": "Is this true in most cases?"}, {"text": "Or are they dumped into landfill where they don't decompose?"}, {"text": "Even organic matter doesn't decompose in landfills because everything is packed so tight and no oxygen is present to aid the decomposition."}, {"text": "Instead as they break down methane is releases, which is worse green hosue gas than CO2"}, {"text": "It would be lovely to have a simple answer to questions like this but life is often more complicated than that."}, {"text": "If you buy your christmas tree from a supermarket then a plastic tree reused many times will eventually be the better environmental choice - others have posted links to a study which shows that."}, {"text": "If you buy a real tree from a local producer then the story may be very different."}, {"text": "If you can be confident that your tree will be responsibly composted after use then that also matters."}, {"text": "I buy my tree from the same local farm each year, I have walked / cycled over that land and I know their trees are grown sustainably in small stands interspersed among the other woodland and they are transported very short distances to market (typically less than 2km)."}, {"text": "I am pretty convinced that by creating a market for selling these trees this is an ecological win because of the specifics of it being a known local supply."}, {"text": "So the answer is - it depends."}, {"text": "If you find a good source of real trees then your arguments hold true."}, {"text": "If you just buy one from a mass market seller then you should heed the research linked to elsewhere in the responses and consider that a plastic tree reused many times may be better."}, {"text": "I am allergic to all varieties of Christmas Tree."}, {"text": "As such fake ones are better for MY environment than real ones are as I cannot be in the same room as a real one."}, {"text": "Depends how many times you use the plastic tree and how far the real tree needed to travel to get to the home and be disposed."}, {"text": "I mean if you live in a desert, it is obviously gonna increase the transport cost."}, {"text": "When the tree decomposes it releases all the trapped carbon back into the environment."}, {"text": "Consider the extra miles driven to transport, pickup and dump all those real trees."}, {"text": "All i have to say about this is even though its a tree farm, its still a monoculture."}, {"text": "Fertilizers pesticides and fungicides still completely wipe out the enviroment and wildlife, insects and fungus are actually incredibly inportant in an ecosystem."}, {"text": "Plus evergreen/conifer trees make it much harder for seeds to germinate so once cut the crop down enough times it will take a few years of cover crops to restore the land, or decades for nature to do it itself."}, {"text": "Yeah, it's probably better that fake trees."}, {"text": "But only slightly."}, {"text": "Something like this can only be answered from an agriculture standpoint, and unfortunately modern agriculture is actually horrendously terrible for the enviroment, and this is no exception."}, {"text": "There's also the fact that growing trees-as plants grow they basically take the available nutrients out of the ground and turn it into a plant."}, {"text": "However plants can't particularly just pick up any old nutrient, fungus helps in this (also cutting down the trees when we do kills the fungal network which is absolutely essential to tree health) But the bottom line is these nutrients have to be in the form of organic matter, or biomass."}, {"text": "So a tree lives and is pulling biomass out of the ground for several years, we pull that tree out-suddenly there's no more biomass in the soil."}, {"text": "Then we have the dustbowl all over again."}, {"text": "No its not like Christmas trees would destroy 1/3 of the country, but the fact remains that it is still a monoculture, and if it is done too much in the same spot it will suck the life out of the land."}, {"text": "So although it may be slightly better, it is only slightly."}, {"text": "It doesn't directly look as bad, but it will cause its fair share of damage to the world around it."}, {"text": "If the trees were grown as a part of a permaculture system, so only sl many trees in a diverse (mostly edible) forest could be removed, and we had several of these food forests in and around our cities, then there would be no comparing it."}, {"text": "Because the trees could be returned to the farms,since in this concept of society there would always be a farm pretty close by."}, {"text": "Big business is inportant for some things but when it comes to food and tradition, and how we live our lives, detaching the means of these things from our self community and nature is the problem."}, {"text": "We go out to celebrate a holiday about togetherness by ordering a fake tree on Amazon and buying things that people like, that's what's wrong."}, {"text": "Our bodies both as individuals and as communities need to be recognized and taken care of."}, {"text": "Something like this should be celebrated as a community, Christmas would mean more for kids if once a year they went down the the local farm that they buy all of their fold from, walked past the dormant orchard sleeping over the winter and watched the pigs cleaning up some leftover apples, down into the forest filled with berries, wild vegetables and no shortage of wildlife to hunt for the perfect tree, that they watch a parent or one of the many farm hands that helps them all year with their food needs chop down and carry out."}, {"text": "It becomes more than s tree that gets put up once a year with that, it becomes an experience, and shows kids that these things are a part of nature and not just some meaningless tradition."}, {"text": "We carry the same motions of Christmas year after year, but because of this industrialization and modernization of the world, those motions have less meaning every time."}, {"text": "THAT is how its worse."}, {"text": "The overall process is becoming more detached from its original point-to be thankful for the land and each other."}, {"text": "To appreciate that our effort as a community has pushed us into another year."}, {"text": "The youth sees this incredible world we have built and have no idea where it came from, and to me, these kinds of traditions are some of The most important ways of holding onto or fixing that."}, {"text": "Fake trees might be slightly worse than chemically grown trees, but both options presented in that argument represent an industrialized silhouette of what it should be."}, {"text": "Repost is a repost?"}, {"text": ">used for many years until worn out"}, {"text": ""}, {"text": "The longevity of these trees is easily 30+ years."}, {"text": "That's 30 trees that weren't purchased."}, {"text": ">landfill that will sit for thousands of years and leach chemicals into the ear"}, {"text": ""}, {"text": "You can recycle plastics."}, {"text": "Also, you are discounting the fuel and air pollution year over year used to cut down the trees, attach them to bases, and haul them from nature into the Christmas tree lot."}, {"text": "My family has been using the same exact plastic tree since before I was born and I'm 26."}, {"text": "Still in good condition and my mom intends to keep using it indefinitely as far as I know."}, {"text": "If the data on that page is accurate we've unknowingly helped save the environment all these years by being frugal."}, {"text": "I mean you can say the same thing about the oil pulled from the ground, shipped to a refinery, Distillation of the oil, collection of that oil used for making the plastics, turning that into plastics, forming that into a tree and then shipping that to its box store."}, {"text": "No you can't because he said \"year over year\"."}, {"text": "For a plastic tree, that only happened once in order to make it, not repeatedly every year like it does for real trees."}, {"text": "CMV: Padme caused Anakin to become Darth Vader"}, {"text": "I'm currently set down, watching The Phantom Menace."}, {"text": "They just got to Tatooine."}, {"text": "Padme insisted that she go with Qui Gon to see the settlement."}, {"text": "If she hadn't gone with Qui Gon, she wouldn't have met Anakin."}, {"text": "That's when *they both* started to fall in love with each other."}, {"text": "I'm arguing that she also wouldn't have gotten to know him on the ship."}, {"text": "If they hadn't met in Episode 1, she would've been far less likely to request Obi-Wan and Anakin for security in Episode 2."}, {"text": "They wouldn't have fallen in love, had children, and Anakin wouldn't have felt the pain of losing her, which ultimately drove him to become Vader."}, {"text": "By this logic it's also Watta's fault, because he had Anakin there on that day, and it's Anakin's mom's fault for giving birth to him."}, {"text": "Why are you removing Anakin's agency in all of this?"}, {"text": "Padme never pushed him into murder, that was all Anakin and his own insecurities and latent psychopathy that Palpatine preyed on."}, {"text": "He killed a whole village of Tuskan Raiders after they kidnapped his mom."}, {"text": "He murdered Dooku in cold blood for taking Palpatine hostage."}, {"text": "He was already a killer without Padme's involvement."}, {"text": "There is no reason to think he wouldn't turn to the Sith if Palpatine manipulated him using his relationship with someone else like Obi-Wan."}, {"text": "That's a pretty long bow."}, {"text": "If Padme's mum had stayed at home the night she met Padme's father then we wouldn't be talking about Padme at all."}, {"text": "The fact she made the decision to go onto the planet is irrelevant to Anakin's eventual fall to the dark side."}, {"text": "Anakin was manipulated by Palpatine, he deliberately did this."}, {"text": "All other circumstance bears less responsibility."}, {"text": "The fear of losing Padme was the final straw that led to Anakin fully embracing the dark side."}, {"text": "That's not Padme's fault."}, {"text": "If she was never around Anakin probably would have fallen in love with someone else and may have acted the same way if their life was threatened."}, {"text": "Ultimately its Anakin's fault."}, {"text": "We bear the responsibility for our own choices."}, {"text": "We can also say he was manipulated by Palpatine to make the decisions he did though."}, {"text": "His descent was also a gradual process...what of his reaction to his mother being killed by Sandpeople?"}, {"text": "She would have presumably still met Anakin when the precocious little monster ended up coming along with them."}, {"text": "Qui Gon was the reason they went to Watto's shop and met Anakin, and Anakin was the one who asked them to come to his home where they saw the pod racer."}, {"text": "So even if they don't meet on the surface, they eventually meet on the ship."}, {"text": "And even if they don't rekindle there, she probably still asks for Kenobi (the one jedi she trusts implicitly, and thus his apprentice) when she is under threat later on, at which point hormones probably kick in anyways."}, {"text": "Assuming none of this happens, Palpatine probably still finds a way to jerk him around, because Palpatine was really, really good at messing with people."}, {"text": "The Padme fixation seems highly suspicious."}, {"text": "Qui Gon is so to blame, Palpatine directly, but above all Anakin himself is the sole responsible person for his outcome."}, {"text": "Through his whole life he's been a whiny bitch."}, {"text": "Wasn't there like a 10 year gap between episode 1 and 2?"}, {"text": "The second he got back he proved he was obsessive and angry and jealous and a complete pessimist, something Obi Wan pointed out to him and referenced him being this way in those ten years he had no contact with Padme."}, {"text": "Even when they reunited he was a complete asshole."}, {"text": "He disregarded her feelings, he interrupted and spoke over her countless times, spoke out of turn, and ignored her logical advice about doing his duty."}, {"text": "Anakin is the one who insisted they should be together despite Padme protesting through half the second movie."}, {"text": "I really hope this isn't another one of those \"blame the woman for how the man turned out\" things."}, {"text": "He made his own choices."}, {"text": "He had a hard life being raised a slave and fighting to get by."}, {"text": "He was a natural pessimist and was jealous because he grew up with almost nothing."}, {"text": "Padme is not to blame for any of his choices."}, {"text": "Not even Obi Wan or the other Jedis could convince him to change his behavior."}, {"text": "The artificial construct of the Jedi being required to renounce feelings and live as ascetics caused Anakin to become Darth Vader."}, {"text": "The expectation that they must be monks because of some mythology rather than recognizing that the dichotomy of  light and dark is what actually creates the problem in the first place is what made Anakin become Vader."}, {"text": "The problem is the system itself and how it insists on nigh impossible purity"}, {"text": "And why did Qui Gon and Obi Won even go to Naboo in the first place?"}, {"text": "Because Palpatine convinced the trade federation to establish the blockade."}, {"text": "Palpatine foresaw what would happen, and ensured that it did."}, {"text": "It's even reasonable to assume that he's Anakin's Force Baby Daddy."}, {"text": "Given what we know of Palpatine from eps 1-6, it's pretty safe to assume that everything that happens is because he wanted it to (except you know, the one thing he didn't count on, the betrayal of Darth Vader)."}, {"text": "While Anakin's relationship with Padme was certainly a strong catalyst fueling the fear and doubt in Anakin, ultimately Palpatine was manipulating Anakin to sow doubt in him against the Jedi Council, and to ultimately stage Order 66 and turn the Galactic Republic into the Galactic Empire."}, {"text": "The Jedi Council is as much to blame here as well, with their power struggle against the Chancellor."}, {"text": "Even without Padme, I think Palpatine would have found ways to use the Council's actions to tempt and justify Anakin's transition to the dark side."}, {"text": "The Jedi Council tried to reject Anakin, originally refusing to teach him at all, and then even when accepting him into the order keeping him out of the decisions and keeping him at arm's length."}, {"text": "This created anxiety and resentment in Anakin towards the Jedi."}, {"text": "Then, they assign him as a double agent to the Chancellor to spy on the Republic- again he resents being used as a pawn, and questions the purity of their motivations to use a spy against the government."}, {"text": "Now of course this is orchestrated by Palpatine, as Palpatine tries to insert himself as a father figure to Anakin, telling him the Council fears his power, and isn't respecting him as they should."}, {"text": "Palpatine uses his meetings with Anakin to tell him of the Dark Side, telling him that they aren't so different, Jedi and Sith, but that the Jedi are weak, naive, and scared to explore the Force in its entirety."}, {"text": "Now, while Anakin's fear of the loss of Padme allows the Chancellor to offer Anakin hope, tell him of the powers the Dark Side could offer to prevent this loss... ultimately I don't think this alone is the push Anakin needs to betray the Jedi."}, {"text": "The transition of Anakin to the Dark Side is telegraphed, even from the beginning of RotS."}, {"text": "When it comes to fighting Count Dooku we get a foreshadowing of the eventual failure of the Jedi Order that will turn Anakin."}, {"text": "Anakin resists executing Dooku, says it isn't the Jedi way, says that he should face trial.... and ultimately regrets his decision to kill the Sith at Palpatine's command."}, {"text": "This directly mirror's the arrest of Palpatine- Mace Windu holds the now crippled looking Chancellor at blade tip, and Anakin says it's not the Jedi way, the Chancellor should face trial... Mace tells him that the Chancellor owns the Senate and is too dangerous to be left alive."}, {"text": "That is the moment that solidifies Anakin's transition to the Dark Side."}, {"text": "That moment Anakin is in turmoil, fighting for the Jedi way, the democratic way, what he feels to be the just way.... when Mace chooses to act against this, in an \"un-Jedi\" manner, Anakin finally truly sees the hypocrisy and hubris of the Jedi."}, {"text": "He loses the separation in his mind between the Light and Dark side."}, {"text": "At that point the choice is clear- choose the path that promises knowledge to protect what he loves, because neither is right or wrong, they're both equal."}, {"text": "While the power to protect Padme is certainly crucial here, as Palpatine is offering something the Jedi don't- Yoda even going so far as to ignore Anakin's fears and tell him basically \"get over it, you're going to lose her, accept it now\"... in the end I think even without Padme, Palpatine would have found something to offer Anakin."}, {"text": "Ultimately, it is the seeds of doubt that are planted in Anakin's mind that turn him to the Sith."}, {"text": "He resents that they don't trust him, he resents that they use him as a pawn, he resents that they don't respect his power, and in the moment of Palpatine's attack he sees that the Jedi are just as willing to break code when it is in their favour as the Sith."}, {"text": "Even to the end, Anakin is fighting to remain pure, but Mace Windu's choice to act rather than show Jedi restraint solidifies to Anakin that the Jedi are hypocrites."}, {"text": "I'd argue that Mace Windu was actually the reason Anakin turned into Darth Vader."}, {"text": "Anakin originally confronted Palpatine with the goal of apprehension and judgments from the Jedi council, even proclaiming that it wasn't the Jedi way when Mace joined him in confronting the emperor and wanted to slay Palpatine."}, {"text": "Had Mace agreed to bring him in instead of trying to kill him, Anakin could have still been saved."}, {"text": "Padme was a piece to the entire puzzle, but not the key."}, {"text": "You're ignoring a big part of the Chosen One myth: destiny."}, {"text": "Anakin was the Chosen One and destined to bring balance to the Force."}, {"text": "That was always going to happen."}, {"text": "Had he not met Padme, he would have turned for other reasons."}, {"text": "It's not like he was the most stable person to begin with."}, {"text": "Anakin's fall to the dark side was inevitable."}, {"text": "The prophecy said that he would bring balance to the force."}, {"text": "if the force hadn't use padme as a motivator for his faull, it would have used something else."}, {"text": "The path to the dark side is through fear."}, {"text": "Padme is NOT responsible for Anakin's feelings of fear."}, {"text": "He had that from the beginning for his mother."}, {"text": "That was just how Anakin reacted to the world when thinking about people he cared about."}, {"text": "It is Anakin's destiny to bring balance to the force."}, {"text": "In order to bring balance to the force, he would inevitably have to kill most of the jedi."}, {"text": "Jedi are pretty powerful, its pretty hard to kill as many as he did, so he'd have to use the force in order to accomplish this, and since part of it involves killing little kids, something a light side user wouldn't do, he would have to use the dark side of the force."}, {"text": "So it was inevitable that he would turn to the dark side."}, {"text": "If Padme didn't exist, something else would have pushed him over."}, {"text": "It always seemed to me like Padme wasn't the whole reason he turned to the dark side, but the straw that broke the camel's back."}, {"text": "He had already used the dark side when fighting the sand people and Dooku, his mom died, the council didn't trust him, and Ahsoka left the jedi order."}, {"text": "We could also look at the people who sparked his obsession with being strong enough to protect the ones he loved: the sand people who killed his mother, not just the men, but the women and children too."}, {"text": "Sure, she wouldn't have met Anakin on Tatooine, but she could have met him on the ship after Qui Gon takes him to be trained by the Jedi."}, {"text": "And also the Jedi Council's overly dogmatic actions and the events that led to Ahsoka leaving the order and all that..."}, {"text": ""}, {"text": "And also it's not as if Sidious wouldn't have eventually found him anyway."}, {"text": "Yes, by existing, she may have, but if you could make that argument, you could make so many others."}, {"text": "Throughout the entire course of his life, what small disturbances and occurences forced him to be insecure?"}, {"text": "Could those be blamed?"}, {"text": "What other multitudes of things could have caused the star wars story to be what it is?"}, {"text": "Even if Padme hadn't existed, Palpatine would have very likely found a whole host of different things to manipulate Anakin with."}, {"text": "While the start of Anakin's journey may have started with Qui gon, and the final feather may have been the loss of Padme, the was a slow and gradual build up of hostility and anger between those defining events."}, {"text": "Anakin learned to hate sand and kill younglings long before Padme died in childhood."}, {"text": "Who taught him this hatred?"}, {"text": "I'd sell it as 1/2 Jar Jar 1/4 Palpatine and 1/4 Lucas himself."}, {"text": "His killing of Dooku was not entirely of his own will."}, {"text": "Also, the Tuskan Raiders had tortured his mother to death, not just captured her."}, {"text": "His relationship with Obi-wan was also extremely secure, it's unlikely that it was a weakness."}, {"text": "Palpatine used Anakin's love for Padme to manipulate him."}, {"text": "Take Padme away, you take away the fear Palpatine played on."}, {"text": "Padme would likely be busy acting like she wasn't the queen on the ship."}, {"text": "She didn't seem all that interested in Obi-wan in Episode 2, either."}, {"text": "After the death of his mother, which he honestly dealt with pretty well, Anakin had nothing but the Jedi and Padme."}, {"text": "Without her, what could Palpatine use against him?"}, {"text": "Oh, so you're one of those \" Jar Jar is the real villain\" people."}, {"text": ">His killing of Dooku was not entirely of his own will."}, {"text": "It was entirely his own free will."}, {"text": "Palpatine demanded he do it, but Anakin knew he shouldn't, but did so anyway."}, {"text": "He considered it and took the dark path."}, {"text": ">Also, the Tuskan Raiders had tortured his mother to death, not just captured her"}, {"text": ""}, {"text": "The children didn't, which he still murdered."}, {"text": "He killed not just the perpetrators, but innocents too."}, {"text": ">His relationship with Obi-wan was also extremely secure, it's unlikely that it was a weakness."}, {"text": "You don't think if Obi-Wan was captured, injured or held hostage and the only way of saving him was if Anakin learned the ways of the Sith, he wouldn't go for that?"}, {"text": "I would also point out that Anakin was feeling extremely alienated by Obi-Wan and the rest of the jedi in episode 3."}, {"text": "Yes and take Palpatine away and it's the same result."}, {"text": "Why the fixation on Padme?"}, {"text": "This assumes Palpatine couldn't have manipulated him in some other way."}, {"text": "Papa Sheev was actually really good at rolling with the punches as far as his plans went."}, {"text": "Anakin was told countless times by the other Jedi and BY PADME that he cannot love or have strong attachments to anyone or anything."}, {"text": "It is Anakins fault for ignoring what he was taught for most of his life and becoming literally obsessed with a woman he knew for a short time as a child and who he then hadn't seen in 10 years."}, {"text": "> She didn't seem all that interested in Obi-wan in Episode 2, either."}, {"text": "I'm guessing she didn't pick the people to protect her from assassination based solely off a brief interaction with a ten year old a decade earlier, no matter how much he told her she looked like an angel."}, {"text": "> After the death of his mother, which he honestly dealt with pretty well, Anakin had nothing but the Jedi and Padme."}, {"text": "He straight up killed them all."}, {"text": "And not just the men."}, {"text": "But the women, and the children too."}, {"text": "He slaughtered them like animals."}, {"text": "I wouldn't say that is 'dealing with it pretty well.'"}, {"text": "> Without her, what could Palpatine use against him?"}, {"text": "His resentment against the Jedi and against Obi-wan."}, {"text": "The fact that he was Anakin's father was also a card that was decently available, but never used."}, {"text": "It is also worth the mention that if Padme was never born, the Emperor probably wins."}, {"text": "He isn't at risk from Windu (if he ever was, I still think he threw that fight) because he never tells Anakin that he is a sith."}, {"text": "He likely still offs dooku at roughly the same time and replaces him with a new trainee after his win."}, {"text": "Pretty much the only risk to him would be that Obi-wan and Yoda don't have to split up, but given this he'd probably just... you know, keep actual guards around rather than wait for Yoda to show up so he can beat his little green ass personally."}, {"text": "Once he is past the end of Revenge it is smooth sailing."}, {"text": "No Luke means the death star is actually a fairly real problem."}, {"text": "Once they weld a grate over the thermal exhaust to protect against space wizards, he rules with an unchallenged iron fist for decades until dying peacefully of old age, or getting stabbed by darth angry, or whatev."}, {"text": "Its not that Jar Jar had the overarching evil plan like Sidious or was even intentionally a Sith, more that he's so fucking annoying and inexplicable that he produces dark vibrations in the force anywhere he goes."}, {"text": "This is what truly started Anakin on the path of darkness and anger."}, {"text": "Exposure to that \"Accent\"."}, {"text": "It seems to me that she's the only one you could take out of the equation, and still have Anakin become a Jedi."}, {"text": "Since, that is, we know it was Palpatine who, through the Force, conceived Anakin in Shmi's womb."}, {"text": "I mean, maybe with his mom?"}, {"text": "Doubtful, though."}, {"text": "Edit: I almost gave you a delta for the words \"Papa Sheev\"."}, {"text": ">It seems to me that she's the only one you could take out of the equation, and still have Anakin become a Jedi"}, {"text": ""}, {"text": "Why is becoming a Jedi important for Anakin?"}, {"text": ">Since, that is, we know it was Palpatine who, through the Force, conceived Anakin in Shmi's womb."}, {"text": "Admittedly I had to fact check that, but that is counter to your position, it sounds like Palpatine is bearing more responsibility."}, {"text": "He literally orchestrated all of this."}, {"text": "How are you absolving Palpatine's involvement in this?"}, {"text": "> It seems to me that she's the only one you could take out of the equation, and still have Anakin become a Jedi."}, {"text": "What about the mom of Padme?"}, {"text": "Or her dad?"}, {"text": "The grandma?"}, {"text": "Well, I'm not."}, {"text": "I'm saying she is the only one involved, who didn't do *exactly as you'd expect her to*, and that action is the driving force behind Anakin's path to the dark side."}, {"text": ">who didn't do exactly as you'd expect her to"}, {"text": ""}, {"text": "What do you mean by this?"}, {"text": ">CMV: Padme caused Anakin to become Darth Vader"}, {"text": ""}, {"text": "You've already explained that Palpatine has taken multiple deliberate actions to actively achieve this outcome."}, {"text": "He based all of his actions, after Anakin's birth, on Padme."}, {"text": "Without her, he'd have no power over Anakin."}, {"text": "You've missed some clarifying questions in the previous two response i've had."}, {"text": ">who didn't do exactly as you'd expect her to"}, {"text": ""}, {"text": "What do you mean by this?"}, {"text": ">It seems to me that she's the only one you could take out of the equation, and still have Anakin become a Jedi"}, {"text": ""}, {"text": "Why is becoming a Jedi important for Anakin?"}, {"text": "Also, as another clarifying question, why is it important to blame Padme and going back to a simple decision of leaving a ship."}, {"text": "She had no idea that she would meet someone who would eventually be the father of her twins."}, {"text": "Palpatine on the other hand deliberately orchestrated a 20ish year plan to eventually seduce a powerful force attuned human to the dark side and literally gave him the name Vader."}, {"text": "If that doesn't satisfy for CMV, what will?"}, {"text": "Padme did what you wouldn't expect her to."}, {"text": "Wat Watto had his young, mechanically minded slave in his salvage shop."}, {"text": "Palpatine tried to turn a powerful force-wielder to the Sith."}, {"text": "One would expect those people to do those things, but a queen being interested in a squalorous little desert town?"}, {"text": "That is unexpected, especially when she should be worrying about her people."}, {"text": "Anakin becoming a Jedi is important so that he can be protected from the Sith, and so he could, one day, end Palpatine."}, {"text": "CMV: It's too late to get into sports as an adult"}, {"text": "(I'm talking about watching football, baseball, hockey, etc."}, {"text": "in this post, not playing them)"}, {"text": ""}, {"text": "I've tried a few times to get into basketball, baseball, football and others but each time I've failed."}, {"text": "I don't think it's my fault, because I genuinely do want to understand why people enjoy them."}, {"text": "But getting into sports for the first time as a 23 year old guy seems nearly impossible to me, and the few games I have enjoyed have all been either finals games/superbowls or just extremely close or intense games."}, {"text": "The average, or even decently entertaining games do nothing for me."}, {"text": "The announcer's voices are still almost completely gibberish, half the words I don't understand."}, {"text": "Even some suggestions I've seen on how to get into sports are composed mostly of words that are foreign to me."}, {"text": "Every time there's a play I want to turn the game off cause I never feel like watching guys walk around for 5 minutes preparing for the next one...100 times in a row."}, {"text": "I can never remember all the player's names, and even when I do get to know a few of them like LeBron James or Baker Mayfield, I'm still unfamiliar with nearly every other player on the other team so I'm still left in the dark."}, {"text": "The best way to describe the whole affair for me is \"culture shock\", but its a culture shock that never seems to go away, no matter how much time I spend with it."}, {"text": "It's like spending 10 years in Spain and never learning Spanish."}, {"text": "And this is just the beginning."}, {"text": "There's also...the history."}, {"text": "Every sports fan I've talked to seems to have a pretty in depth understanding of each team, their eras, notable players during certain times, who won what, and the entire narrative surrounding various rivalries, and general team lore."}, {"text": "I'm talking like...the average fan, let alone the superfans."}, {"text": "This isn't stuff you can just go read about in a book or on Wikipedia."}, {"text": "We're talking thousands of minute details, only possible to acquire after decades of dedicated watching."}, {"text": "Most sports fans started watching as kids."}, {"text": "And this is for good reason, because in order to care about what's going on on screen you need to be pretty educated and familiar with the rules, regulation, know what to watch for, know what to speculate, etc."}, {"text": "What I'm trying to say is, they grew up with baseball cards, played football on the playground at recess and have built positive memories and associations with the sport over watching over 1000 games."}, {"text": "How could I ever compete with that, even on a small scale?"}, {"text": "What's my incentive to care about the game?"}, {"text": "I try and create an artificial incentive within me, but ultimately something that flimsy can't carry me through watching dozens of hours of football."}, {"text": "There needs to be a genuine interest in the whole thing, but the only incentive I've gotten over the short list of games I enjoyed is a momentary rush."}, {"text": "I did watch the Cavs play in the Playoffs into the Finals a few years back, and I suppose that was exciting to watch from week to week."}, {"text": "But once again, it was all very momentary."}, {"text": "Perhaps that's the point?"}, {"text": "Your 23, you have another 40+ years of life."}, {"text": "Other people your age started at most 20 years ago as children."}, {"text": "You should be able to do it faster if you try."}, {"text": "Pick one local team from one sport."}, {"text": "Watch as many games as you can."}, {"text": "Learn the players names and positions."}, {"text": "Learn the second string players."}, {"text": "Figure out team strategies your team uses."}, {"text": "The first season will be hard."}, {"text": "Season 2 will be easier and soon enough to get it."}, {"text": "Think if it as you're starting a new show that's already in it's 100th season."}, {"text": "Every season is exactly the same though."}, {"text": "You personally not being able to get in to watching sports doesn't mean this applies to everybody."}, {"text": "I think if there is a genuine interest you can do it, if you're trying to force yourself to like something because all the cool kids do you'll probably fail."}, {"text": "I'm not much of a team sports guy but I've got quite in to strength sports and martial arts as an adult, traveled to watch competitions, learned about their histories, athletes from different eras, what they brought to the table etc."}, {"text": "Probably helps that I started competing in some of these sports as well though."}, {"text": "I'd say find a sport which is right for you."}, {"text": "I think individual sports are probably easier since you don't need to memorize whole teams but I get the feeling the team spirit is something you want to get in to."}, {"text": "Don't try to take on too much at once, starting out and trying to follow 6 different sports at once is certainly going to be too much to take in."}, {"text": "Also by all means research the sports you want to know more about but don't stress yourself out, relax a bit and just try to enjoy the games."}, {"text": "It seems like the problem is you want to be into sports instead of just being into sports."}, {"text": "If the sport interests you, you will naturally look into it more and be curious about things and engage with it even if you don't understand it all and over time you will learn more."}, {"text": "You will learn the players names because you are genuinely curious about who they are and that will cause you to enjoy finding out about them."}, {"text": "Your post reads like you feel like you should be into it and you want to be one of those guys who is into sports, but that idea is more important to you than the actual sport."}, {"text": "Find a sport and a team you care about the most and focus on them"}, {"text": "Regular season games are usually pretty boring anyways."}, {"text": "Only following the postseason is totally viable"}, {"text": "A personal anecdote to show that this isn't the case."}, {"text": "I didn't watch my first game of American football until I was around that age."}, {"text": "A few of my mates were avid fans though and were a man short in their fantasy football league."}, {"text": "I didn't understand the rules at first and it seemed incredibly slow compared to other sports I'm used to... but between engaging in the competition and watching it among friends I got into it as an adult."}, {"text": "I'm a big fan of hockey and I didn't get into it until I was 21 and all my friends jumped on the Hawks playoff bandwagon."}, {"text": "It took a while for me to learn but I did a lot of reading Wikipedia, lurking hockey subreddits, watching games and listening on the radio."}, {"text": "Now I do crazy shit like stream NWHL games on Twitch and follow the Australian Hockey League during the American off season."}, {"text": "If the genuine interest is there, the genuine interest is there."}, {"text": "It doesn't matter what age you are."}, {"text": "I can relate except I was a super sports fan starting in elementary school and then towards the end of high school I noticed it became a chore to watch games and I didn't really care much about outcomes."}, {"text": "I'm 22 and part of me wishes I could get back into it and actually care about my hometown teams especially, but at the same time I realize I have an opportunity to spend my time doing things I'd much rather do and are more important than watching a sports game on TV, that doesn't affect my life in the slightest."}, {"text": "A friend of mine patiently taught me how to manually keep score and stats (like with an old school sheet and pencil) at a live AAA baseball game."}, {"text": "No loud announcers, no big distractions, nice summer day... just taught me what to look for and how to enjoy the game."}, {"text": "I enjoy watching baseball more now."}, {"text": "I don't know that I'll ever be a rabid fan, but understanding the minutia and data helped me a great deal."}, {"text": "I can give you a very simple example to show you you're wrong."}, {"text": "Have kids who are into a sport and you will become invested in a sport you may have known nothing about until your kid started it."}, {"text": "You arent too old."}, {"text": "Played some football as a teenager, then later played some volleyball and soccer with work colleagues, but nothing serious."}, {"text": "Never got into jogging."}, {"text": "At age 50, I started endurance running, and have now completed 5 marathons (26.1 miles/42.2 km) and about 8 half marathons, all in the past 6 years."}, {"text": "So yeah, it is never too late."}, {"text": "You may just not have found the sport you like yet."}, {"text": "I have a good friend who dislikes almost all sports involving teams and balls, but who is rabid for Formula One."}, {"text": "I think a more accurate way to phrase your title is that it's impossible for an adult to get into any interest that doesn't actually interest them."}, {"text": "I think this is true, children are more malleable and willing to slowly become interested in liking something over time just to fit in, while adults instinctively don't have this patience."}, {"text": "\"The few games I enjoyed were either championships or really close\"."}, {"text": "You and everyone else."}, {"text": "No one enjoys a blowout, even when you are winning."}, {"text": "This is true fan or novice."}, {"text": "\"There's also the history\"."}, {"text": "You say that there is nowhere to get it, but you also say every fan knows it."}, {"text": "You do realize this is contradictory, if the fans know it, than just ask the fans."}, {"text": "It can well take 3 hours, but it will be highly enjoyable to tell and to listen too."}, {"text": "Children learn from their parents, so can you, except instead of parents it's existing adult fans."}, {"text": "If you don't like the standing around, may I suggest basketball or hockey, rather than football or baseball."}, {"text": "\"It doesnt happen to me."}, {"text": "It must be impossible.\""}, {"text": "I mean, I know this is definitively untrue because I have got into sports as an adult that I never watched as a child."}, {"text": "But you can't start a new show at the 100th season and expect to understand what's going on."}, {"text": "You'd have to watch all the other seasons, which isn't possible to do because the games aren't available."}, {"text": "Funny you say that, because I've heard most fans say the opposite, and I've gotten a fair amount of flak for just watching towards the end of the seasons."}, {"text": "They don't seem to think there's a point in watching the final games if you haven't been paying attention to the rest."}, {"text": "Not a whole lot of friendliness for jumping in late, with terms like \"Fair-weather fan\" \"band-wagoner\", etc."}, {"text": "being thrown around often."}, {"text": "\"I didn't understand the rules at first and it seemed incredibly slow compared to other sports I'm used to\""}, {"text": ""}, {"text": "You were into other sports though before getting into football."}, {"text": "What I'm talking about is not getting into sports whatsoever until your 20s"}, {"text": "Interesting, what made you care about it?"}, {"text": "What are some of your other hobbies you enjoy doing?"}, {"text": "Sounds pretty peaceful, although for me to be able to do that I'd have to go to a live game sometime with someone knowledgeable."}, {"text": "Sounds interesting though, I'll keep it in mind!"}, {"text": "That's true, you could gain a lot of information from just consistently talking to other fans."}, {"text": "I guess it's just hard because I only have one friends who's into sports."}, {"text": "But talking to him about it wouldn't be a bad place to start."}, {"text": "I can only speak for myself."}, {"text": "Would you rather I speak for others?"}, {"text": "You've gotten into new sports in addition to ones you watched as a child, right?"}, {"text": "Or had you never been into sports prior to that?"}, {"text": "Yeah but each season is pretty much a standalone season by itself"}, {"text": ">But you can't start a new show at the 100th season and expect to understand what's going on."}, {"text": "Doctor Who is picks up new fans."}, {"text": "And its first show aired the same day Kennedy was shot."}, {"text": "I became a fan of the Lakers in the late 80's, when they already had an established history."}, {"text": "I didn't have to go back and watch old seasons."}, {"text": "And I didn't begin watching NFL games until I was in my 30's."}, {"text": "Prior to that I didn't care about the sport beyond the tailgating aspect of college life."}, {"text": "I never played it, watched it or cared about it."}, {"text": "Then I moved to a new town where I didn't know anyone and had a lot of free time on my Sundays."}, {"text": "So I started watching."}, {"text": "I have since moved again and live near my cousin."}, {"text": "We spend all day on Sundays watching NFL Redzone, which is an intense way to watch football."}, {"text": "You missed the end of his analogy."}, {"text": ">Every season is exactly the same though."}, {"text": "Sports are nothing like TV shows."}, {"text": "There's no continuity between games."}, {"text": "Just for example."}, {"text": "Do you play any video games?"}, {"text": "CS:GO?"}, {"text": "PUBG?"}, {"text": "LoL maybe?"}, {"text": "Say you played CS for a while, you might not be very good at it but at least you have an understanding of how the game is played."}, {"text": "If you stopped for a day or even a week."}, {"text": "Knowing that there are tens of thousands of games being played without you during that week."}, {"text": "When you get back to it the next week."}, {"text": "Do you suddenly stop understanding the game because of the games you missed?"}, {"text": "No you wouldn't."}, {"text": "Sports are exactly the same way."}, {"text": "I used to watch soccer but I haven't been for over a decade save for world cup."}, {"text": "If I were to randomly start watching, say, the Premier League."}, {"text": "I could still watch the game without issue."}, {"text": "I probably wouldn't know most of the players."}, {"text": "But you can easily associate commentator's comment with what's happening on the screen without knowing their names."}, {"text": "I would need to check the standings if I care about it enough to want to know the position of the teams involved."}, {"text": "But that's about it."}, {"text": "You don't really need to watch all the other games that happened before this one to understand it."}, {"text": "Each game is like a self contained movie."}, {"text": "What you're lacking is knowledge."}, {"text": "Starting from the very basic \"what are the rules of this sport\"."}, {"text": "This is easily readable everywhere."}, {"text": "You can understand the rules of any sport without even watching a game."}, {"text": "It will probably take less than an hour too because I don't think there are many sports with very complicated rules."}, {"text": "After you've done that, you can basically start watching games and mostly understand what's happening."}, {"text": "And the commentators will stops sounding like they're talking gibberish."}, {"text": "At that point, all you're missing is the understanding of strategies and that can only come with time if you keep watching."}, {"text": "And this"}, {"text": ""}, {"text": ">There's also...the history."}, {"text": "Every sports fan I've talked to seems to have a pretty in depth understanding of each team, their eras, notable players during certain times, who won what, and the entire narrative surrounding various rivalries, and general team lore."}, {"text": "I'm talking like...the average fan, let alone the superfans."}, {"text": "This isn't stuff you can just go read about in a book or on Wikipedia."}, {"text": "We're talking thousands of minute details, only possible to acquire after decades of dedicated watching."}, {"text": "There's really nothing wrong about not understanding those things."}, {"text": "You shouldn't be able to when you're barely starting."}, {"text": "But saying it would take *decades of dedicated watching* is over exaggerating."}, {"text": "If you care about it enough, it wouldn't take more than two seasons."}, {"text": "And if you don't want to invest that much effort into it, there's nothing wrong about being a casual fan."}, {"text": "If you have an understanding of the rules and a team you like."}, {"text": "You've got everything you need to enjoy it."}, {"text": "I can't give a personal anecdote about that... but I still believe it's possible."}, {"text": "It's not just about watching the game but everything associated with it."}, {"text": "If it was just me sitting alone at home I'd have better things to do with my time."}, {"text": "But if it involved a BBQ and drinks with my friends and cheering for a team I'm invested in it is a different story."}, {"text": "Have you ever been to a stadium with 80,000 cheering fans?"}, {"text": "The atmosphere is electric."}, {"text": "At first I started watching it because my friends cared a lot about it, and there's worse ways to spend an evening than watching hot guys beat the shut out of each other."}, {"text": "But as I learned the rules and strategy, I got more and more into it and now I genuinely really enjoy the game itself."}, {"text": "Pursuing bodybuilding, training, cooking all my meals and eating a lot throughout the day."}, {"text": "That's what I consider hobby."}, {"text": "Theres subreddits for each sports team with everyone from newbies to experts."}, {"text": "Your post did."}, {"text": "In addition."}, {"text": "But, these were sports that are basically not watched in my original country."}, {"text": "Sure, I enjoy sports a lot more when there's an event tied to it."}, {"text": "But then it becomes a little hazy for me."}, {"text": "Is it the event I enjoyed or the sports inheriently?"}, {"text": "Because I probably get the same enjoyment or more from going to a great concert or a new year's eve party watching the countdown."}, {"text": "Ok, well I wasn't talking about any specific sport."}, {"text": "Your case is different than mine because it sounds like you were always a sports fan."}, {"text": "The event and the sport can become associated... and after a while of watching you usually start appreciating the game on another level."}, {"text": "You get invested in one team or another."}, {"text": "You also understand the strategy and recognise the skill."}, {"text": "I don't know any sports fan who is a fan of ALL sports."}, {"text": "That's not a thing."}, {"text": "Everyone picks and chooses."}, {"text": "You're right, it's impossible to follow them all."}, {"text": "I was just saying that since you were at least a fan of one sport before going into your new one, you were already a sports fan going into the next one."}, {"text": "My situation is different since I've never been a fan."}, {"text": "I don't really get that."}, {"text": "Watching baseball is completely different than watching gaelic football or rugby."}, {"text": "Ok, I'll explain it like this."}, {"text": "Let's say I'm a clothing designer and I mainly design sneakers."}, {"text": "A few years into my career I switch to designing boots."}, {"text": "I've always been a clothing designer, and I've always focused on footwear, but now I'm just changing my focus."}, {"text": "But you wouldn't say designing sneakers and designing boots are completely different things."}, {"text": "That's the rugby to baseball thing."}, {"text": "You switched from one sport to another, but you always \"got\" sports."}]